{"url": "https://www.primermagazine.com/2025/spend/fall-getup-week-chasing-the-iconic-skyfall-shot-through-scotland-in-classic-casual", "title": "Fall Getup Week: Chasing the Iconic Skyfall Shot Through Scotland in Classic Casual", "author": null, "publish_date": null, "text": "ByAndrew Snavely The road out of Glencoe doesn’t ask for much. You slow down, watch the clouds drag across the peaks, maybe pull over just to stand in it for a minute. The crew that filmed Skyfall did the same thing: same landscape, same road, better car. We were there chasing light, not Bond, but the place made sense for what we were shooting.Fall Getup Weekwas built on that same idea: clothes that hold up when the air turns, layers with structure, fabrics that look better when they've gotten to work against weather. There’s a particular honesty in waxed canvas and heavy knits when the wind gets moving. Something about the resistance they offer. The outfit leans into that instinct, all countryside layers and clean edges, modern cuts with a practical attitude. A structured silhouette, room through the leg… it could have walked off a moor or a coffee shop in Chicago. If you’ve ever watched Skyfall and thought, Bond looks better without the suit, you’re not alone. Costume designer Jany Temime had the same thought. For Skyfall’s last act, she took Bond out of the city, out of the armor, and put him in things meant for weather: waxed cotton, cable knits, boots with soles that don’t require rerouting around puddles. Her description was “a gentleman in the country.” And it fit. Not just him, but the franchise. Bond clothes have always served the setting. That was the trick: put him where he doesn’t usually go, but dress him so it makes sense. One of the most memorable scenes in the whole Bond franchise didn’t involve a fight or a gadget. No stunts, no explosions, barely any dialogue. Just Bond and M standing beside the DB5 under a fog-choked sky:  Get the look →Waxed canvas trucker jacket: Thursday Boot Co.,Cable knit sweater: LLBean,Legend Chelsea boots: Thursday Boot Co.,Medium wash denim: Flint & Tinder   That shot was filmed in Glencoe, on a long single lane road that slows cars down without asking. The kind of place where you keep pulling off without planning to. When I found out it was a short detour off of our already long drive from Edinburgh to the Isle of Skye, I knew we had to stop. The crew shot it in February. Not the friendliest month. You get short daylight and weather that flips every hour. But director Sam Mendes wanted that. Mist, clouds, some visibility. Cinematographer Roger Deakins liked the diffused light. There was no CGI. No filters. Just real weather and expensive lenses. Mendes later said it was a joy, that he wished they had more time there. Which is how most people feel about Scotland, assuming they brought the right jacket. We didn’t have fog. The airport Hertz was fresh out of mid-century Aston Martins. No Javier Bardem trying to kill us. Just a clear Scottish afternoon that made me question everything my weather app had predicted.    Get the look →Waxed canvas trucker jacket: Thursday Boot Co.,Cable knit sweater: LLBean,  But the British countryside aesthetic itself started as gear for people who didn’t have trailers or set lighting. This kind of clothing started out as survival gear. Tweed for warmth and brambles, waxed cotton for rain, wool for insulation, leather boots for mud. All of it designed for damp unpredictability. But somewhere along the line, the function became a kind of uniform. The country gentleman. Earth tones, tattersall shirts, thick socks, shoes you can clean with a stiff brush. Some of the details go further back. Sailors started the whole waxed canvas thing when they oiled their sails for water resistance. Farmers adopted it. By the 1930s, it was being refined with paraffin wax for better flexibility. The brogue, now polished and decorative and considered a “dress shoe” by most, was originally perforated to let water drain. You wore them across marshes, not marble lobbies. This week’s concept, 1990s J.Crew proportions and prep meets British countryside isn’t out of left field. J.Crew’s prep filtered through Ivy style, which had already borrowed heavily from the Anglo wardrobe. By the 90s, the catalogs were full of waxed jackets, tweed blazers, and sweaters that looked inherited. It was British structure, American business casual, still built for weather. These aren’t trivia bits. They’re the reason the outfit still works. Still makes sense when fall hits and you’re suiting up against the weather.   Sturdy, structured, doesn’t mind a little weather. Comfortable layered over a sweater, still plausible over a tee. The 10 oz  Scottish-made Halley Stevensons waxed canvas comes with a flannel lining and the faint sense that you should be carrying something in the back of a Land Rover. Halley Stevensons has been making their weather resistant fabrics in Dundee, just a hop and a skip from Edinburgh, since 1864. →Thursday Boot Co.  Thick but not suffocating, the kind of knit that used to be made by people who didn’t have central heating. Fisherman in theory, civilian in practice. →LLBean  Chunky sole, smooth upper, the shoe equivalent of a strong handshake. Goodyear welted with a StormKing anti-slip sole, and still in my weekly rotation since first featuring them in 2020. I also wore them daily on the trip, including on long hikes, like up to Old Man Storr. Perfectly comfortable and capable. →Thursday Boot Co.  The SNK809 is 37mm of do-the-job steel, automatic and low-fuss, with a dial that glows just enough to be useful and a canvas strap that feels like it came from a tent. It tells time, day, and date without needing a charge or compliment, which fits the outfit. Built for weather, not ceremony. →Seiko  Straight, modern fit, no pinching or pulling. The medium wash keeps things relaxed and easy. →Flint & Tinder Sometimes, as Moneypenny said, the old ways are the best. Subscribe to our free newsletter and don't miss an outfit.   Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine.", "paragraphs": ["ByAndrew Snavely", "The road out of Glencoe doesn’t ask for much. You slow down, watch the clouds drag across the peaks, maybe pull over just to stand in it for a minute. The crew that filmed Skyfall did the same thing: same landscape, same road, better car. We were there chasing light, not Bond, but the place made sense for what we were shooting.Fall Getup Weekwas built on that same idea: clothes that hold up when the air turns, layers with structure, fabrics that look better when they've gotten to work against weather.", "There’s a particular honesty in waxed canvas and heavy knits when the wind gets moving. Something about the resistance they offer. The outfit leans into that instinct, all countryside layers and clean edges, modern cuts with a practical attitude. A structured silhouette, room through the leg… it could have walked off a moor or a coffee shop in Chicago.", "If you’ve ever watched Skyfall and thought, Bond looks better without the suit, you’re not alone.", "Costume designer Jany Temime had the same thought. For Skyfall’s last act, she took Bond out of the city, out of the armor, and put him in things meant for weather: waxed cotton, cable knits, boots with soles that don’t require rerouting around puddles. Her description was “a gentleman in the country.”", "And it fit. Not just him, but the franchise. Bond clothes have always served the setting. That was the trick: put him where he doesn’t usually go, but dress him so it makes sense.", "One of the most memorable scenes in the whole Bond franchise didn’t involve a fight or a gadget. No stunts, no explosions, barely any dialogue. Just Bond and M standing beside the DB5 under a fog-choked sky:", "", "Get the look →Waxed canvas trucker jacket: Thursday Boot Co.,Cable knit sweater: LLBean,Legend Chelsea boots: Thursday Boot Co.,Medium wash denim: Flint & Tinder", "", "", "That shot was filmed in Glencoe, on a long single lane road that slows cars down without asking. The kind of place where you keep pulling off without planning to. When I found out it was a short detour off of our already long drive from Edinburgh to the Isle of Skye, I knew we had to stop.", "The crew shot it in February. Not the friendliest month. You get short daylight and weather that flips every hour. But director Sam Mendes wanted that. Mist, clouds, some visibility. Cinematographer Roger Deakins liked the diffused light.", "There was no CGI. No filters. Just real weather and expensive lenses. Mendes later said it was a joy, that he wished they had more time there. Which is how most people feel about Scotland, assuming they brought the right jacket.", "We didn’t have fog. The airport Hertz was fresh out of mid-century Aston Martins. No Javier Bardem trying to kill us. Just a clear Scottish afternoon that made me question everything my weather app had predicted.", "", "", "", "Get the look →Waxed canvas trucker jacket: Thursday Boot Co.,Cable knit sweater: LLBean,", "", "But the British countryside aesthetic itself started as gear for people who didn’t have trailers or set lighting.", "This kind of clothing started out as survival gear. Tweed for warmth and brambles, waxed cotton for rain, wool for insulation, leather boots for mud. All of it designed for damp unpredictability. But somewhere along the line, the function became a kind of uniform. The country gentleman. Earth tones, tattersall shirts, thick socks, shoes you can clean with a stiff brush.", "Some of the details go further back. Sailors started the whole waxed canvas thing when they oiled their sails for water resistance. Farmers adopted it. By the 1930s, it was being refined with paraffin wax for better flexibility. The brogue, now polished and decorative and considered a “dress shoe” by most, was originally perforated to let water drain. You wore them across marshes, not marble lobbies.", "This week’s concept, 1990s J.Crew proportions and prep meets British countryside isn’t out of left field. J.Crew’s prep filtered through Ivy style, which had already borrowed heavily from the Anglo wardrobe. By the 90s, the catalogs were full of waxed jackets, tweed blazers, and sweaters that looked inherited.", "It was British structure, American business casual, still built for weather.", "These aren’t trivia bits. They’re the reason the outfit still works. Still makes sense when fall hits and you’re suiting up against the weather.", "", "", "Sturdy, structured, doesn’t mind a little weather. Comfortable layered over a sweater, still plausible over a tee. The 10 oz  Scottish-made Halley Stevensons waxed canvas comes with a flannel lining and the faint sense that you should be carrying something in the back of a Land Rover. Halley Stevensons has been making their weather resistant fabrics in Dundee, just a hop and a skip from Edinburgh, since 1864.", "→Thursday Boot Co.", "", "Thick but not suffocating, the kind of knit that used to be made by people who didn’t have central heating. Fisherman in theory, civilian in practice.", "→LLBean", "", "Chunky sole, smooth upper, the shoe equivalent of a strong handshake. Goodyear welted with a StormKing anti-slip sole, and still in my weekly rotation since first featuring them in 2020. I also wore them daily on the trip, including on long hikes, like up to Old Man Storr. Perfectly comfortable and capable.", "→Thursday Boot Co.", "", "The SNK809 is 37mm of do-the-job steel, automatic and low-fuss, with a dial that glows just enough to be useful and a canvas strap that feels like it came from a tent. It tells time, day, and date without needing a charge or compliment, which fits the outfit. Built for weather, not ceremony.", "→Seiko", "", "Straight, modern fit, no pinching or pulling. The medium wash keeps things relaxed and easy.", "→Flint & Tinder", "Sometimes, as Moneypenny said, the old ways are the best.", "Subscribe to our free newsletter and don't miss an outfit.", "", "", "Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine."], "word_count": 1054, "content_type": "general", "normalized_url": "https://www.primermagazine.com/2025/spend/fall-getup-week-chasing-the-iconic-skyfall-shot-through-scotland-in-classic-casual", "site_name": "Primer Magazine", "site_domain": "primermagazine.com"}
{"url": "https://www.primermagazine.com/2025/spend/types-of-jackets", "title": "Types of Jackets: An Encyclopedic Guide to Finding Your Perfect Style + How to Wear Them [28 Styles]", "author": null, "publish_date": null, "text": "Revised & Updated Fall 2025 When I was in college, I got a job working at the Cole Haan boutique in the King of Prussia Mall near Philly. Cole Haan's shoe styles were still somewhat conservative, but their men's jackets had a rebellious flare that quickly seduced me. After a year, I'd racked up $2000 worth of jackets (though I won't say how much I actually paid with my employee discount). It's been well over a decade, and I still have all of those jackets…and several more. When you throw your jacket on in the morning, you setthe tone for your day. Like choosing between loafers or workboots, choosing between different types of jackets is a matter of formandfunction. What's the temperature? Could it rain or snow? Am I feeling formal, casual, business, or athletic today? Your jacket choice is the result of these decisions. But sometimes, you might not know where to start. We've compiled a list of the most common men's jacket styles. Keep the list going in the comments if we didn't include your favorite or if you have experience with any of our picks. Thefield jacketis one of the few sartorial pieces that perfectly mates form with function, meaning 1) It will never go out of style, and 2) You'll always have a spare pocket for your keys. The field jacket is easily recognizable as it typically has 3-4 exterior pockets and a generous fit (so you can layer up underneath). The originalM-65 field jacketwas developed in tandem with NYCO, a cotton/nylon blend that offered improved water and wind resistance over previous iterations. Today, outerwear companies have gotten creative with their fabrics, offering field jackets in cotton canvas,waxed canvas, and cotton blends. As the design evolved, it branched into three main styles: themilitary field jacket(based on the M-65), thebarn-style field coat(country and workwear-inspired), and themotorcycle field jacket(belted and waxed for weather and speed). Each traces its roots to the same purpose-built heritage, adapted for a different environment. The barn jacket comes from a different field, literally. It was designed for work around farms and barns, built from heavy cotton canvas or waxed cotton with a boxier cut and a soft corduroy collar. Where the field jacket’s structure comes from military design, the barn jacket’s comfort comes from rural practicality. It often includes flannel or quilted lining for warmth, patch pockets placed lower on the body, and a more relaxed fit overall. There’s clear overlap between the two: both are utilitarian, built for layering, and look better with age. The field jacket leans precise and tactical, the barn jacket leans easy and broken-in. One feels ready for a mission, the other for a long walk through wet leaves, but both embodytimeless, functional outerwear that never feels out of place. Brands like Barbour,L.L.Bean, and Orvis popularized the modern versions. TheBarbour BedaleandBeaufortin particular represent the classic countryside field coat: water-resistant, durable, and refined enough for the city. While the field jacket feels military and structured, the barn jacket feels relaxed and ready for anything. Read more about field jackets:The 10 Best Field Jackets How to wear a field jacket: The Belstaff Jacket (originally spelledBellstaffand often called the “moto”) was introduced in 1924 in Staffordshire, England. The goal was straightforward: make durable, weatherproof gear for motorcyclists. They used Egyptian cotton treated with wax, creating one of the first breathable yet water-resistant fabrics in commercial outerwear. Unlike the military field jacket or the rural barn coat, the motorcycle field jacket was engineered for movement and protection. It’s longer than a typical leather moto, often belted at the waist to stay secure while riding, and reinforced at key seams. The four symmetrical front pockets and high, buckle-fastening collar weren’t decorative: They served practical needs for tools, maps, and shielding from wind. The design became standard gear for British riders in the mid-20th century and later caught on as rugged everyday wear. TheBelstaff Trialmasterand Barbour International remain the two definitive examples, both using waxed cotton and a structured cut that still feels modern. Today’s versions carry the same purpose-built DNA, bridging function and style in a way few jackets manage. A waxed moto field jacket offers weather protection, shape, and attitude without the bulk or heat of leather. How to wear a moto jacket: You probably know that thebomber jacket was originally created for pilots, but you may not know that the streamlinedsilhouetteyou see today was at the outset, crafted from seal leather and lined with fur. Over the decades, the bomber has seen several iterations, loosening its insulation requirements as airplane cockpits have become warmer. Today thebomber jacket is the throw-it-on-for-anything jacketin terms of style: Going to the store in your sweats for milk? Throw on your bomber. Going out for drinks with the fellas? Bomber. And with different colors, cuts, and levels of warmth available, you can have a different bomber for each season. Not sure where to start? Try something like thislightweight bomberfrom Levi's. The polyester will resist the wind and rain, and the trim cut will keep you looking svelte. Learn more about bomber jackets:The Bomber Jacket: How to Wear It Bomber jacket outfits: Technically yes, in real use the line is blurry. By definition, a coat is an outer garment for the upper body, a jacket is the shorter cousin, everyday language stretches both. Some jackets go past the hips, some coats stop short. The M65 field jacket runs to the thigh, brands and the public call it a jacket, the original military spec even labeled it a coat. Pea coats sit at the hip, car coats land mid-thigh, topcoats come lighter than overcoats, so length and weight refuse to play hall monitor. A coat is usually your outermost, weatherproof, insulating layer (overcoats, topcoats, trench coats). A jacket might be short, light, tailored, rugged, or warm depending on context (field jackets, sport coats, leather jackets, bombers). Parkas are often treated as jackets, some sources list them as coats too. Why the overlap, and why the names that ignore logic. History and function set the families, culture cements the labels. Sport coats started as country-sport gear, now a tailored jacket worn without matching trousers. Trench coats take their name from construction and military origin, warmth varies. Bottom line, labels follow style families and history, not strict measurements, so expect exceptions. Plenty of companies make a denim jacket, but no on does it quite like Levi's. The denim, or jean jacket dates back to the late 1800s. It was originally created for farmers and gold prospectors with seams that could be easily let out and moved if the wearer needed a looser fit. When you picture a denim jacket, you probably see this one fromLevi's, which is their classicTrucker Jacket. The metal buttons and v-shaped seams make it unmistakable. Suitable for a spring day with a light breeze, a summer evening, or a fall evening with layers, the denim jacket has a rugged casualness that looks laid back but intentional. We feature it regularly in our outfit inspiration due to its versatility amongsmart casual. It's important to note that while the denim trucker jacket is the most ubiquitous, there are other types of jackets that can be made of denim, most commonly a chore coat: Read more about denim jackets:What’s The Difference Between A Trucker Jacket And A Denim Jacket? How to wear: Thetrucker jacket has an intriguing history, from protecting cowboys from storms to keepingRobert Redford looking like a stud. The trucker jacket is a specific design of jacket that can be made of various materials, which features a waist-length cut, tall collar, and generally one or two chest pockets. Cinching button flaps on the back waist that narrow the opening are also standard. The most common trucker jacket you'll see is the Levi's denim one that we've featured above, but for a little added comfort and weather resistance, we like a trucker made from waxed sailcloth likethis onefrom Flint and Tinder. The fabric comes from New Jersey, and the jacket is crafted in Los Angeles with a soft flannel lining to keep you warm. Flint and Tinder (which started as an American-made underwear company) even takes the extra time to wax the fabric on both sides for extra resilience. Creases and scuffs will help this jacket age with character and a 60-day return policy gives you the time to make sure it's the right fit and style for you. Read more and see early designs of the trucker jacket:The Fascinating Evolution of the Trucker Jacket Outfits featuring trucker jackets: Back in October, we started getting our house ready to sell. There was a myriad of jobs to do, and the weather was just starting to turn chilly. One crisp Saturday morning I threw on my chore coat with a t-shirt and a sweatshirt underneath and set aside two hours to pressure wash the front of the house. But you know how it goes when you get pressure washin'. Next thing I know I'm doing the back porch, and then I started eyeing up the deck. Five hours and two meals later, I'd ditched the sweatshirt, but I was still rockin' the chore coat over my t-shirt. It's for a walk in the woods or a casualweekend away. Made from cotton canvas, wool, or denim, thechore coathas a roomy cut for layers and a rugged construction that dares you to do some real work. Go get dirty. A few chore coats worth checking out:The 11 Best Chore Coats How to wear a chore coat: When abutton-up shirtisn't enough, the shirt jacket steps in for that added layer of warmth. It is known by various names depending on what region you're from including shirt jacket, shirt jac, CPO jacket, or shacket. The advantage of the shirt jacket is how well it allows you to move (since really, it's just like wearing another shirt). You get the warmth of a light jacket without the added bulk, kind of like an alternative to ashawl collar cardiganor hoodie. This affordable one from Amazon comes in 12 colors and patterns and is made from polyester to give you the fleece feel with the shirt fit.Style it with a dark shirt, denim, and your favorite pair of bootsfor a hale fall look. How to wear a shirt jacket: I'm a prep. Freshly shined penny loafers with a pair of Nantucket reds and a bow tie, and I feel right at home (maybe a copy of Gatsby in my back pocket in case I get bored). On a sunny day, you'll see me rockin' my basket-weavenavy blazer, but if there's a chill in the air, I get out the Harrington. Like a Mini Cooper with a hemi, theHarringtonis a total sleeper in terms of versatility. Also known as a blouson jacket, wear a Harrington with chinos and a button down; wear it with jeans and yourbrown leather sneakers. Hell, throw it onwith a pair of shortson a cool summer evening. Keep in mind that just because the originalG9 jacket from English brand Baracutahas become a cult classic since its inception in the 1930s, you don'thaveto spend $400. This one from Uniqlo was $30 and looks swell. See the long history of the Harrington:The Harrington Jacket – How to Wear It, History, & Affordable Picks Harrington jacket outfits: It was fifty-five degrees in my part of Pennsylvania today, and my wife and I had some errands to run (My mom watched the kids, so we called it a date). I threw on jeans, suede chukkas, a sweatshirt, and my leather jacket, and I felt smooth. The leather jacket is the ultimate feather in the cap ofsmart casual: It's intentional without being presumptuous. Leather jackets can come in lots of different styles, from the classic racer style to bombers, blazers, and everything in between. The most famous style is probably the double rider: The classic leather jacket with big collars and asymmetrical zipper, shown in its own section below. The first commercially available leather jacket was released in the early 1900s for motorcyclists; if you fell, the leather would take the brunt of the road rash instead of your own skin (it took a while to figure out that helmets were a good idea too). Marlon Brando and James Dean wore leather jackets inThe Wild OneandRebel Without a Causerespectively, and suddenly it was the sartorial staple of the 1950s. Perfect for fall days or days like today when spring is doing its best to make an entrance. A jacket made from great leather will outlast you: Primer editor and founder Andrew Snavely has a1940s horsehide motorcycle cop jacket. How to wear a leather jacket: If you're feelin', as my grandfather would say, as bad as you gotta be, you might want to pick up a biker jacket. Biker jackets feature a trim cut (so they're not great for layering), a short torso (so you can easily lean over the side of your bike without having a button dig into your pelvis), and ample hardware for ruggedness. While the double rider biker jacket lends itself to a more casual look, it actually complements ashirt and tie quite well. Pairing your work wear with a little bit of renegade is always a cool move. When I hear polyester, my mind goes toSaturday Night Fever, but the polyester of today is not the polyester of the 1970s when your dad wore platform shoes and shirts with collars points down to his armpits. Today's polyester fleece is lightweight, soft, and breathable, allowing you to stay warm and (relatively) dry without breaking a sweat. It won't shrink when you dry it, and because it's a synthetic fabric, it keeps its shape. The best part? You don't need to drop $100 to get a more-than decent fleece jacket. This fleece from Amazon comes in 26 styles and hits a price point that won't make you cringe. The pea coat is one of the few coats that has seen very little change since its inception. Why? Because it's hard to update perfect. Like quite a few men's coats, the pea coat finds its roots in the military,originally crafted in the 1700s for Dutch sailorsfrom rough, thick wool. The term “pea” is thought to come from the Dutch word “pij” or “pije” (depending on the source), which described the wool. The British navy popularized the style, and we're still wearing them today. The modern pea coat is slightly more fitted than the original, but the oversized collar, hem just below the waist, and double-breasted button closure remain. And because a classic never dies, plenty of companies have their own take on thepea coat, meaning you can choose the one that fits your personal taste and your budget. Get a good one:These Are The 23 Best Men's Pea Coats, Car Coats, Walker Coats, and Overcoats How to wear a pea coat: The shearling jacket hits that sweet spot when it's too cool for a trucker but too warm for a pea coat. If you go for genuine shearling, which comes from sheep, you'll spend a few hundred at least (and that's if you catch a deal). Luckily faux-fur shearling (which is essentially hi-pile, textured fleece and labeled as “sherpa”) retains warmth nearly as well as the real thing. It's also easier to maintain (because you can wash it), and it won't mat down as easily as genuine shearling. A sherpa trucker like this one is soft and easy to wear like a heavy sweatshirt. The Mackintosh, or Mac…or rain coat actually dates back to the 1800s. Charles Mackintosh, a chemist, devised a way to insert a layer of liquid rubber between an interior and exterior layer of fabric. And the Mac was born. Traditionally a Mac was cut for wear over a suit, but the modern Mac is slightly tailored. You can certainly layer it over a suit or a thicksweater, but you don't have to. Trench coats became iconic after service by British officers in World War I, but their story starts almost a century earlier, as a response to the popularity of the Mackintosh coat. Traditionally trench coats are below the knee, double breasted and feature wide lapels, and a waist belt, though you can find coats labeled as trench coats that feature other styles. The puffer jacket is your quintessential winter jacket. It's lightweight, it's warm, and it has just enough moisture resistance to get you through a snow shower. There's nothing wrong with an extra puffy puffer jacket, but anymore, insulation technology has allowed for more svelte options likethis onefrom L.L. Bean with down that's been treated to allow it to stay dry even when wet. Also known as a gilet, the vest is one type of outerwear men sleep on the most. It's the perfect layer for those frustrating-to-dress-for days where a thicker coat would be too hot after a certain point. The torso-covering vest keeps heat in while not insulating the arms, a way of regulating body temperature while also looking damn cool. Check outPrimer's guide to this turtleneck and vest combowhich will have you looking as sharp as style contributor Daniel Baraka and not an old guy on the ski lift. The history of the coach's jacket is in the name. In the 90s, this lightweight windbreaker-style jacket (complete with snap button closure) was worn by NFL coaches all over the country (with a big ol' team logo on the back). It moves easily; it resists moisture in case it starts to drizzle, and snap buttons mean it goes on and off easily so the coach can stay comfortable without missing a play. Thismay be the best damn looking jacket on the entire list, and I'm not just saying that because Daniel Craig wears it inNo Time to Die.Ok…that might have something to do with it. Thewaxed canvas jacketis the one you throw on in fall or winter over top of a sweater, or for the spring camping weekend when it's going to be cool at night, but you'll be sitting by the fire. Over time, the canvas will crease, darken, absorb dirt and oil from your hands, and it'll keep looking good. In a few years, throw a fresh coat ofOtter Waxon it, and you're back to factory specs for moisture resistance. Read more about waxed canvas jackets:The 9 Best Waxed Canvas Jackets: History, Style, and Affordable Picks How to wear a waxed canvas jacket: As a card-carrying prep,the navy blazeris my go-to jacket for every season and almost any occasion. It is the essence of versatility in that it looks good on any man regardless of body type, and shy of black-tie-only, it's appropriate for most occasions. A night out with your partner? Throw on the navy blazer with yourfavorite denimand abutton-down. A day at the office? Navy blazer and chinos (Think Andy Bernard. Did you know he went to Cornell?) Office with a morecasual dress code? Navy blazer with denim, a shirt, and tie. You only need one navy blazer, and if you can afford it, I recommend picking up one made of wool. It breathes; it seldom needs cleaning, and thedrapeis always flattering. If that's a little too steep, a wool blend or cotton will do just fine. Navy blazer outfits: Yes, the Mac is handsome, but you're probably not going to wear it to your daughter's soccer game on a rainy Saturday morning. This is where the traditional rain coat comes into play. If you're like me, you're thinking that all that waterproofing doesn't allow for a lot of air movement. But this jacket has a trick up it's sleeve: zippered vents with lightweight mesh to keep moisture out while allowing for air flow. The word anorak comes from the native Greenalndic languageannoraaq. Similar to a parka (itself having native Russian etymology), an anorak is a hooded, pullover hip-length jacket usually made of nylon to provide wind and water protection. They've regained fashion popularity in the last two decades or so and often come in bright solid colors or a mix of bright colors. Due to their pull-over style, nylon construction, and zipper pouch, anoraks arecasual wearjackets, often chosen for weather utility. In the back of my SUV, I have a fleece blanket, amultitool, and a packable jacket. Why? Because dammit you just never know. And let's be honest: the packable jacket is just cool. Here's a piece of clothing that will keep you warmandneatly pack into itself for easy storage – there's something profound in its simplicity. This one fromAmazonis made from nylon (which will cut the wind and resist moisture) with polyester filling for added insulation. And at $45 with 11 color options, it's a no-brainer. When the elements are kicking your ass, you reach for the parka. Originally made from seal skin by the Caribou Inuits, the parka is a garment designed for true cold weather activity and is one of the best types of jackets to stay warm in the winter. The body is cut below the waist, the interior is insulated (usually with down or a down alternative), and pockets have storm flaps and buttons (or velcro). This one from Patagonia is made with recycled 600-fill down, stretch canvas, and a hood that will cover your head and neck. Winter's got nothin' on you. The best part about a suede jacket is that every guy canmake it work. The suede racer compliments any body shape and looks as good at the bar as it does at the office. Suede gives you the durability of leather, but it breathes better and has a soft hand. The first jacket I ever bought from The North Face was anApex. I was 22, fresh out of school, and the Apex was my graduation gift to myself. That was 13 years ago, and it's still hanging in my closet. A tech jacket (named for the tech fabric from which it's made) is the Swiss Army knife of jackets: it's warm, it cuts the wind, and it's waterproof (the Apex uses a proprietary fabric with a polyurethane coating, which allows the fabric to breathe while keeping moisture out). If there's rain in the forecast, and you're going for a hike or traversing the city, the tech jacket won't let you down. The name says it all: the fishtail parka is cut long in the body with a short vent at the bottom of the back, which kind of looks like a…well…you get it.This onefrom Alpha Industries is made from a cotton/poly blend for high breathability while still keeping you dry. The front placket adds a layer of moisture resistance while the drawstrings let you decide how tapered you want the fit. In the springtime, my default weekend outfit is jeans and asolid t-shirt. A simple way to enhance this look is by adding a little texture, and this is what a quilted jacket does best. The quilted jacket has a way of looking fancy yet casual; call it, “laid-back-equestrian.” The quilted jacket is ideal for layering, so throw it over a sweatshirt to cut the wind and lock in a little extra body heat. This one from Ralph Lauren is handsomely classic. How to wear it:There’s No Shame in Being a Jeans & T-Shirt Guy: Here’s How to Do It Intentionally Unfortunately they didn't give out varsity jackets if you were the lead in the musical (not that I'm bitter), but I prefer the kind without letters on them anyway. The varsity jacket traditionally has a wool body with leather sleeves, an American cut (which is to say a bit boxy), and a team's logo on it. These days the varsity jacket has a slightly trimmer cut, and most are made from blends of fleece or cotton. But if you want the real thing, check outthis onefrom Champion. I have a problem with overcoats because they look so damn good over a suit or a navy blazer. So I have four of them. The overcoat is cut long in the body with a little extra room in the chest and sleeves to go over your suit for work. Perhaps more than any other coat on the list, overcoats come in at every price point you can imagine from low-cost options to exorbitantly expensive that costs more than my first car. Camel, navy, or black are the most traditional choices, but don't be afraid togo off the beaten pathwith a pattern. Read more:These Are The 23 Best Men's Pea Coats, Car Coats, Walker Coats, and Overcoats How to wear an overcoat: Mike Henson is a literature teacher in Hershey, Pennsylvania. He enjoys shooting 35mm film, restoring vintage straight blades, purchasing too many American-made goods, and spending time with his wife and their three daughters. ", "paragraphs": ["Revised & Updated Fall 2025", "When I was in college, I got a job working at the Cole Haan boutique in the King of Prussia Mall near Philly. Cole Haan's shoe styles were still somewhat conservative, but their men's jackets had a rebellious flare that quickly seduced me. After a year, I'd racked up $2000 worth of jackets (though I won't say how much I actually paid with my employee discount). It's been well over a decade, and I still have all of those jackets…and several more.", "When you throw your jacket on in the morning, you setthe tone for your day. Like choosing between loafers or workboots, choosing between different types of jackets is a matter of formandfunction. What's the temperature? Could it rain or snow? Am I feeling formal, casual, business, or athletic today? Your jacket choice is the result of these decisions.", "But sometimes, you might not know where to start. We've compiled a list of the most common men's jacket styles. Keep the list going in the comments if we didn't include your favorite or if you have experience with any of our picks.", "Thefield jacketis one of the few sartorial pieces that perfectly mates form with function, meaning 1) It will never go out of style, and 2) You'll always have a spare pocket for your keys. The field jacket is easily recognizable as it typically has 3-4 exterior pockets and a generous fit (so you can layer up underneath). The originalM-65 field jacketwas developed in tandem with NYCO, a cotton/nylon blend that offered improved water and wind resistance over previous iterations.", "Today, outerwear companies have gotten creative with their fabrics, offering field jackets in cotton canvas,waxed canvas, and cotton blends.", "As the design evolved, it branched into three main styles: themilitary field jacket(based on the M-65), thebarn-style field coat(country and workwear-inspired), and themotorcycle field jacket(belted and waxed for weather and speed). Each traces its roots to the same purpose-built heritage, adapted for a different environment.", "The barn jacket comes from a different field, literally. It was designed for work around farms and barns, built from heavy cotton canvas or waxed cotton with a boxier cut and a soft corduroy collar. Where the field jacket’s structure comes from military design, the barn jacket’s comfort comes from rural practicality. It often includes flannel or quilted lining for warmth, patch pockets placed lower on the body, and a more relaxed fit overall.", "There’s clear overlap between the two: both are utilitarian, built for layering, and look better with age. The field jacket leans precise and tactical, the barn jacket leans easy and broken-in. One feels ready for a mission, the other for a long walk through wet leaves, but both embodytimeless, functional outerwear that never feels out of place.", "Brands like Barbour,L.L.Bean, and Orvis popularized the modern versions. TheBarbour BedaleandBeaufortin particular represent the classic countryside field coat: water-resistant, durable, and refined enough for the city. While the field jacket feels military and structured, the barn jacket feels relaxed and ready for anything.", "Read more about field jackets:The 10 Best Field Jackets", "How to wear a field jacket:", "The Belstaff Jacket (originally spelledBellstaffand often called the “moto”) was introduced in 1924 in Staffordshire, England. The goal was straightforward: make durable, weatherproof gear for motorcyclists. They used Egyptian cotton treated with wax, creating one of the first breathable yet water-resistant fabrics in commercial outerwear.", "Unlike the military field jacket or the rural barn coat, the motorcycle field jacket was engineered for movement and protection. It’s longer than a typical leather moto, often belted at the waist to stay secure while riding, and reinforced at key seams. The four symmetrical front pockets and high, buckle-fastening collar weren’t decorative: They served practical needs for tools, maps, and shielding from wind.", "The design became standard gear for British riders in the mid-20th century and later caught on as rugged everyday wear. TheBelstaff Trialmasterand Barbour International remain the two definitive examples, both using waxed cotton and a structured cut that still feels modern.", "Today’s versions carry the same purpose-built DNA, bridging function and style in a way few jackets manage. A waxed moto field jacket offers weather protection, shape, and attitude without the bulk or heat of leather.", "How to wear a moto jacket:", "You probably know that thebomber jacket was originally created for pilots, but you may not know that the streamlinedsilhouetteyou see today was at the outset, crafted from seal leather and lined with fur. Over the decades, the bomber has seen several iterations, loosening its insulation requirements as airplane cockpits have become warmer.", "Today thebomber jacket is the throw-it-on-for-anything jacketin terms of style: Going to the store in your sweats for milk? Throw on your bomber. Going out for drinks with the fellas? Bomber. And with different colors, cuts, and levels of warmth available, you can have a different bomber for each season. Not sure where to start? Try something like thislightweight bomberfrom Levi's. The polyester will resist the wind and rain, and the trim cut will keep you looking svelte.", "Learn more about bomber jackets:The Bomber Jacket: How to Wear It", "Bomber jacket outfits:", "Technically yes, in real use the line is blurry. By definition, a coat is an outer garment for the upper body, a jacket is the shorter cousin, everyday language stretches both.", "Some jackets go past the hips, some coats stop short. The M65 field jacket runs to the thigh, brands and the public call it a jacket, the original military spec even labeled it a coat. Pea coats sit at the hip, car coats land mid-thigh, topcoats come lighter than overcoats, so length and weight refuse to play hall monitor.", "A coat is usually your outermost, weatherproof, insulating layer (overcoats, topcoats, trench coats). A jacket might be short, light, tailored, rugged, or warm depending on context (field jackets, sport coats, leather jackets, bombers). Parkas are often treated as jackets, some sources list them as coats too.", "Why the overlap, and why the names that ignore logic. History and function set the families, culture cements the labels. Sport coats started as country-sport gear, now a tailored jacket worn without matching trousers. Trench coats take their name from construction and military origin, warmth varies.", "Bottom line, labels follow style families and history, not strict measurements, so expect exceptions.", "Plenty of companies make a denim jacket, but no on does it quite like Levi's. The denim, or jean jacket dates back to the late 1800s. It was originally created for farmers and gold prospectors with seams that could be easily let out and moved if the wearer needed a looser fit. When you picture a denim jacket, you probably see this one fromLevi's, which is their classicTrucker Jacket.", "The metal buttons and v-shaped seams make it unmistakable. Suitable for a spring day with a light breeze, a summer evening, or a fall evening with layers, the denim jacket has a rugged casualness that looks laid back but intentional.", "We feature it regularly in our outfit inspiration due to its versatility amongsmart casual.", "It's important to note that while the denim trucker jacket is the most ubiquitous, there are other types of jackets that can be made of denim, most commonly a chore coat:", "Read more about denim jackets:What’s The Difference Between A Trucker Jacket And A Denim Jacket?", "How to wear:", "Thetrucker jacket has an intriguing history, from protecting cowboys from storms to keepingRobert Redford looking like a stud. The trucker jacket is a specific design of jacket that can be made of various materials, which features a waist-length cut, tall collar, and generally one or two chest pockets.", "Cinching button flaps on the back waist that narrow the opening are also standard.", "The most common trucker jacket you'll see is the Levi's denim one that we've featured above, but for a little added comfort and weather resistance, we like a trucker made from waxed sailcloth likethis onefrom Flint and Tinder. The fabric comes from New Jersey, and the jacket is crafted in Los Angeles with a soft flannel lining to keep you warm.", "Flint and Tinder (which started as an American-made underwear company) even takes the extra time to wax the fabric on both sides for extra resilience. Creases and scuffs will help this jacket age with character and a 60-day return policy gives you the time to make sure it's the right fit and style for you.", "Read more and see early designs of the trucker jacket:The Fascinating Evolution of the Trucker Jacket", "Outfits featuring trucker jackets:", "Back in October, we started getting our house ready to sell. There was a myriad of jobs to do, and the weather was just starting to turn chilly. One crisp Saturday morning I threw on my chore coat with a t-shirt and a sweatshirt underneath and set aside two hours to pressure wash the front of the house. But you know how it goes when you get pressure washin'. Next thing I know I'm doing the back porch, and then I started eyeing up the deck. Five hours and two meals later, I'd ditched the sweatshirt, but I was still rockin' the chore coat over my t-shirt.", "It's for a walk in the woods or a casualweekend away. Made from cotton canvas, wool, or denim, thechore coathas a roomy cut for layers and a rugged construction that dares you to do some real work. Go get dirty.", "A few chore coats worth checking out:The 11 Best Chore Coats", "How to wear a chore coat:", "When abutton-up shirtisn't enough, the shirt jacket steps in for that added layer of warmth. It is known by various names depending on what region you're from including shirt jacket, shirt jac, CPO jacket, or shacket.", "The advantage of the shirt jacket is how well it allows you to move (since really, it's just like wearing another shirt). You get the warmth of a light jacket without the added bulk, kind of like an alternative to ashawl collar cardiganor hoodie.", "This affordable one from Amazon comes in 12 colors and patterns and is made from polyester to give you the fleece feel with the shirt fit.Style it with a dark shirt, denim, and your favorite pair of bootsfor a hale fall look.", "How to wear a shirt jacket:", "I'm a prep. Freshly shined penny loafers with a pair of Nantucket reds and a bow tie, and I feel right at home (maybe a copy of Gatsby in my back pocket in case I get bored). On a sunny day, you'll see me rockin' my basket-weavenavy blazer, but if there's a chill in the air, I get out the Harrington.", "Like a Mini Cooper with a hemi, theHarringtonis a total sleeper in terms of versatility. Also known as a blouson jacket, wear a Harrington with chinos and a button down; wear it with jeans and yourbrown leather sneakers. Hell, throw it onwith a pair of shortson a cool summer evening. Keep in mind that just because the originalG9 jacket from English brand Baracutahas become a cult classic since its inception in the 1930s, you don'thaveto spend $400. This one from Uniqlo was $30 and looks swell.", "See the long history of the Harrington:The Harrington Jacket – How to Wear It, History, & Affordable Picks", "Harrington jacket outfits:", "It was fifty-five degrees in my part of Pennsylvania today, and my wife and I had some errands to run (My mom watched the kids, so we called it a date). I threw on jeans, suede chukkas, a sweatshirt, and my leather jacket, and I felt smooth. The leather jacket is the ultimate feather in the cap ofsmart casual: It's intentional without being presumptuous.", "Leather jackets can come in lots of different styles, from the classic racer style to bombers, blazers, and everything in between. The most famous style is probably the double rider: The classic leather jacket with big collars and asymmetrical zipper, shown in its own section below.", "The first commercially available leather jacket was released in the early 1900s for motorcyclists; if you fell, the leather would take the brunt of the road rash instead of your own skin (it took a while to figure out that helmets were a good idea too).", "Marlon Brando and James Dean wore leather jackets inThe Wild OneandRebel Without a Causerespectively, and suddenly it was the sartorial staple of the 1950s. Perfect for fall days or days like today when spring is doing its best to make an entrance. A jacket made from great leather will outlast you: Primer editor and founder Andrew Snavely has a1940s horsehide motorcycle cop jacket.", "How to wear a leather jacket:", "If you're feelin', as my grandfather would say, as bad as you gotta be, you might want to pick up a biker jacket. Biker jackets feature a trim cut (so they're not great for layering), a short torso (so you can easily lean over the side of your bike without having a button dig into your pelvis), and ample hardware for ruggedness. While the double rider biker jacket lends itself to a more casual look, it actually complements ashirt and tie quite well. Pairing your work wear with a little bit of renegade is always a cool move.", "When I hear polyester, my mind goes toSaturday Night Fever, but the polyester of today is not the polyester of the 1970s when your dad wore platform shoes and shirts with collars points down to his armpits. Today's polyester fleece is lightweight, soft, and breathable, allowing you to stay warm and (relatively) dry without breaking a sweat.", "It won't shrink when you dry it, and because it's a synthetic fabric, it keeps its shape. The best part? You don't need to drop $100 to get a more-than decent fleece jacket. This fleece from Amazon comes in 26 styles and hits a price point that won't make you cringe.", "The pea coat is one of the few coats that has seen very little change since its inception. Why? Because it's hard to update perfect. Like quite a few men's coats, the pea coat finds its roots in the military,originally crafted in the 1700s for Dutch sailorsfrom rough, thick wool. The term “pea” is thought to come from the Dutch word “pij” or “pije” (depending on the source), which described the wool.", "The British navy popularized the style, and we're still wearing them today. The modern pea coat is slightly more fitted than the original, but the oversized collar, hem just below the waist, and double-breasted button closure remain. And because a classic never dies, plenty of companies have their own take on thepea coat, meaning you can choose the one that fits your personal taste and your budget.", "Get a good one:These Are The 23 Best Men's Pea Coats, Car Coats, Walker Coats, and Overcoats", "How to wear a pea coat:", "The shearling jacket hits that sweet spot when it's too cool for a trucker but too warm for a pea coat. If you go for genuine shearling, which comes from sheep, you'll spend a few hundred at least (and that's if you catch a deal).", "Luckily faux-fur shearling (which is essentially hi-pile, textured fleece and labeled as “sherpa”) retains warmth nearly as well as the real thing. It's also easier to maintain (because you can wash it), and it won't mat down as easily as genuine shearling. A sherpa trucker like this one is soft and easy to wear like a heavy sweatshirt.", "The Mackintosh, or Mac…or rain coat actually dates back to the 1800s. Charles Mackintosh, a chemist, devised a way to insert a layer of liquid rubber between an interior and exterior layer of fabric. And the Mac was born. Traditionally a Mac was cut for wear over a suit, but the modern Mac is slightly tailored. You can certainly layer it over a suit or a thicksweater, but you don't have to.", "Trench coats became iconic after service by British officers in World War I, but their story starts almost a century earlier, as a response to the popularity of the Mackintosh coat. Traditionally trench coats are below the knee, double breasted and feature wide lapels, and a waist belt, though you can find coats labeled as trench coats that feature other styles.", "The puffer jacket is your quintessential winter jacket. It's lightweight, it's warm, and it has just enough moisture resistance to get you through a snow shower.", "There's nothing wrong with an extra puffy puffer jacket, but anymore, insulation technology has allowed for more svelte options likethis onefrom L.L. Bean with down that's been treated to allow it to stay dry even when wet.", "Also known as a gilet, the vest is one type of outerwear men sleep on the most. It's the perfect layer for those frustrating-to-dress-for days where a thicker coat would be too hot after a certain point. The torso-covering vest keeps heat in while not insulating the arms, a way of regulating body temperature while also looking damn cool.", "Check outPrimer's guide to this turtleneck and vest combowhich will have you looking as sharp as style contributor Daniel Baraka and not an old guy on the ski lift.", "The history of the coach's jacket is in the name. In the 90s, this lightweight windbreaker-style jacket (complete with snap button closure) was worn by NFL coaches all over the country (with a big ol' team logo on the back). It moves easily; it resists moisture in case it starts to drizzle, and snap buttons mean it goes on and off easily so the coach can stay comfortable without missing a play.", "Thismay be the best damn looking jacket on the entire list, and I'm not just saying that because Daniel Craig wears it inNo Time to Die.Ok…that might have something to do with it. Thewaxed canvas jacketis the one you throw on in fall or winter over top of a sweater, or for the spring camping weekend when it's going to be cool at night, but you'll be sitting by the fire.", "Over time, the canvas will crease, darken, absorb dirt and oil from your hands, and it'll keep looking good. In a few years, throw a fresh coat ofOtter Waxon it, and you're back to factory specs for moisture resistance.", "Read more about waxed canvas jackets:The 9 Best Waxed Canvas Jackets: History, Style, and Affordable Picks", "How to wear a waxed canvas jacket:", "As a card-carrying prep,the navy blazeris my go-to jacket for every season and almost any occasion. It is the essence of versatility in that it looks good on any man regardless of body type, and shy of black-tie-only, it's appropriate for most occasions. A night out with your partner? Throw on the navy blazer with yourfavorite denimand abutton-down. A day at the office? Navy blazer and chinos (Think Andy Bernard. Did you know he went to Cornell?) Office with a morecasual dress code? Navy blazer with denim, a shirt, and tie.", "You only need one navy blazer, and if you can afford it, I recommend picking up one made of wool. It breathes; it seldom needs cleaning, and thedrapeis always flattering. If that's a little too steep, a wool blend or cotton will do just fine.", "Navy blazer outfits:", "Yes, the Mac is handsome, but you're probably not going to wear it to your daughter's soccer game on a rainy Saturday morning. This is where the traditional rain coat comes into play.", "If you're like me, you're thinking that all that waterproofing doesn't allow for a lot of air movement. But this jacket has a trick up it's sleeve: zippered vents with lightweight mesh to keep moisture out while allowing for air flow.", "The word anorak comes from the native Greenalndic languageannoraaq. Similar to a parka (itself having native Russian etymology), an anorak is a hooded, pullover hip-length jacket usually made of nylon to provide wind and water protection. They've regained fashion popularity in the last two decades or so and often come in bright solid colors or a mix of bright colors. Due to their pull-over style, nylon construction, and zipper pouch, anoraks arecasual wearjackets, often chosen for weather utility.", "In the back of my SUV, I have a fleece blanket, amultitool, and a packable jacket. Why? Because dammit you just never know. And let's be honest: the packable jacket is just cool. Here's a piece of clothing that will keep you warmandneatly pack into itself for easy storage – there's something profound in its simplicity. This one fromAmazonis made from nylon (which will cut the wind and resist moisture) with polyester filling for added insulation. And at $45 with 11 color options, it's a no-brainer.", "When the elements are kicking your ass, you reach for the parka. Originally made from seal skin by the Caribou Inuits, the parka is a garment designed for true cold weather activity and is one of the best types of jackets to stay warm in the winter. The body is cut below the waist, the interior is insulated (usually with down or a down alternative), and pockets have storm flaps and buttons (or velcro). This one from Patagonia is made with recycled 600-fill down, stretch canvas, and a hood that will cover your head and neck. Winter's got nothin' on you.", "The best part about a suede jacket is that every guy canmake it work. The suede racer compliments any body shape and looks as good at the bar as it does at the office. Suede gives you the durability of leather, but it breathes better and has a soft hand.", "The first jacket I ever bought from The North Face was anApex. I was 22, fresh out of school, and the Apex was my graduation gift to myself. That was 13 years ago, and it's still hanging in my closet. A tech jacket (named for the tech fabric from which it's made) is the Swiss Army knife of jackets: it's warm, it cuts the wind, and it's waterproof (the Apex uses a proprietary fabric with a polyurethane coating, which allows the fabric to breathe while keeping moisture out).", "If there's rain in the forecast, and you're going for a hike or traversing the city, the tech jacket won't let you down.", "The name says it all: the fishtail parka is cut long in the body with a short vent at the bottom of the back, which kind of looks like a…well…you get it.This onefrom Alpha Industries is made from a cotton/poly blend for high breathability while still keeping you dry. The front placket adds a layer of moisture resistance while the drawstrings let you decide how tapered you want the fit.", "In the springtime, my default weekend outfit is jeans and asolid t-shirt. A simple way to enhance this look is by adding a little texture, and this is what a quilted jacket does best. The quilted jacket has a way of looking fancy yet casual; call it, “laid-back-equestrian.”", "The quilted jacket is ideal for layering, so throw it over a sweatshirt to cut the wind and lock in a little extra body heat. This one from Ralph Lauren is handsomely classic.", "How to wear it:There’s No Shame in Being a Jeans & T-Shirt Guy: Here’s How to Do It Intentionally", "Unfortunately they didn't give out varsity jackets if you were the lead in the musical (not that I'm bitter), but I prefer the kind without letters on them anyway. The varsity jacket traditionally has a wool body with leather sleeves, an American cut (which is to say a bit boxy), and a team's logo on it. These days the varsity jacket has a slightly trimmer cut, and most are made from blends of fleece or cotton. But if you want the real thing, check outthis onefrom Champion.", "I have a problem with overcoats because they look so damn good over a suit or a navy blazer. So I have four of them. The overcoat is cut long in the body with a little extra room in the chest and sleeves to go over your suit for work.", "Perhaps more than any other coat on the list, overcoats come in at every price point you can imagine from low-cost options to exorbitantly expensive that costs more than my first car. Camel, navy, or black are the most traditional choices, but don't be afraid togo off the beaten pathwith a pattern.", "Read more:These Are The 23 Best Men's Pea Coats, Car Coats, Walker Coats, and Overcoats", "How to wear an overcoat:", "Mike Henson is a literature teacher in Hershey, Pennsylvania. He enjoys shooting 35mm film, restoring vintage straight blades, purchasing too many American-made goods, and spending time with his wife and their three daughters.", ""], "word_count": 4117, "content_type": "general", "normalized_url": "https://www.primermagazine.com/2025/spend/types-of-jackets", "site_name": "Primer Magazine", "site_domain": "primermagazine.com"}
{"url": "https://www.primermagazine.com/2025/spend/fall-getup-week-casual-modern-layers-in-city-weight", "title": "Fall Getup Week: Casual Modern Layers in City Weight", "author": null, "publish_date": null, "text": "ByAndrew Snavely Two jackets sounds like too much until you wear them. Too heavy with one thick one and somehow always the wrong one on top. The denim came first, the familiar one that fits right in the shoulders and does most of the work. The quilted jacket showed up later, lighter, less opinionated, but better at blocking wind. It’s the kind of combination you stumble into once and keep repeating,  Half field liner, half insurance policy. The color says “forest trail,” the fit says “espresso line.” Eddie Bauer/Amazon  Still the anchor piece, thirty years later. The collar still stands up, the indigo still works with everything. One of my11 Budget Items I’ve Had for More Than 5 Years.It works surprisingly well as a middle layer, and looks great with the thermal and pants. Levi's on Amazon  Soft enough to skip the shirt. The ribbed texture breaks up the darker layers. The kind of thing that ends up in every laundry load because it’s always in rotation, as a layer or on its own. I've had the Buck Mason one for years and reach for it every time the temperatures change. Buck Mason/Amazon Essentials  No brand, no pom. Not extra saggy. Just color-matching warmth that fits in a pocket when you’re inside. Amazon  Classic fit, hidden modernity. Looks like denim, behaves like gear. Stretch moves with you, pockets where you expect them, no swishing. Dockers  Feels like a retro runner but with a modern pace. The profile hits that 90s line between athletic and everyday: grounded enough for denim, sharp enough to not look like you're in from the gym. Built for long days on pavement, not display. Amazon/Nike You can also easily swap in boots for a slightly more refined evening style: Similar boots:Palladium/AllSaints Subscribe to our free newsletter and don't miss an outfit.   Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine.", "paragraphs": ["ByAndrew Snavely", "Two jackets sounds like too much until you wear them. Too heavy with one thick one and somehow always the wrong one on top. The denim came first, the familiar one that fits right in the shoulders and does most of the work. The quilted jacket showed up later, lighter, less opinionated, but better at blocking wind.", "It’s the kind of combination you stumble into once and keep repeating,", "", "Half field liner, half insurance policy. The color says “forest trail,” the fit says “espresso line.”", "Eddie Bauer/Amazon", "", "Still the anchor piece, thirty years later. The collar still stands up, the indigo still works with everything. One of my11 Budget Items I’ve Had for More Than 5 Years.It works surprisingly well as a middle layer, and looks great with the thermal and pants.", "Levi's on Amazon", "", "Soft enough to skip the shirt. The ribbed texture breaks up the darker layers. The kind of thing that ends up in every laundry load because it’s always in rotation, as a layer or on its own. I've had the Buck Mason one for years and reach for it every time the temperatures change.", "Buck Mason/Amazon Essentials", "", "No brand, no pom. Not extra saggy. Just color-matching warmth that fits in a pocket when you’re inside.", "Amazon", "", "Classic fit, hidden modernity. Looks like denim, behaves like gear. Stretch moves with you, pockets where you expect them, no swishing.", "Dockers", "", "Feels like a retro runner but with a modern pace. The profile hits that 90s line between athletic and everyday: grounded enough for denim, sharp enough to not look like you're in from the gym. Built for long days on pavement, not display.", "Amazon/Nike", "You can also easily swap in boots for a slightly more refined evening style:", "Similar boots:Palladium/AllSaints", "Subscribe to our free newsletter and don't miss an outfit.", "", "", "Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine."], "word_count": 387, "content_type": "general", "normalized_url": "https://www.primermagazine.com/2025/spend/fall-getup-week-casual-modern-layers-in-city-weight", "site_name": "Primer Magazine", "site_domain": "primermagazine.com"}
{"url": "https://www.primermagazine.com/2018/spend/my-5-favorite-pairs-of-jeans-right-now", "title": "My 5 Favorite Pairs of Jeans Right Now", "author": null, "publish_date": null, "text": "By Andrew Snavely, Editor & Founder For being such a staple, finding the best jeans can be downright frustrating. For you, maybe that’s because you fall in-between straight, slim, or skinny fits, which are not standardized across brands. Or maybe it’s because even though men’s jeans are sized in inch-based dimensions such as 34×32, these days a pair’s actual measurements can be way off from the stated size on the label. This ‘vanity sizing’ makes it virtually impossible to know what size you are across brands. I try on a lot of jeans. Budget jeans. Designer jeans. Skinny jeans. Straight leg jeans. And from the huge variance I see, I definitely understand why you’re frustrated. That’s why I’ve put together this list of my favorite pairs that I’m wearing right now – what I like about them and when I wear them. If you’re in a place where you’re trying to up your style game, any of these would be a solid place to start. The trend right now is to have a fittedsilhouettethat narrows with a taper. You’ll notice I didn’t use the words slim or skinny or other denim verbiage. That’s because men of different shapes will need a denim fit that complements their bodies to achieve a fitted silhouette that narrows with a taper. For a very thin tall guy, that may mean a pair of skinny jeans best accomplishes that. For a shorter guy with dimension, an athletic fit or other looser but tapered style may be the answer. And all of that means buying jeans online can be a pain. So for each, I’ve included the size on the label, and then the actual measurements for the waist, inseam,rise, mid thigh, and leg opening to give you a better guide on what will work best for you. Something to consider:Every pair of jeans you own doesn't have to fit the same way. I have slimmer fits and I have looser fits, and where and when I wear these depends on the style I'm going for. And especially if you're a guy who lives in denim, you can give yourself a ton more options with different fits. For example, with a single-fit mentality, you may require all of your jeans to be able to work with your chunky Red Wings. But that looser, wider leg will likely prohibit you from dressing those jeans up with a pair of brogues and a blazer. Similarly, a pair of skinnier jeans that look great with minimalist sneakers may not be full enough to wear with a blazer because of the top-heavysilhouettethat is created. GapSelvedge Jeans in Slim Gap Flex, $108/Red Wing Iron Ranger Boot, $350/Gap Raglan Tee, $18 I originally picked these up on Black Friday, they're my first pair of non-blue selvedge denim. I really love this pair – they look sharp with a black Getup for heading to some trendy event and look right at home with a morerugged Americana style with a pair of Red Wings. Read ourultimate guide for styling black jeans with brown boots. On a pair of blue selvedge jeans, the cuff is lighter, but on black selvedge the cuff is still black so you just get those two little white stripes, a trademark of quality selvedge denim – which adds a nice little detail to the outfit. Like any garment made of fitted denim, they were about 5% too snug when I got them, though the waist and inseam were correct. A few hours of wear allows them to stretch and contour to your shape, the result is a comfortable, perfectly fitting pair of slim jeans. Buy Now Labeled Size:29×30 Actual Measurements: Waist:31″ Inseam:30.75″ Rise:10″ Mid Thigh:8.5″ Leg Opening:7″ DSTLD American-madeSlim 12.75oz Raw Denim Jeans in 24 Dip Indigo Timber, $75/Adidas Stan Smith, $100/Gap Raglan Tee, $18 This is actually my second pair of these jeans, but not because the first pair wore out. I bought the first pair a few years ago, and still wear them – I bought the new pair to ensure the dimensions hadn't changed. If you're new to DSTLD, they're a Los Angeles-based brand that's been around for a number of years. They focus on premium denim and essentials like tees andjacketsand sell on a direct-to-consumer model cutting out the middle-man and cutting down on the price. Some of their pieces are even made in Los Angeles, like these slim raw jeans. Slim in all the right ways without being ‘skinny,' these will wear in beautifully and look great with boots, brogues, or sneakers. With free shipping and free returns and a fit guarantee, it makes buying jeans online pain-free. See one way to style themin this Live Action Getup. Buy Now Labeled Size:29×30 Actual Measurements: Waist:29.5″ Inseam:29.25″ Rise:9.5″ Mid Thigh:9″ Leg Opening:7″ Levi's512 Slim Taper, $59.99/Wolverine 1000 Mile Boots, $365/Gap Raglan Tee, $18 This is my new preferred fit from Levi's. You're likely familiar with the 511 slim straight, these are the same but with a tapered leg opening. These are the snuggest of the 5 jeans on the list, and I like wearing them when heading out somewhere in the evening. I'm a big fan of gray jeans of any shade, and these in “Noise Addict” charcoal can work both as a put-together-gray, or as a rugged-badass-faded-black. As long as Gap's denim isn't on sale, at $49, the Levi's 512 on Amazon are the cheapest of the 5 – and with 2 day shipping andfree returns, picking up a pair to try is a no-brainer. See one way to wear them inmy Joshua Tree Live Action Getup. Buy Now Labeled Size:30×30 Actual Measurements: Waist:30″ Inseam:28.75″ Rise:10″ Mid Thigh:9″ Leg Opening:6″ GapAthletic Fit with Gap Flex in Resin Rinse, $62/Red Wing Moc Toe, $345/Gap Raglan Tee, $18 For those gents with wider thighs, I'm about to make your denim shopping much less frustrating. In the last couple of years brands across the price spectrum have started introducing “Athletic Fits” which offer a slim, tapered silhouette with more room in the thighs and knees. Easily the loosest fit on the list and a saving grace for #menwhosquat but don't let the branding fool you, if you're a huskier guy Athletic Fit may also provide you with the breathing room you want without having to succumb to straight or relaxed fits. I have two pairs of Athletic Fit jeans from Gap and dig them. I find Gap's slim to be just a smidge too wide for me these days, and the Athletic Fit offers a nice compromise when I want a pair of slim jeans that still fit over a pair of chunky boots or when I know I'm going to have a long day and want to ensure comfort. Buy Now Labeled Size:29×30 Actual Measurements: Waist:30.5″ Inseam:29″ Rise:10.25″ Mid Thigh:9.5″ Leg Opening:7″ Flint & Tinder American-madeSlim Stretch Selvedge Denim, $118/Thursday Boots Captain in Olive Suede, $199/Gap Raglan Tee, $18 These American-made jeans are quality all around. A fantastic modern fit and construction, and made of the famed (but now closed 😣)Cone Denim White Oakselvedge. I've had selvedge jeans in the past, but these were my first pair that are truly slim. Their slim, tapered shape allows them to easily be dressed up with oxfords or boots, making them a smart style investment for their near universal versatility. Get them while you can, if sizes are dwindling, also check outFlint & Tinder's slim in dark indigo. Buy Now While some sizes are still available for the slim stretch selvage denim, the Flint & Tinder denim line has since been updated withDefender Denim Slim Fit, $138andJapanese Stretch Selvage Straight, $118. Labeled Size:29 (32 standard inseam) Actual Measurements: Waist:29″ Inseam:29.75″ tailored Rise:9.5″ Mid Thigh:9.5″ Leg Opening:6.5″  Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine.", "paragraphs": ["By Andrew Snavely, Editor & Founder", "For being such a staple, finding the best jeans can be downright frustrating. For you, maybe that’s because you fall in-between straight, slim, or skinny fits, which are not standardized across brands. Or maybe it’s because even though men’s jeans are sized in inch-based dimensions such as 34×32, these days a pair’s actual measurements can be way off from the stated size on the label. This ‘vanity sizing’ makes it virtually impossible to know what size you are across brands.", "I try on a lot of jeans. Budget jeans. Designer jeans. Skinny jeans. Straight leg jeans. And from the huge variance I see, I definitely understand why you’re frustrated. That’s why I’ve put together this list of my favorite pairs that I’m wearing right now – what I like about them and when I wear them.", "If you’re in a place where you’re trying to up your style game, any of these would be a solid place to start. The trend right now is to have a fittedsilhouettethat narrows with a taper. You’ll notice I didn’t use the words slim or skinny or other denim verbiage. That’s because men of different shapes will need a denim fit that complements their bodies to achieve a fitted silhouette that narrows with a taper. For a very thin tall guy, that may mean a pair of skinny jeans best accomplishes that. For a shorter guy with dimension, an athletic fit or other looser but tapered style may be the answer.", "And all of that means buying jeans online can be a pain. So for each, I’ve included the size on the label, and then the actual measurements for the waist, inseam,rise, mid thigh, and leg opening to give you a better guide on what will work best for you.", "Something to consider:Every pair of jeans you own doesn't have to fit the same way. I have slimmer fits and I have looser fits, and where and when I wear these depends on the style I'm going for. And especially if you're a guy who lives in denim, you can give yourself a ton more options with different fits. For example, with a single-fit mentality, you may require all of your jeans to be able to work with your chunky Red Wings. But that looser, wider leg will likely prohibit you from dressing those jeans up with a pair of brogues and a blazer. Similarly, a pair of skinnier jeans that look great with minimalist sneakers may not be full enough to wear with a blazer because of the top-heavysilhouettethat is created.", "GapSelvedge Jeans in Slim Gap Flex, $108/Red Wing Iron Ranger Boot, $350/Gap Raglan Tee, $18", "I originally picked these up on Black Friday, they're my first pair of non-blue selvedge denim. I really love this pair – they look sharp with a black Getup for heading to some trendy event and look right at home with a morerugged Americana style with a pair of Red Wings. Read ourultimate guide for styling black jeans with brown boots. On a pair of blue selvedge jeans, the cuff is lighter, but on black selvedge the cuff is still black so you just get those two little white stripes, a trademark of quality selvedge denim – which adds a nice little detail to the outfit.", "Like any garment made of fitted denim, they were about 5% too snug when I got them, though the waist and inseam were correct. A few hours of wear allows them to stretch and contour to your shape, the result is a comfortable, perfectly fitting pair of slim jeans.", "Buy Now", "Labeled Size:29×30", "Actual Measurements:", "Waist:31″", "Inseam:30.75″", "Rise:10″", "Mid Thigh:8.5″", "Leg Opening:7″", "DSTLD American-madeSlim 12.75oz Raw Denim Jeans in 24 Dip Indigo Timber, $75/Adidas Stan Smith, $100/Gap Raglan Tee, $18", "This is actually my second pair of these jeans, but not because the first pair wore out. I bought the first pair a few years ago, and still wear them – I bought the new pair to ensure the dimensions hadn't changed.", "If you're new to DSTLD, they're a Los Angeles-based brand that's been around for a number of years. They focus on premium denim and essentials like tees andjacketsand sell on a direct-to-consumer model cutting out the middle-man and cutting down on the price.", "Some of their pieces are even made in Los Angeles, like these slim raw jeans. Slim in all the right ways without being ‘skinny,' these will wear in beautifully and look great with boots, brogues, or sneakers. With free shipping and free returns and a fit guarantee, it makes buying jeans online pain-free. See one way to style themin this Live Action Getup.", "Buy Now", "Labeled Size:29×30", "Actual Measurements:", "Waist:29.5″", "Inseam:29.25″", "Rise:9.5″", "Mid Thigh:9″", "Leg Opening:7″", "Levi's512 Slim Taper, $59.99/Wolverine 1000 Mile Boots, $365/Gap Raglan Tee, $18", "This is my new preferred fit from Levi's. You're likely familiar with the 511 slim straight, these are the same but with a tapered leg opening. These are the snuggest of the 5 jeans on the list, and I like wearing them when heading out somewhere in the evening. I'm a big fan of gray jeans of any shade, and these in “Noise Addict” charcoal can work both as a put-together-gray, or as a rugged-badass-faded-black.", "As long as Gap's denim isn't on sale, at $49, the Levi's 512 on Amazon are the cheapest of the 5 – and with 2 day shipping andfree returns, picking up a pair to try is a no-brainer. See one way to wear them inmy Joshua Tree Live Action Getup.", "Buy Now", "Labeled Size:30×30", "Actual Measurements:", "Waist:30″", "Inseam:28.75″", "Rise:10″", "Mid Thigh:9″", "Leg Opening:6″", "GapAthletic Fit with Gap Flex in Resin Rinse, $62/Red Wing Moc Toe, $345/Gap Raglan Tee, $18", "For those gents with wider thighs, I'm about to make your denim shopping much less frustrating. In the last couple of years brands across the price spectrum have started introducing “Athletic Fits” which offer a slim, tapered silhouette with more room in the thighs and knees. Easily the loosest fit on the list and a saving grace for #menwhosquat but don't let the branding fool you, if you're a huskier guy Athletic Fit may also provide you with the breathing room you want without having to succumb to straight or relaxed fits.", "I have two pairs of Athletic Fit jeans from Gap and dig them. I find Gap's slim to be just a smidge too wide for me these days, and the Athletic Fit offers a nice compromise when I want a pair of slim jeans that still fit over a pair of chunky boots or when I know I'm going to have a long day and want to ensure comfort.", "Buy Now", "Labeled Size:29×30", "Actual Measurements:", "Waist:30.5″", "Inseam:29″", "Rise:10.25″", "Mid Thigh:9.5″", "Leg Opening:7″", "Flint & Tinder American-madeSlim Stretch Selvedge Denim, $118/Thursday Boots Captain in Olive Suede, $199/Gap Raglan Tee, $18", "These American-made jeans are quality all around. A fantastic modern fit and construction, and made of the famed (but now closed 😣)Cone Denim White Oakselvedge. I've had selvedge jeans in the past, but these were my first pair that are truly slim. Their slim, tapered shape allows them to easily be dressed up with oxfords or boots, making them a smart style investment for their near universal versatility.", "Get them while you can, if sizes are dwindling, also check outFlint & Tinder's slim in dark indigo.", "Buy Now", "While some sizes are still available for the slim stretch selvage denim, the Flint & Tinder denim line has since been updated withDefender Denim Slim Fit, $138andJapanese Stretch Selvage Straight, $118.", "Labeled Size:29 (32 standard inseam)", "Actual Measurements:", "Waist:29″", "Inseam:29.75″ tailored", "Rise:9.5″", "Mid Thigh:9.5″", "Leg Opening:6.5″", "", "Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine."], "word_count": 1368, "content_type": "general", "normalized_url": "https://www.primermagazine.com/2018/spend/my-5-favorite-pairs-of-jeans-right-now", "site_name": "Primer Magazine", "site_domain": "primermagazine.com"}
{"url": "https://www.primermagazine.com/2025/learn/mens-cologne-fragrance-explained", "title": "The Real Reason You’ve Never Found a Cologne You Love", "author": null, "publish_date": null, "text": "Most men know how to buy pants. Some even know how to choose whiskey, which for some reasonfeels easier. Yet when it comes to scent, they either ignore it completely or approach it like someone trying to guess a password: hurried, vaguely ashamed, and absolutely incorrect. Smell is part ofyour personal stylewhether you’ve chosen it or not. The scent of fresh laundry, the lingering effect of your morning coffee on your breath, and the remnants of last night’s backyard-grilled-ribeye all accompany you. With intention, fragrance becomes something else entirely. Like polished shoes or standing up straight, it doesn't garner applause, but it’s noticeable when missing. Men call it simply “cologne.” That word covers a lot, and most of it isn’t helpful, and partially inaccurate. Scent is expansive. And when used properly, it refines everything else regarding your presence, like holding eye contact forjustthe right amount of time. (Or, Why Your Nose Should Never Tingle) Fragrance is a cocktail of aromatic compounds, alcohol, and occasionally water. The “concentrate,” if left undiluted, would sear your nostrils and possibly melt your furniture. That’s why perfumers blend in alcohol: so you can wear a scent without losing friends, your security deposit, or your sense of smell. Concentration is the secret lever behind strength, longevity, and price. Some ingredients, like oudh or iris butter, are so costly they might as well come with a credit check. Citrus oils sit at the other end. A skilled perfumer knows how to balance rare naturals with crisp synthetics, so the final product doesn’t remind anyone of chemistry class or accidentally cleaning the counter with lemon floor cleaner. Projectionis what people notice when you stand still: how far your scent radiates before anyone even sees your tie.Sillage(rhymes with “massage”) is the wake you leave behind as you move, the subtle whiff as you walk by in the hallway. Neither should crash a dinner party or get you a warning at the office. As practical matters go, the ratio of concentrate to alcohol is more than just a number on the label. It decides how boldly your scent steps out into the world and how long it hangs around after you’ve left. This is where projection and sillage show up. Higher concentration means richer scent, more hours on skin, and usually a little more “hello” when you walk in. Lower concentration leans fresher and lighter, fading sooner, rarely announcing itself past arm’s length. Get the concentration right and your scent will work for you exactly as your clothes: contributing to the overall experience but not distracting. You want someone to tell you that you smell nice in the same way you'd want someone complimenting a piece of your outfit: because it's noticeable and refined, not unavoidable. Fragrance, when done right, requires restraint. Projection, sillage, and longevity are adjustable settings, not a moral stance. The goal isn’t to dominate the room. The goal is to be smelled without being… discussed. No one wants to hear, “Someone’s wearing cologne,” in that flat office voice that means they’re not really curious, just annoyed. A quick note before the breakdown: Concentration doesn’t necessarily equal quality. It simply refers to how much fragrance oil is in the mix compared to alcohol or water. Higher concentration means stronger presence and longer wear, not necessarily “better.” Many men’s fragrances are only offered as an Eau de Toilette or Eau de Parfum, and that doesn’t make them less refined. It's a bit like confusing a whiskey with the highest ethanol content as “the best”. Concentration is not just about strength. Because different notes evaporate at different speeds, the concentration changes how a fragrance actually smells on your skin. A woody amber in parfum may feel dense and resinous, while the eau de toilette version of the same scent might highlight the citrus opening and read fresher. If you find a scent you like wears off quickly, moving up to a higher concentration may be the answer. It's also possible a scent you like is so strong it becomes annoying to keep smelling on yourself after an hour. With that in mind, here’s how each concentration typically behaves in practice: The most concentrated, longest-lasting option. It clings to skin for 12 to 24 hours, sometimes more. Wear it carefully. It suits men who enjoy depth and richness. It is the most expensive concentration and not all men's fragrances are offered as parfum.  Experiment with using less than you're used to. Half a spritz to start. Usually lasts 5 to 8 hours. This is where many modern fragrances sit because it offers a balance: enough depth to be interesting without becoming overwhelming. When people talk about a fragrance with character, they’re often describing an EDP. Also half a spritz to start until you dial it in with how it works on your body. It typically lasts about 3 to 5 hours, which makes it lighter and easier to wear in everyday life. This is where most men’s fragrances live, from long-established classics like Acqua di Gio and Drakkar Noir to modern staples such as Dior Sauvage. EDTs are the most common format not because they’re “lesser” but because they present enough to be noticed in close company, subtle enough to reapply without overwhelming anyone. For many men, especially those buying one bottle they expect to use regularly, EDT is the natural fit. Bright, quick, and often citrus-forward, with a lifespan of about two hours. Useful for a refresh, but rarely the one fragrance a man keeps on his shelf. Historically important, but today often more of a side character. Men rush into full bottles the way I rush into buying groceries when hungry, with appetite and regret. Sampling changes the odds. There are discovery sets (pre-curated sample collections that come with a coupon for a full bottle), “decant” services that split bottles into five to ten milliliter vials, and boutiques that will happily spray until you look dazed. Pro tip from a guy who once panic-bought a celebrity scent at a duty free: start with a sample, wear it through a normal day, and only commit if it keeps behaving politely. The best way to try a scent is to head to a store and use their paper testers first. Then, when you find one you like, spray a small amount directly on your skin, such as your neck or wrists. Notice how you feel about it over the next few hours. Does it evolve in a way you like? Can you still smell it after an hour? If you must buy sight unseen, buy small. (Or, Why Smaller Is Smarter) Fragrance comes in a handful of standard sizes: Like most things, larger bottles almost always have a lower cost per milliliter, and brands want you to notice. It’s designed to make the smaller bottle feel like a ripoff. Here’s the catch: that savings only matters if youactually finish the bottlebefore you get bored or the scent loses its punch. Most men don’t. The big bottle gets sidelined for something new, sits half-used, and eventually fades in strength, along with your supposed “savings.” The value bias tricks you into buying more than you should which ≠ a good value. I’ve yet to regret a 50 ml bottle, even with a higher per ml price. I actually find the prices for this size to feel more appropriate for what I want to pay for smelly water than the larger sizes anyhow. Running out is a decision point, not a waste. Better to buy what you’ll finish than to let a bigger bottle become background clutter. →Fragrance for the home:7 Budget Scents to Upgrade Your Space and Routine That Smell Premium Without Breaking the Bank (Or, Fragrance is Like Lasagna or Criticism: Layers Matter) The final phase is known as thedrydown. It's how the whole thing settles after the top and heart notes fade. It's the story you end up with, representing the true character of the fragrance. Everyone’s skin tells it a little differently. (Or, “I thought Aqua DiGiorno sounded wrong”) Luxury makes counterfeiters busy. Quick checks matter: buy from authorized retailers, notice prices that feel too generous, and when in doubt buy directly from the brand. Counterfeits can smell off or irritate skin, so the small extra cost for authenticity is not vanity, it is sanity. For travel, smallatomizerdecants are indispensable, they fita dopp kitand reduce anxiety about losing a favorite bottle. When bottles sit half empty, oxidation accelerates, changing the scent; transfer the remainder into smaller dark glass vials to limit air exposure if you intend to keep it long term. Keep caps tight, store bottles in a cool dark drawer or original box, skip bathroom shelves with steam. Scent finishes what your wardrobe starts. It’s not loud. It’s not showy. But it’s a detail that tells people you’ve thought this through. Test on skin. Wait for the drydown. Apply less than you want. And over time,like jewelryor your clothes, find the few bottles that smell like you. Dive deeper: Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine. ", "paragraphs": ["Most men know how to buy pants. Some even know how to choose whiskey, which for some reasonfeels easier. Yet when it comes to scent, they either ignore it completely or approach it like someone trying to guess a password: hurried, vaguely ashamed, and absolutely incorrect.", "Smell is part ofyour personal stylewhether you’ve chosen it or not. The scent of fresh laundry, the lingering effect of your morning coffee on your breath, and the remnants of last night’s backyard-grilled-ribeye all accompany you. With intention, fragrance becomes something else entirely. Like polished shoes or standing up straight, it doesn't garner applause, but it’s noticeable when missing.", "Men call it simply “cologne.” That word covers a lot, and most of it isn’t helpful, and partially inaccurate. Scent is expansive. And when used properly, it refines everything else regarding your presence, like holding eye contact forjustthe right amount of time.", "(Or, Why Your Nose Should Never Tingle)", "Fragrance is a cocktail of aromatic compounds, alcohol, and occasionally water. The “concentrate,” if left undiluted, would sear your nostrils and possibly melt your furniture. That’s why perfumers blend in alcohol: so you can wear a scent without losing friends, your security deposit, or your sense of smell.", "Concentration is the secret lever behind strength, longevity, and price. Some ingredients, like oudh or iris butter, are so costly they might as well come with a credit check. Citrus oils sit at the other end. A skilled perfumer knows how to balance rare naturals with crisp synthetics, so the final product doesn’t remind anyone of chemistry class or accidentally cleaning the counter with lemon floor cleaner.", "Projectionis what people notice when you stand still: how far your scent radiates before anyone even sees your tie.Sillage(rhymes with “massage”) is the wake you leave behind as you move, the subtle whiff as you walk by in the hallway. Neither should crash a dinner party or get you a warning at the office.", "As practical matters go, the ratio of concentrate to alcohol is more than just a number on the label. It decides how boldly your scent steps out into the world and how long it hangs around after you’ve left. This is where projection and sillage show up. Higher concentration means richer scent, more hours on skin, and usually a little more “hello” when you walk in. Lower concentration leans fresher and lighter, fading sooner, rarely announcing itself past arm’s length.", "Get the concentration right and your scent will work for you exactly as your clothes: contributing to the overall experience but not distracting. You want someone to tell you that you smell nice in the same way you'd want someone complimenting a piece of your outfit: because it's noticeable and refined, not unavoidable.", "Fragrance, when done right, requires restraint. Projection, sillage, and longevity are adjustable settings, not a moral stance. The goal isn’t to dominate the room. The goal is to be smelled without being… discussed. No one wants to hear, “Someone’s wearing cologne,” in that flat office voice that means they’re not really curious, just annoyed.", "A quick note before the breakdown: Concentration doesn’t necessarily equal quality. It simply refers to how much fragrance oil is in the mix compared to alcohol or water. Higher concentration means stronger presence and longer wear, not necessarily “better.” Many men’s fragrances are only offered as an Eau de Toilette or Eau de Parfum, and that doesn’t make them less refined. It's a bit like confusing a whiskey with the highest ethanol content as “the best”.", "Concentration is not just about strength. Because different notes evaporate at different speeds, the concentration changes how a fragrance actually smells on your skin. A woody amber in parfum may feel dense and resinous, while the eau de toilette version of the same scent might highlight the citrus opening and read fresher.", "If you find a scent you like wears off quickly, moving up to a higher concentration may be the answer. It's also possible a scent you like is so strong it becomes annoying to keep smelling on yourself after an hour.", "With that in mind, here’s how each concentration typically behaves in practice:", "The most concentrated, longest-lasting option. It clings to skin for 12 to 24 hours, sometimes more. Wear it carefully. It suits men who enjoy depth and richness. It is the most expensive concentration and not all men's fragrances are offered as parfum.  Experiment with using less than you're used to. Half a spritz to start.", "Usually lasts 5 to 8 hours. This is where many modern fragrances sit because it offers a balance: enough depth to be interesting without becoming overwhelming. When people talk about a fragrance with character, they’re often describing an EDP. Also half a spritz to start until you dial it in with how it works on your body.", "It typically lasts about 3 to 5 hours, which makes it lighter and easier to wear in everyday life. This is where most men’s fragrances live, from long-established classics like Acqua di Gio and Drakkar Noir to modern staples such as Dior Sauvage. EDTs are the most common format not because they’re “lesser” but because they present enough to be noticed in close company, subtle enough to reapply without overwhelming anyone. For many men, especially those buying one bottle they expect to use regularly, EDT is the natural fit.", "Bright, quick, and often citrus-forward, with a lifespan of about two hours. Useful for a refresh, but rarely the one fragrance a man keeps on his shelf. Historically important, but today often more of a side character.", "Men rush into full bottles the way I rush into buying groceries when hungry, with appetite and regret. Sampling changes the odds. There are discovery sets (pre-curated sample collections that come with a coupon for a full bottle), “decant” services that split bottles into five to ten milliliter vials, and boutiques that will happily spray until you look dazed.", "Pro tip from a guy who once panic-bought a celebrity scent at a duty free: start with a sample, wear it through a normal day, and only commit if it keeps behaving politely.", "The best way to try a scent is to head to a store and use their paper testers first. Then, when you find one you like, spray a small amount directly on your skin, such as your neck or wrists. Notice how you feel about it over the next few hours. Does it evolve in a way you like? Can you still smell it after an hour?", "If you must buy sight unseen, buy small.", "(Or, Why Smaller Is Smarter)", "Fragrance comes in a handful of standard sizes:", "Like most things, larger bottles almost always have a lower cost per milliliter, and brands want you to notice. It’s designed to make the smaller bottle feel like a ripoff. Here’s the catch: that savings only matters if youactually finish the bottlebefore you get bored or the scent loses its punch.", "Most men don’t. The big bottle gets sidelined for something new, sits half-used, and eventually fades in strength, along with your supposed “savings.” The value bias tricks you into buying more than you should which ≠ a good value.", "I’ve yet to regret a 50 ml bottle, even with a higher per ml price. I actually find the prices for this size to feel more appropriate for what I want to pay for smelly water than the larger sizes anyhow. Running out is a decision point, not a waste. Better to buy what you’ll finish than to let a bigger bottle become background clutter.", "→Fragrance for the home:7 Budget Scents to Upgrade Your Space and Routine That Smell Premium Without Breaking the Bank", "(Or, Fragrance is Like Lasagna or Criticism: Layers Matter)", "The final phase is known as thedrydown. It's how the whole thing settles after the top and heart notes fade. It's the story you end up with, representing the true character of the fragrance. Everyone’s skin tells it a little differently.", "(Or, “I thought Aqua DiGiorno sounded wrong”)", "Luxury makes counterfeiters busy. Quick checks matter: buy from authorized retailers, notice prices that feel too generous, and when in doubt buy directly from the brand. Counterfeits can smell off or irritate skin, so the small extra cost for authenticity is not vanity, it is sanity.", "For travel, smallatomizerdecants are indispensable, they fita dopp kitand reduce anxiety about losing a favorite bottle. When bottles sit half empty, oxidation accelerates, changing the scent; transfer the remainder into smaller dark glass vials to limit air exposure if you intend to keep it long term. Keep caps tight, store bottles in a cool dark drawer or original box, skip bathroom shelves with steam.", "Scent finishes what your wardrobe starts. It’s not loud. It’s not showy. But it’s a detail that tells people you’ve thought this through.", "Test on skin. Wait for the drydown. Apply less than you want. And over time,like jewelryor your clothes, find the few bottles that smell like you.", "Dive deeper:", "Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine.", ""], "word_count": 1583, "content_type": "general", "normalized_url": "https://www.primermagazine.com/2025/learn/mens-cologne-fragrance-explained", "site_name": "Primer Magazine", "site_domain": "primermagazine.com"}
{"url": "https://www.primermagazine.com/2012/learn/an-introduction-to-the-military-phonetic-alphabet", "title": "An Introduction to the Military Phonetic Alphabet", "author": null, "publish_date": null, "text": "Points of interest, as told by Jason Hoffman: For some of us, the extent of our knowledge of the military alphabet comes from Call of Duty and other first-person shooters. While video games are indeed an effective way to learn—I remember becoming a faster typer with the help of the unparalleledMario Teaches Typing—this is both unbecoming to a gentleman and, honestly, a damn shame. That's not to say learning things from CoD is bad. With the help of my friend Jason Hoffman, a former active-duty Marine who served in the Middle East multiple times, I confirmed that, war is, indeed, hell. But, out of the kindness of his heart and his vast knowledge of everything—thanks, Hoff!—and with additional readings from field guides and websites for historical details, here is an introduction to the miracle that is the armed forces phonetic alphabet. According to the U.S. Army, the current set of words we use when referring to the military's phonetic alphabet came into use in 1956. The words used prior to 1956 were adopted in 1941. This explains why, in World War II movies and series likeBand of Brothers(which you have seen, right?), we find Able, Baker, and Charlie companies as opposed to Alpha, Bravo, and Charlie companies. But why use these designations in the first place? Let us imagine a scene. You are on your cellphone walking down a sidewalk and you're talking to your boss, Mr. Anderson, explaining why you are late. As a junker rattles by and backfires, what's being said is effectively rendered unintelligible. Now let us imagine that the sidewalk is a dusty street. You are in an infantry outfit. The buildings on either side are blown-out shells. You are on the radio withSgt.Anderson. The old junker is a truck with a machine gun mounted on its bed. The backfire is, instead, replaced with the report of dozens of 7.62 mm rounds from a PK machine gun flying toward the enemy—or you. You don't have time to repeat yourself. And if you screw up the message, there could be some fatal consequences. While I consider myself a man who enjoys taking the occasional risk, if you can radio in and, well, do anything but shoot back at the enemy, you're a guy with more sand than a lot of us. “Here's how the radio works,” Hoffman says. “It's a completely different way of talking.” The main two rules, however: Never say “repeat,” as this tells the artillery to fire again. Instead say “Say again your last.” And No. 2, although the radios are encrypted, never speak in more than 15-second bursts. (If the message takes longer than 15 seconds, wait for two seconds, then speak again.) The 15-second bursts are used just in case radio signals bounce off of something and the enemy channels in inadvertently. Although they use codenames for checkpoints and places on their maps, etc., it's a security measure so that encryption has time to reboot itself and hopefully cut the message short if any hostiles are listening in. While using words with multiple syllables instead of spelling things out may take even a little more precious time, clarification supersedes saving those half seconds to make sure the message gets across clearly. Why? “[Because] there are so many [foxtrot-uniform-charlie-kilo]ing acronyms in the military,” Hoffman says. Among the uses: ZAP numbers, which are used to pull up statistics of those wounded and killed on the battlefield; identifying yourself; calling out grid coordinates; and even when encountering a situation when, normally, WTF is appropriate, some service members opt to use the more official sounding ‘whiskey, tango, foxtrot.' As for civilian usage, of which Hoffman and I can confirm the hilarity of, the phonetic military alphabet can also be used. Burger King is Bravo Kilo. High definition or the, uh, “unkempt” hair diaper are known as hotel deltas. I am Golf Alpha Alpha (alpha as hell, boys) and he is—well, Hoff is Sarge, Hoffman, Hoff or Echo-Five Hotel. There are also a few uses which may come in handy in seemingly incongruent situations. One, when you have to spell your name out over the phone. Second, if a police officer pulls you over and you're forced to say the alphabet backward (under suspicions of not-so-OK driving). If they still do that, at least. “Why yes, officer, zulu, yankee, X-ray, whiskey, victor…” And so, like in those games, you achieve victory. But let me tell you, gents, in real life, the graphics are much better and winning is so much sweeter. Special thanks to Jason, and all the other men and women of the Armed Forces for doing what most never could. Gin Ando is a news junkie and coffee addict. He currently works in advertising and cannot stop writing. As a post-college twentysomething, he too is navigating the adult world. And he needs friends. Follow him on Twitter@GinAAndo. ", "paragraphs": ["Points of interest, as told by Jason Hoffman:", "For some of us, the extent of our knowledge of the military alphabet comes from Call of Duty and other first-person shooters. While video games are indeed an effective way to learn—I remember becoming a faster typer with the help of the unparalleledMario Teaches Typing—this is both unbecoming to a gentleman and, honestly, a damn shame.", "That's not to say learning things from CoD is bad. With the help of my friend Jason Hoffman, a former active-duty Marine who served in the Middle East multiple times, I confirmed that, war is, indeed, hell. But, out of the kindness of his heart and his vast knowledge of everything—thanks, Hoff!—and with additional readings from field guides and websites for historical details, here is an introduction to the miracle that is the armed forces phonetic alphabet.", "According to the U.S. Army, the current set of words we use when referring to the military's phonetic alphabet came into use in 1956. The words used prior to 1956 were adopted in 1941. This explains why, in World War II movies and series likeBand of Brothers(which you have seen, right?), we find Able, Baker, and Charlie companies as opposed to Alpha, Bravo, and Charlie companies.", "But why use these designations in the first place?", "Let us imagine a scene. You are on your cellphone walking down a sidewalk and you're talking to your boss, Mr. Anderson, explaining why you are late. As a junker rattles by and backfires, what's being said is effectively rendered unintelligible. Now let us imagine that the sidewalk is a dusty street. You are in an infantry outfit. The buildings on either side are blown-out shells. You are on the radio withSgt.Anderson. The old junker is a truck with a machine gun mounted on its bed. The backfire is, instead, replaced with the report of dozens of 7.62 mm rounds from a PK machine gun flying toward the enemy—or you. You don't have time to repeat yourself. And if you screw up the message, there could be some fatal consequences.", "While I consider myself a man who enjoys taking the occasional risk, if you can radio in and, well, do anything but shoot back at the enemy, you're a guy with more sand than a lot of us.", "“Here's how the radio works,” Hoffman says. “It's a completely different way of talking.”", "The main two rules, however: Never say “repeat,” as this tells the artillery to fire again. Instead say “Say again your last.” And No. 2, although the radios are encrypted, never speak in more than 15-second bursts. (If the message takes longer than 15 seconds, wait for two seconds, then speak again.) The 15-second bursts are used just in case radio signals bounce off of something and the enemy channels in inadvertently. Although they use codenames for checkpoints and places on their maps, etc., it's a security measure so that encryption has time to reboot itself and hopefully cut the message short if any hostiles are listening in.", "While using words with multiple syllables instead of spelling things out may take even a little more precious time, clarification supersedes saving those half seconds to make sure the message gets across clearly.", "Why?", "“[Because] there are so many [foxtrot-uniform-charlie-kilo]ing acronyms in the military,” Hoffman says.", "Among the uses: ZAP numbers, which are used to pull up statistics of those wounded and killed on the battlefield; identifying yourself; calling out grid coordinates; and even when encountering a situation when, normally, WTF is appropriate, some service members opt to use the more official sounding ‘whiskey, tango, foxtrot.'", "As for civilian usage, of which Hoffman and I can confirm the hilarity of, the phonetic military alphabet can also be used. Burger King is Bravo Kilo. High definition or the, uh, “unkempt” hair diaper are known as hotel deltas. I am Golf Alpha Alpha (alpha as hell, boys) and he is—well, Hoff is Sarge, Hoffman, Hoff or Echo-Five Hotel.", "There are also a few uses which may come in handy in seemingly incongruent situations. One, when you have to spell your name out over the phone. Second, if a police officer pulls you over and you're forced to say the alphabet backward (under suspicions of not-so-OK driving). If they still do that, at least.", "“Why yes, officer, zulu, yankee, X-ray, whiskey, victor…”", "And so, like in those games, you achieve victory. But let me tell you, gents, in real life, the graphics are much better and winning is so much sweeter.", "Special thanks to Jason, and all the other men and women of the Armed Forces for doing what most never could.", "Gin Ando is a news junkie and coffee addict. He currently works in advertising and cannot stop writing. As a post-college twentysomething, he too is navigating the adult world. And he needs friends. Follow him on Twitter@GinAAndo.", ""], "word_count": 812, "content_type": "general", "normalized_url": "https://www.primermagazine.com/2012/learn/an-introduction-to-the-military-phonetic-alphabet", "site_name": "Primer Magazine", "site_domain": "primermagazine.com"}
{"url": "https://www.primermagazine.com/2016/spend/a-comprehensive-guide-to-watch-straps", "title": "A Comprehensive Guide to Watch Straps", "author": null, "publish_date": null, "text": "A proper strap is an essential companion to any watch, and switching it out is an easy way to experiment with a whole new style. A broad and diverse strap collection can greatly extend the number of combinations available to you; to an observer, the band is often more visible than the face of the watch, so a large assortment of straps will make a small collection of watches appear truly enormous. By their very nature, watch straps are often considerably cheaper than an entirely new watch, so it is often more cost-effective to expand one’s collection of straps over splurging on another watch. That’s not to say one shouldn’t own an assortment of watches – just make sure you don’t neglect that which connects them to your wrist. There is an absolutely humungous amount of watch straps available to you, and I will do my best to document the best watch straps here. Each strap has a fascinating history, so if one of them jumps out at you, the accompanying text will surely be an interesting read. Finally, be sure to check out the lists of available retailers; they should help you find exactly what you’re looking for, regardless of your price range. Don’t be afraid to spend a bit extra to get exactly what you want! Without further ado, let’s get started! Revised and expanded Fall 2023. In the world of horology, the terms used to describe the part of a watch that wraps around the wrist—watch bands, watch straps, and watch bracelets—can seem interchangeable. Yet, there are subtle distinctions that define each of these terms. Watch bands encompass a broad category that includes both metal and non-metal attachments. Essentially, a watch band can be made of any material, whether it's leather, metal, fabric, or rubber. It's a generic term that often refers to the entire spectrum of wrist attachments. Watch straps specifically refer to non-metal bands made from materials like leather, nylon, or rubber. These straps offer a casual and often customizable appeal, with options like the sporty NATO strap or the elegant leather strap. They are favored for their comfort and versatility, allowing wearers to switch between different looks. Watch bracelets are a subset of watch bands, crafted exclusively from metal. Whether it's stainless steel, titanium, or gold, watch bracelets provide a sophisticated and durable option. Designs like the Oyster and Jubilee are classic examples of metal bracelets that have become synonymous with luxury and style. While these distinctions exist, it's common to find these terms used interchangeably, especially in casual conversation or online retail. The nuances are often more recognized by watch enthusiasts and collectors who appreciate the subtle differences in material and design. In the end, whether it's a band, strap, or bracelet, the choice often comes down to personal style, comfort, and the occasion for which the watch is worn. Understanding these terms adds a layer of insight for those looking to explore the diverse world of watch accessories, allowing for a more informed and tailored selection. Watch bands are sold in sizes measured in millimeters based on the interior width of the watch lugs. If you'r lucky, the size may be printed on the back of the current watch strap. To measure, use a metric ruler or a freeprintable template like this oneto find the distance between the lugs of the watch case or the spring bar end of the current strap. Do not include the spring bar in the measurement. As a refresher, there are 10 millimeters in a centimeter. The journey of watch straps is a fascinating tale, interwoven with history, fashion, functionality, and innovation. Here's a glimpse into the key milestones that shaped the world of watch straps: This historical panorama sets the stage for understanding the multitude of strap options available today, from the classic NATO to the avant-garde Milanese. The watch strap, once a mere practical accessory, has become a canvas for style, identity, and a reflection of the times. Table of ContentsClick on each to jump to its section Originally developed for British Army soldiers in the 1970s, the NATO strap originally debuted under the name “G10”, a title taken from the form for requisition. Although similar styles can be traced back to World War II, this was the first appearance of the strap under its contemporary title. It quickly grew in popularity throughout the military, and over time, the general public gradually began to appreciate the strap for its numerous features and abilities. When the Cold War ended, G10 straps were sold in military surplus shops around the country, and they were all branded with a unique NATO Surplus Number. Surplus stores sold out quickly, but watch strap retailers sprung up to take advantage of the surge in popularity. The veritable storm of NATO straps never quite ended, and they are sure to remain popular for decades to come. The most notable feature of a NATO strap is its single-piece construction; most other straps are composed of two separate pieces, and can only be applied by removing both of the spring bars that attach to the watch. Switching out straps is normally a time consuming process, but NATO straps are simply woven underneath the spring bars, so they can be removed or applied in a matter of seconds. Finally, the addition of a watch keeper strap ensures that the watch case will remain firmly on your wrist even if one of the spring bars snaps.James Bond has famously worn NATO strapsacross films and actors. All of these characteristics make NATO straps an excellent choice for nearly any situation, and their low price is a boon to those on a budget. Retailers: Trademarked by Maratac, Zulu straps have surprisingly little background for such an interesting name. Although obviously inspired by NATO straps, there are a few minor differences that separate the two. Firstly, they are composed of thicker materials, be it nylon or leather. This slightly increases their strength and durability, but they also might not fit between the spring bars of some watches. Secondly, Zulu straps have larger, more rounded hardware to accommodate their increased girth. In contrast, NATO straps have small, squared-off buckles and rings that better suit its reduced volume.  Finally, the watch keeper strap is an optional inclusion on Zulu watch bands, so they are available in both 3- and 5-ring configurations. Either way, there is almost no aesthetic impact, so just go with whatever you find to be the most comfortable. Thinner straps more akin to a NATO but without the keeper strap are also commonly found labeled as one piece or slip-thru, such as the Timex in the photo above. The generally larger dimensions Zulu straps make them especially good for large watches, since the face is more comparable to the hardware in terms of size. Conversely, NATO straps are excellent for small watches; the thinner material is more likely to fit through the spring bars, and they have a more proportionate appearance. Zulu straps also take a bit longer to break in, but at the same time, they will most likely last longer than a NATO. In the end, it comes down to personal preference – some people can’t handle the extra bulk a Zulu provides, but others find NATO straps to be too flimsy. I recommend picking up one of each type and deciding which you prefer in-person! Retailers: The Watch Forum Inspired by old school racing gloves, Rally straps can be easily recognized by the three or more large perforations punched out below the lugs. Automotive racing is primarily a test of speed, and weight plays directly into the maximum achievable velocity – as such, many early race cars were constructed of parts with holes drilled through them. This decreased the overall weight, so just about everything made of metal was perforated to some extent. To remain aesthetically consistent, driving gloves (and later, rally straps) were perforated, too. Some might argue that the perforations existed primarily for ventilation and breathability, but it’s difficult to tell the true reason. Race cars are notoriously warm, and perforations helped to reduce both heat and weight, so it could have been either one! Regardless of their origin, Rally straps are a great choice for summer wear. Even if it wasn’t the original intention, the perforations do substantially increase ventilation, which can be useful in the summer heat. Furthermore, there’s no better choice of strap to pair with a vintagechronograph, since they were frequently used to time races. If the style or history of the Rally strap appeals to you, I highly recommend picking one up. Retailers: Introduced by Rolex in the 1930’s, the Oyster bracelet is an absolute classic in every sense of the word. The Oyster is characterized by its long and thick three-piece link design, and is by far the most popular bracelet model available. It has premiered on nearlyevery Rolex modelto date, and has gained a massive following as a result. While its storied history is one reason for its success, many people swear by it for its sheer functionality. The wide center bar makes each link strong and less prone to stretching, so the bracelet is exceedingly durable. Furthermore, the relatively small number of links reduces the number of possible break points. This does come at a cost, however; the reduced number of swivel points makes the strap feel a bit stiff in comparison to other bracelets. Aside from this minor problem, the Oyster bracelet is a great choice for nearly any watch. The hefty links are often more proportionate on a large watch, but it looks great on a smaller one, too. The Oyster has a vast and interesting history, and it’s not going anywhere anytime soon. If you’re interested in experimenting with bracelets, this is a great first step! Retailers: Originally worn on the Rolex Day-Date in 1956, the President bracelet received its name from its close association with Dwight D. Eisenhower. As the story goes, Rolex offered Mr. Eisenhower the company’s 150,000thcertified chronometer as a token of respect, which he gladly accepted. The relative width of each link piece is similar to that of the Oyster, but there is a drastic difference in the number of total links. The President bracelet is markedly denser than the Oyster, so each link is much shorter in comparison. This eliminates the problem of stiffness, but it does present a potential problem in terms of durability. The increase in total links also leads to a direct increase in probable break points, but this should not be a major concern. You might notice a small amount of stretching after extensive wear, but this depends entirely on the quality of the strap, not its link construction. The President bracelet is considerably more formal than the Oyster due to its compact links. This also increases the strap’s versatility, since it can be dressed up and down more easily. For this reason, it is an excellent choice when versatility is a primary concern. It typically works best with small- to medium-sized watches, but this comes down to personal preference. Retailers: The Jubilee bracelet was first introduced in 1945 for Rolex’s 40thanniversary – it premiered on the Datejust, one of Rolex’s most renowned dress watches. Though it was at first only available in gold, steel and two-tone versions were released soon after.  The Jubilee is characterized by three narrow, highly polished links situated between the thick, matte finish side links. The total number of links is identical to that of the President bracelet, but the central portion tends to appear narrower due to its triple-wide construction. When placed on a watch, the Jubilee draws attention to the center of the watch face, minimizing the footprint on the wrist. The two-tone variations exacerbate this effect, especially when the central links are a different color than the watch case. As such, a Jubilee bracelet (be it of mono- or duo-tone construction) is an excellent choice for large and small watches alike, since it brings out the best qualities in both. The only true problem with the Jubilee is its propensity towards stretching over long periods of time. Just like the President, the Jubilee’s small links reduce its structural integrity. After a while, the pins holding each link together tend to expand and loosen, gradually extending past the wearer’s true wrist size. Thankfully, modern construction capabilities have fixed many of the structural problems, so the slightly decreased durability is only visible on vintage models. Unless you put it through some serious abuse, you should never have to worry about a Jubilee strap wearing out. Retailers: Designed to be extremely chunky, Engineer bracelets have a notoriously large wrist presence. Believed to have been created by Seiko, the Engineer is a perfect match for heftydive watchesdue to its proportionally sized links. Even though these links are quite large, they are stacked to a width of five total links, so they appear quite visually dense. The links themselves are often cut in a pseudo-hexagonal pattern, which makes them angular in a way that few other bracelets can match. The sheer size of the Engineer bracelet also causes it to be exceedingly heavy and thick, so you might experience a bit of wrist fatigue when you first start wearing it. Of course, the Engineer does make up for its unwieldy volume with its incredible durability, so it’s an excellent choice for a beater watch. While its bulky appearance might at first steer small-wristed folk away, one must consider that proportions are more important than physical dimensions. As stated previously, Engineer bracelets have an undeniable wrist presence, but this makes them perfect to pair with large divers like theSeiko Monster.The bracelet itself matches the width of the watch case, so it has a surprisingly low profile when worn on the wrist. The surprisingly small lugs help with this, too, since they are unlikely to hang over the edge of the wrist. Regardless, the Engineer bracelet can work with any size wrist as long as it remains proportional the watch it is attached to. Retailers: As its name suggests, the Aviator watch strap was popularized by the German air force during World War II. The first iterations were incredibly long so as to fit directly over the pilots’ flight jackets, and one or more rivets were added directly below the lugs to prevent the watches from flying off of their wrists. The watches themselves were also oversized (sometimes upwards of 55mm in diameter) for the sake of clarity in intense situations. Both of these items were greatly reduced in size when they reached the general population, but the basic features remained: the final result is an austere, black watch face with white Arabic numerals, attached to a leather strap with large rivets located below the lugs. While these rivets are now non-functional, they do add an interesting aesthetic flair with a fascinating backstory. Due to their history in the air force, Aviator straps work best on pilot watches, especially those made byStowa, IWC, Laco, and Hamilton. The stark contrast between the black dial and brown Aviator strap exudes a particularly militaristic essence, and the rivets act as a subtle detail harkening back to the watches’ original purpose. This strap also pairs excellently withchronographs, which were introduced to pilots at a later date to help time flight durations. Either way, the Aviator is a beautiful strap that makes for a compelling conversation starter. Retailers: Like Aviator straps, Bund straps were also invented for German pilots in World War II, albeit for a slightly different reason. The single largest hazard in the event of a plane crash is the ensuing fire, and anything composed primarily of metal would quickly become superheated. Watches are always in direct contact with the skin, so a standard strap would allow the watch to scald the wrist. Bund straps, on the other hand, are constructed with an extra layer of padding beneath the back of the case, therefore preventing it from burning the wearer. This was also useful in high altitudes where the temperature would drop dramatically, since the extra layer of leather would prohibit the metal from freezing to the skin. One final use of the Bund strap was its ability to absorb perspiration; early watches were not very water resistant, so sweat could easily enter through the case back and destroy the internal mechanisms of the watch. Servicemen led a very active lifestyle, so the Bund strap helped to drastically improve the lifespan of government-issued watches. It is important to note that Bund straps are not for everyone – they are typically quite warm, which makes them difficult to wear in the summer, and they are often too large for small-wristed folk to wear on a regular basis. Still, they’re an excellent choice for those afflicted with a metal allergy, since they prevent all contact between the watch and the wearer’s skin. If your wrist is large enough to support this strap proportionally, you should give it a try, especially if you own a pilot watch or a chronograph! Remember, though: the Bund’s padding should trace the outline of the watch as closely as possible. Retailers: The name of the Shark Mesh bracelet might immediately conjure images of the fierce oceanic predator, but the strap itself has almost no physical relation to the vicious beast. The famous title was derived from a popular advertising campaign launched byOmegafor their new ground-breaking dive watch, the Ploprof 600. Intended for professional use, this watch was built to withstand extended operations at extreme depths. This watch was one of the most rugged and robust divers’ watches ever made, and its strap lives up to the hype. Although it is not literally “shark-proof” as the advertisements claim, it is more durable than a standard bracelet due to the lack of pins between links. Since the entire strap is held together by intertwined loops, there are drastically fewer break points. The loose and chunky chainmail design provides a flexible and snug fit to anyone’s wrist, and the easily removable links allows the wearer to remove all excess material. While the strap is relatively heavy, it retains a high level of breathability by means of the large gaps between the interwoven links. The most noticeable feature of the Shark Mesh strap is its comparatively large links. Most other mesh bracelets tend to be tightly woven with small links, but the Shark Mesh is the complete opposite. As such, many people tend to view it as the most comfortable option, since the relaxed nature of the links allows for a smooth drape around the wrist. I recommend pairing this strap with a vintage 1970’s diver, but as long as the proportions are right, you can attach it to just about anything! Retailers: As their name implies, Milanese watch straps were originally developed in Milan, Italy. The Milanese mesh design can be traced all the way back to the 13thcentury, where it was used as a special kind of chainmail. The manufacturing process was completed entirely by hand, and remained an Italian specialty for over 500 years. Renowned German watch strap specialists Staib and Vollmer renewed production of these rare straps in the early 1920’s, causing a skyrocket in popularity. This demand lasted late into the 60’s, so Milanese straps are a common appearance on vintage dress watches. The straps themselves are easily distinguished by their extremely dense and tightly woven mesh construction, which makes them some of the smoothest metal straps on the market. This does come at a slight cost to durability, but these straps are frequently worn in more formal environments, so resistance to the elements is less of a concern. Some people also may find that the tightness of the mesh causes a certain degree of rigidity, which might feel a bit less comfortable than looser weaves. Regardless of these minor problems, Milanese straps are an excellent choice for all-around wear. Although some might view them as somewhat antique, they work just as well with contemporary watches as they do vintage ones. Remember to keep proportions in mind – the extremely thin links might appear disproportionate when worn with a large watch, so I recommend keeping the watch face under 40mm. Retailers: Tropic straps were originally developed in the 60’s as a cheaper alternative to the metal bracelets used on sport-based Rolex andTudor watches. Metal bracelets were certainly practical for underwater excursions, but they were very heavy and expensive to replace; luckily, rubber straps served as a solution to both of these problems. The Tropic strap was the first rubber strap ever released, and it quickly began to corner the dive watch market. It was easily recognizable by the characteristic basket weave pattern stamped into the outward-facing side of the strap, in addition to the numerous perforations running lengthwise from tip to lug. This gave the strap a unique texture in addition to a copious amount of breathability, which was unexpected out of a strap built to be waterproof. Early models were somewhat stiff and brittle, but by the 70’s, Tropic straps had been further improved to retain their supple qualities even after years of use. One of the most amazing features of the Tropic strap was its incredible longevity  – even though it was marketed as easily replicable, many models are still in use today (over 40 years later), and they feel and function just like when they were first commissioned. Furthermore, they managed to possess this durability while maintaining a very slim profile, which is rare even for modern variants. Tropic straps tend to work best on vintage divers due to their shared history, but they also work exceptionally well with contemporary timepieces. Retailers: Like Tropic straps, Perlon straps were also popularized in the 60’s. Perlon straps are easily recognized by their tightly woven basket weave pattern, which is similar in appearance to the surface of a Tropic strap. Instead of being a stamped pattern, however, it is an actual weave composed of thick nylon-esque threads. This characteristic gives Perlon straps a magnificent three-dimensional texture while simultaneously providing extreme amounts of breathability. One of the most unique features of the Perlon strap is its infinite resizability – there are no predetermined holes, so the buckle’s prong simply slides through an opening in the weave. This makes the strap a perfect choice for peculiar wrist sizes, since any circumference can be reached exactly. Perlon is also very abrasion resistant, so it rarely fray from continued use. Finally, Perlon dries quickly and does not stretch when wet, so it is an excellent choice for diving when rubber is unavailable or unwanted. Perlon straps were invented in Europe, and they never quite managed to cross into American culture. As a result, very few continental retailers offer these straps, so you might have to look into international sellers to find specific colors and styles. Perlon straps peaked in popularity in the 60’s and 70’s, so they tend to look best on vintage divers. Regardless of their original purpose, they work beautifully with all manner of watches, from chronographs to dress watches. Their extreme breathability and durability makes them a summer favorite, and their cheap price makes them easy to invest in – I highly recommend picking up a few of them! Retailers: Premiering on the 6105 Diver in the early 70’s, the Waffle strap is an iconic Seiko invention. This watch is widely regarded as the single most important diver in the company’s history, and was a common choice for Vietnam servicemen. While the original army-issued watches failed in the humid jungles, the Seiko 6105’s kept ticking long after the end of the war. As veterans returned to the U.S., their watches went with them, and they quickly rose in popularity among civilian circles. The characteristic Waffle strap, obviously named for its distinct texture, adorned a majority of these watches, and was loved by many. Numerous small vents ran down the sides of the strap, which greatly increased its breathability. Since it was composed of rubber, it was entirely waterproof and easily cleanable, and also quite flexible to boot. Sadly, most vintage straps are now hardened and brittle, so many enthusiasts have turned to replicas and homages. Obviously, the Waffle strap looks best on a vintage Seiko, but that’s a pretty tall order. These watches (and their accompanying straps) are no longer in production, so they are ludicrously overpriced for any non-collector. Even so, comparatively inexpensive 1:1 reproductions have been made by multiple retailers, so if you’re looking for a historic Seiko experience, I highly recommend trying one out. Retailers: Finally, there are two more rarely seen straps that I will quickly gloss over: Retailers: This long velcro strap was provided to the Apollo astronauts to wear with their Omega Speedmasters on the outside of their spacesuit. Retailers: Brad is a full-time student at Temple University in Philadelphia, PA. He is a consistent contributor to numerous fashion communities, and specializes inlong-form composition. Above all else, he is currently stressed out of his mind.\n\nFeel free to contact him onRedditfor suggestions, inspiration, and pleasant conversation! ", "paragraphs": ["A proper strap is an essential companion to any watch, and switching it out is an easy way to experiment with a whole new style. A broad and diverse strap collection can greatly extend the number of combinations available to you; to an observer, the band is often more visible than the face of the watch, so a large assortment of straps will make a small collection of watches appear truly enormous.", "By their very nature, watch straps are often considerably cheaper than an entirely new watch, so it is often more cost-effective to expand one’s collection of straps over splurging on another watch. That’s not to say one shouldn’t own an assortment of watches – just make sure you don’t neglect that which connects them to your wrist.", "There is an absolutely humungous amount of watch straps available to you, and I will do my best to document the best watch straps here. Each strap has a fascinating history, so if one of them jumps out at you, the accompanying text will surely be an interesting read. Finally, be sure to check out the lists of available retailers; they should help you find exactly what you’re looking for, regardless of your price range. Don’t be afraid to spend a bit extra to get exactly what you want!", "Without further ado, let’s get started!", "Revised and expanded Fall 2023.", "In the world of horology, the terms used to describe the part of a watch that wraps around the wrist—watch bands, watch straps, and watch bracelets—can seem interchangeable. Yet, there are subtle distinctions that define each of these terms.", "Watch bands encompass a broad category that includes both metal and non-metal attachments. Essentially, a watch band can be made of any material, whether it's leather, metal, fabric, or rubber. It's a generic term that often refers to the entire spectrum of wrist attachments.", "Watch straps specifically refer to non-metal bands made from materials like leather, nylon, or rubber. These straps offer a casual and often customizable appeal, with options like the sporty NATO strap or the elegant leather strap. They are favored for their comfort and versatility, allowing wearers to switch between different looks.", "Watch bracelets are a subset of watch bands, crafted exclusively from metal. Whether it's stainless steel, titanium, or gold, watch bracelets provide a sophisticated and durable option. Designs like the Oyster and Jubilee are classic examples of metal bracelets that have become synonymous with luxury and style.", "While these distinctions exist, it's common to find these terms used interchangeably, especially in casual conversation or online retail. The nuances are often more recognized by watch enthusiasts and collectors who appreciate the subtle differences in material and design.", "In the end, whether it's a band, strap, or bracelet, the choice often comes down to personal style, comfort, and the occasion for which the watch is worn. Understanding these terms adds a layer of insight for those looking to explore the diverse world of watch accessories, allowing for a more informed and tailored selection.", "Watch bands are sold in sizes measured in millimeters based on the interior width of the watch lugs. If you'r lucky, the size may be printed on the back of the current watch strap.", "To measure, use a metric ruler or a freeprintable template like this oneto find the distance between the lugs of the watch case or the spring bar end of the current strap. Do not include the spring bar in the measurement. As a refresher, there are 10 millimeters in a centimeter.", "The journey of watch straps is a fascinating tale, interwoven with history, fashion, functionality, and innovation. Here's a glimpse into the key milestones that shaped the world of watch straps:", "This historical panorama sets the stage for understanding the multitude of strap options available today, from the classic NATO to the avant-garde Milanese. The watch strap, once a mere practical accessory, has become a canvas for style, identity, and a reflection of the times.", "Table of ContentsClick on each to jump to its section", "Originally developed for British Army soldiers in the 1970s, the NATO strap originally debuted under the name “G10”, a title taken from the form for requisition. Although similar styles can be traced back to World War II, this was the first appearance of the strap under its contemporary title.", "It quickly grew in popularity throughout the military, and over time, the general public gradually began to appreciate the strap for its numerous features and abilities. When the Cold War ended, G10 straps were sold in military surplus shops around the country, and they were all branded with a unique NATO Surplus Number. Surplus stores sold out quickly, but watch strap retailers sprung up to take advantage of the surge in popularity. The veritable storm of NATO straps never quite ended, and they are sure to remain popular for decades to come.", "The most notable feature of a NATO strap is its single-piece construction; most other straps are composed of two separate pieces, and can only be applied by removing both of the spring bars that attach to the watch. Switching out straps is normally a time consuming process, but NATO straps are simply woven underneath the spring bars, so they can be removed or applied in a matter of seconds.", "Finally, the addition of a watch keeper strap ensures that the watch case will remain firmly on your wrist even if one of the spring bars snaps.James Bond has famously worn NATO strapsacross films and actors. All of these characteristics make NATO straps an excellent choice for nearly any situation, and their low price is a boon to those on a budget.", "Retailers:", "Trademarked by Maratac, Zulu straps have surprisingly little background for such an interesting name. Although obviously inspired by NATO straps, there are a few minor differences that separate the two. Firstly, they are composed of thicker materials, be it nylon or leather. This slightly increases their strength and durability, but they also might not fit between the spring bars of some watches. Secondly, Zulu straps have larger, more rounded hardware to accommodate their increased girth.", "In contrast, NATO straps have small, squared-off buckles and rings that better suit its reduced volume.  Finally, the watch keeper strap is an optional inclusion on Zulu watch bands, so they are available in both 3- and 5-ring configurations. Either way, there is almost no aesthetic impact, so just go with whatever you find to be the most comfortable.", "Thinner straps more akin to a NATO but without the keeper strap are also commonly found labeled as one piece or slip-thru, such as the Timex in the photo above.", "The generally larger dimensions Zulu straps make them especially good for large watches, since the face is more comparable to the hardware in terms of size. Conversely, NATO straps are excellent for small watches; the thinner material is more likely to fit through the spring bars, and they have a more proportionate appearance. Zulu straps also take a bit longer to break in, but at the same time, they will most likely last longer than a NATO.", "In the end, it comes down to personal preference – some people can’t handle the extra bulk a Zulu provides, but others find NATO straps to be too flimsy. I recommend picking up one of each type and deciding which you prefer in-person!", "Retailers:", "The Watch Forum", "Inspired by old school racing gloves, Rally straps can be easily recognized by the three or more large perforations punched out below the lugs. Automotive racing is primarily a test of speed, and weight plays directly into the maximum achievable velocity – as such, many early race cars were constructed of parts with holes drilled through them. This decreased the overall weight, so just about everything made of metal was perforated to some extent. To remain aesthetically consistent, driving gloves (and later, rally straps) were perforated, too.", "Some might argue that the perforations existed primarily for ventilation and breathability, but it’s difficult to tell the true reason. Race cars are notoriously warm, and perforations helped to reduce both heat and weight, so it could have been either one!", "Regardless of their origin, Rally straps are a great choice for summer wear. Even if it wasn’t the original intention, the perforations do substantially increase ventilation, which can be useful in the summer heat. Furthermore, there’s no better choice of strap to pair with a vintagechronograph, since they were frequently used to time races. If the style or history of the Rally strap appeals to you, I highly recommend picking one up.", "Retailers:", "Introduced by Rolex in the 1930’s, the Oyster bracelet is an absolute classic in every sense of the word. The Oyster is characterized by its long and thick three-piece link design, and is by far the most popular bracelet model available. It has premiered on nearlyevery Rolex modelto date, and has gained a massive following as a result.", "While its storied history is one reason for its success, many people swear by it for its sheer functionality. The wide center bar makes each link strong and less prone to stretching, so the bracelet is exceedingly durable. Furthermore, the relatively small number of links reduces the number of possible break points. This does come at a cost, however; the reduced number of swivel points makes the strap feel a bit stiff in comparison to other bracelets.", "Aside from this minor problem, the Oyster bracelet is a great choice for nearly any watch. The hefty links are often more proportionate on a large watch, but it looks great on a smaller one, too. The Oyster has a vast and interesting history, and it’s not going anywhere anytime soon. If you’re interested in experimenting with bracelets, this is a great first step!", "Retailers:", "Originally worn on the Rolex Day-Date in 1956, the President bracelet received its name from its close association with Dwight D. Eisenhower. As the story goes, Rolex offered Mr. Eisenhower the company’s 150,000thcertified chronometer as a token of respect, which he gladly accepted. The relative width of each link piece is similar to that of the Oyster, but there is a drastic difference in the number of total links. The President bracelet is markedly denser than the Oyster, so each link is much shorter in comparison.", "This eliminates the problem of stiffness, but it does present a potential problem in terms of durability. The increase in total links also leads to a direct increase in probable break points, but this should not be a major concern. You might notice a small amount of stretching after extensive wear, but this depends entirely on the quality of the strap, not its link construction.", "The President bracelet is considerably more formal than the Oyster due to its compact links. This also increases the strap’s versatility, since it can be dressed up and down more easily. For this reason, it is an excellent choice when versatility is a primary concern. It typically works best with small- to medium-sized watches, but this comes down to personal preference.", "Retailers:", "The Jubilee bracelet was first introduced in 1945 for Rolex’s 40thanniversary – it premiered on the Datejust, one of Rolex’s most renowned dress watches. Though it was at first only available in gold, steel and two-tone versions were released soon after.  The Jubilee is characterized by three narrow, highly polished links situated between the thick, matte finish side links. The total number of links is identical to that of the President bracelet, but the central portion tends to appear narrower due to its triple-wide construction.", "When placed on a watch, the Jubilee draws attention to the center of the watch face, minimizing the footprint on the wrist. The two-tone variations exacerbate this effect, especially when the central links are a different color than the watch case. As such, a Jubilee bracelet (be it of mono- or duo-tone construction) is an excellent choice for large and small watches alike, since it brings out the best qualities in both.", "The only true problem with the Jubilee is its propensity towards stretching over long periods of time. Just like the President, the Jubilee’s small links reduce its structural integrity. After a while, the pins holding each link together tend to expand and loosen, gradually extending past the wearer’s true wrist size. Thankfully, modern construction capabilities have fixed many of the structural problems, so the slightly decreased durability is only visible on vintage models. Unless you put it through some serious abuse, you should never have to worry about a Jubilee strap wearing out.", "Retailers:", "Designed to be extremely chunky, Engineer bracelets have a notoriously large wrist presence. Believed to have been created by Seiko, the Engineer is a perfect match for heftydive watchesdue to its proportionally sized links. Even though these links are quite large, they are stacked to a width of five total links, so they appear quite visually dense. The links themselves are often cut in a pseudo-hexagonal pattern, which makes them angular in a way that few other bracelets can match.", "The sheer size of the Engineer bracelet also causes it to be exceedingly heavy and thick, so you might experience a bit of wrist fatigue when you first start wearing it. Of course, the Engineer does make up for its unwieldy volume with its incredible durability, so it’s an excellent choice for a beater watch.", "While its bulky appearance might at first steer small-wristed folk away, one must consider that proportions are more important than physical dimensions. As stated previously, Engineer bracelets have an undeniable wrist presence, but this makes them perfect to pair with large divers like theSeiko Monster.The bracelet itself matches the width of the watch case, so it has a surprisingly low profile when worn on the wrist. The surprisingly small lugs help with this, too, since they are unlikely to hang over the edge of the wrist.", "Regardless, the Engineer bracelet can work with any size wrist as long as it remains proportional the watch it is attached to.", "Retailers:", "As its name suggests, the Aviator watch strap was popularized by the German air force during World War II. The first iterations were incredibly long so as to fit directly over the pilots’ flight jackets, and one or more rivets were added directly below the lugs to prevent the watches from flying off of their wrists. The watches themselves were also oversized (sometimes upwards of 55mm in diameter) for the sake of clarity in intense situations. Both of these items were greatly reduced in size when they reached the general population, but the basic features remained: the final result is an austere, black watch face with white Arabic numerals, attached to a leather strap with large rivets located below the lugs. While these rivets are now non-functional, they do add an interesting aesthetic flair with a fascinating backstory.", "Due to their history in the air force, Aviator straps work best on pilot watches, especially those made byStowa, IWC, Laco, and Hamilton. The stark contrast between the black dial and brown Aviator strap exudes a particularly militaristic essence, and the rivets act as a subtle detail harkening back to the watches’ original purpose.", "This strap also pairs excellently withchronographs, which were introduced to pilots at a later date to help time flight durations. Either way, the Aviator is a beautiful strap that makes for a compelling conversation starter.", "Retailers:", "Like Aviator straps, Bund straps were also invented for German pilots in World War II, albeit for a slightly different reason. The single largest hazard in the event of a plane crash is the ensuing fire, and anything composed primarily of metal would quickly become superheated. Watches are always in direct contact with the skin, so a standard strap would allow the watch to scald the wrist.", "Bund straps, on the other hand, are constructed with an extra layer of padding beneath the back of the case, therefore preventing it from burning the wearer. This was also useful in high altitudes where the temperature would drop dramatically, since the extra layer of leather would prohibit the metal from freezing to the skin. One final use of the Bund strap was its ability to absorb perspiration; early watches were not very water resistant, so sweat could easily enter through the case back and destroy the internal mechanisms of the watch. Servicemen led a very active lifestyle, so the Bund strap helped to drastically improve the lifespan of government-issued watches.", "It is important to note that Bund straps are not for everyone – they are typically quite warm, which makes them difficult to wear in the summer, and they are often too large for small-wristed folk to wear on a regular basis. Still, they’re an excellent choice for those afflicted with a metal allergy, since they prevent all contact between the watch and the wearer’s skin. If your wrist is large enough to support this strap proportionally, you should give it a try, especially if you own a pilot watch or a chronograph! Remember, though: the Bund’s padding should trace the outline of the watch as closely as possible.", "Retailers:", "The name of the Shark Mesh bracelet might immediately conjure images of the fierce oceanic predator, but the strap itself has almost no physical relation to the vicious beast. The famous title was derived from a popular advertising campaign launched byOmegafor their new ground-breaking dive watch, the Ploprof 600. Intended for professional use, this watch was built to withstand extended operations at extreme depths.", "This watch was one of the most rugged and robust divers’ watches ever made, and its strap lives up to the hype. Although it is not literally “shark-proof” as the advertisements claim, it is more durable than a standard bracelet due to the lack of pins between links. Since the entire strap is held together by intertwined loops, there are drastically fewer break points. The loose and chunky chainmail design provides a flexible and snug fit to anyone’s wrist, and the easily removable links allows the wearer to remove all excess material.", "While the strap is relatively heavy, it retains a high level of breathability by means of the large gaps between the interwoven links.", "The most noticeable feature of the Shark Mesh strap is its comparatively large links. Most other mesh bracelets tend to be tightly woven with small links, but the Shark Mesh is the complete opposite. As such, many people tend to view it as the most comfortable option, since the relaxed nature of the links allows for a smooth drape around the wrist. I recommend pairing this strap with a vintage 1970’s diver, but as long as the proportions are right, you can attach it to just about anything!", "Retailers:", "As their name implies, Milanese watch straps were originally developed in Milan, Italy. The Milanese mesh design can be traced all the way back to the 13thcentury, where it was used as a special kind of chainmail. The manufacturing process was completed entirely by hand, and remained an Italian specialty for over 500 years. Renowned German watch strap specialists Staib and Vollmer renewed production of these rare straps in the early 1920’s, causing a skyrocket in popularity. This demand lasted late into the 60’s, so Milanese straps are a common appearance on vintage dress watches.", "The straps themselves are easily distinguished by their extremely dense and tightly woven mesh construction, which makes them some of the smoothest metal straps on the market. This does come at a slight cost to durability, but these straps are frequently worn in more formal environments, so resistance to the elements is less of a concern. Some people also may find that the tightness of the mesh causes a certain degree of rigidity, which might feel a bit less comfortable than looser weaves.", "Regardless of these minor problems, Milanese straps are an excellent choice for all-around wear. Although some might view them as somewhat antique, they work just as well with contemporary watches as they do vintage ones. Remember to keep proportions in mind – the extremely thin links might appear disproportionate when worn with a large watch, so I recommend keeping the watch face under 40mm.", "Retailers:", "Tropic straps were originally developed in the 60’s as a cheaper alternative to the metal bracelets used on sport-based Rolex andTudor watches. Metal bracelets were certainly practical for underwater excursions, but they were very heavy and expensive to replace; luckily, rubber straps served as a solution to both of these problems.", "The Tropic strap was the first rubber strap ever released, and it quickly began to corner the dive watch market. It was easily recognizable by the characteristic basket weave pattern stamped into the outward-facing side of the strap, in addition to the numerous perforations running lengthwise from tip to lug. This gave the strap a unique texture in addition to a copious amount of breathability, which was unexpected out of a strap built to be waterproof. Early models were somewhat stiff and brittle, but by the 70’s, Tropic straps had been further improved to retain their supple qualities even after years of use.", "One of the most amazing features of the Tropic strap was its incredible longevity  – even though it was marketed as easily replicable, many models are still in use today (over 40 years later), and they feel and function just like when they were first commissioned. Furthermore, they managed to possess this durability while maintaining a very slim profile, which is rare even for modern variants.", "Tropic straps tend to work best on vintage divers due to their shared history, but they also work exceptionally well with contemporary timepieces.", "Retailers:", "Like Tropic straps, Perlon straps were also popularized in the 60’s. Perlon straps are easily recognized by their tightly woven basket weave pattern, which is similar in appearance to the surface of a Tropic strap. Instead of being a stamped pattern, however, it is an actual weave composed of thick nylon-esque threads. This characteristic gives Perlon straps a magnificent three-dimensional texture while simultaneously providing extreme amounts of breathability.", "One of the most unique features of the Perlon strap is its infinite resizability – there are no predetermined holes, so the buckle’s prong simply slides through an opening in the weave.", "This makes the strap a perfect choice for peculiar wrist sizes, since any circumference can be reached exactly. Perlon is also very abrasion resistant, so it rarely fray from continued use. Finally, Perlon dries quickly and does not stretch when wet, so it is an excellent choice for diving when rubber is unavailable or unwanted.", "Perlon straps were invented in Europe, and they never quite managed to cross into American culture. As a result, very few continental retailers offer these straps, so you might have to look into international sellers to find specific colors and styles. Perlon straps peaked in popularity in the 60’s and 70’s, so they tend to look best on vintage divers.", "Regardless of their original purpose, they work beautifully with all manner of watches, from chronographs to dress watches. Their extreme breathability and durability makes them a summer favorite, and their cheap price makes them easy to invest in – I highly recommend picking up a few of them!", "Retailers:", "Premiering on the 6105 Diver in the early 70’s, the Waffle strap is an iconic Seiko invention. This watch is widely regarded as the single most important diver in the company’s history, and was a common choice for Vietnam servicemen. While the original army-issued watches failed in the humid jungles, the Seiko 6105’s kept ticking long after the end of the war. As veterans returned to the U.S., their watches went with them, and they quickly rose in popularity among civilian circles.", "The characteristic Waffle strap, obviously named for its distinct texture, adorned a majority of these watches, and was loved by many. Numerous small vents ran down the sides of the strap, which greatly increased its breathability. Since it was composed of rubber, it was entirely waterproof and easily cleanable, and also quite flexible to boot. Sadly, most vintage straps are now hardened and brittle, so many enthusiasts have turned to replicas and homages.", "Obviously, the Waffle strap looks best on a vintage Seiko, but that’s a pretty tall order. These watches (and their accompanying straps) are no longer in production, so they are ludicrously overpriced for any non-collector. Even so, comparatively inexpensive 1:1 reproductions have been made by multiple retailers, so if you’re looking for a historic Seiko experience, I highly recommend trying one out.", "Retailers:", "Finally, there are two more rarely seen straps that I will quickly gloss over:", "Retailers:", "This long velcro strap was provided to the Apollo astronauts to wear with their Omega Speedmasters on the outside of their spacesuit.", "Retailers:", "Brad is a full-time student at Temple University in Philadelphia, PA. He is a consistent contributor to numerous fashion communities, and specializes inlong-form composition. Above all else, he is currently stressed out of his mind.\n\nFeel free to contact him onRedditfor suggestions, inspiration, and pleasant conversation!", ""], "word_count": 4180, "content_type": "general", "normalized_url": "https://www.primermagazine.com/2016/spend/a-comprehensive-guide-to-watch-straps", "site_name": "Primer Magazine", "site_domain": "primermagazine.com"}
{"url": "https://www.primermagazine.com/2025/learn/fall-getup-week-what-the-first-cold-morning-calls-for", "title": "Fall Getup Week: What the First Cold Morning Calls For", "author": null, "publish_date": null, "text": "ByAndrew Snavely There’s a moment when it becomes clear that fall is here. I open the door and the different-over-night weather winks like a grandpa and asks me where my jacket is. Soon I remember how comfortable (and easy to style) layers are and it's like Ralphie waking up and it's Christmas season. This is Fall Getup Week. This is the part of the year where clothes stop being things you tolerate and start being things you choose. Layering becomes possible, shoes with some heft return from their seasonal exile, and jackets finish outfits like Bond's bow tie. There’s texture, there’s structure, there's comfort, and for once it feels like the effort has a payoff. If there’s a plot this fall, it revolves around proportion and lost favorites from do-not-wear lists of decades past. Pants with classic, fuller cuts, shirts that have room to layer, tuck, and drape, accessories once phased out. Imagine the British countryside aesthetic colliding with the ‘90s J.Crew catalog. The result: modern, fuller silhouettes catch up to the last decade's grounding in refined minimalism. These clothes make sense together, and not in a way that requires learning a new aesthetic. For many of us, it's one we grew up with, now through our contemporary lens. The jeans and pants drape, shirts offer room for a little lunch, and jackets manage to frame you without making you look like a wedding photo from 1992. Nothing isbaggy, but it all feels a little less precious, everything looks like it belongs to an adult who knows where his keys are. No one here is chasing the new for its own sake. As the fits across menswear have loosened, we're invited to a reunion where lost favorites like pants labeled “classic fit,” chunkier-shaped footwear, braided belts, and yes, the prodigal son cargo pant are given a modern edit: shapes you’ve worn before, now with better company. Sure, you might grumble that you’ve been there, done that, but isn’t that the point? The challenge is finding out how these old shapes fit the current version of you, who, let’s face it, knows a lot more about taste. If autumn had a brand ambassador, it would be Scotland: beautiful scenery, cool air, and weather that asks for layers. This year’s Fall Getup Week was photographed on a road trip starting in Edinburgh and meandering through narrow country roads until we reached the edge of the world in the Isle of Skye. The weather is uncooperative, the ground even less so, andthat’sfall, the kind you actually get, not the one they sell on coffee mugs. We're setting the tone: start with a waxed jacket, a soft flannel in a “shadow plaid” (low contrast and the lines blend instead of punch), straight fit pants in your new favorite color, and boots actually made to wear. There’s a reason people keep buying these. Waxed jackets have been in steady use since the late 1800s.Waxed canvas, for the uninitiated, is cotton that’s been coated in enough wax to repel both rain and unsolicited opinions. It creases, darkens, and looks better for it. They come in hip-length field jackets and shorter trucker style. See ourfull guide on men’s jacket styles.  flint & tinder Flannel-Lined Waxed Hudson Jacket  barbour x J.Crew Beaufort Wax Jacket  belstaff Waxed Trialmaster Jacket Or go for atrucker-style jacket for a shorter, waist-length waxed canvas option. If your idea of flannel involves grunge rock, a paper towel mascot, or beer pong, this is a correction. Vintage brown plaid and enough room between an undershirt for oxygen.  gap Organic Cotton Relaxed Flannel Shirt  buck mason Redlands Plaid Flannel  thursday boot co. Summit Flannel Shirt What the heck is a 5 pocket pant? Well, they're jeans but they're not made out of denim, so not jeans. These? Twill with a flick of stretch. Straight-legged, mid-rise, dignified, easy. Charcoal anchors everything and refuses to clash, no matter how ambitious you get.  amazon Lee Extreme Motion Straight Jean  flint & tinder 365 5-Pocket Pant  gustin 5 Pocket Twill Pant Mud? Fine. Meeting? Also fine.  amazon Chippewa Classic 2.0 Boots  dr. Martens Made in England 1460 Boot  Allen edmonds Made in USA Weatherproof Boots The Bertucci A-2T Vintage: field-tested style that nods to WW2-issue watches, built for today. Explore howmilitary history continues to shape modern fashion. Tying it all together.  amazon Vintage Wash Black Baseball Cap  bertucci A-11t Americana Field Watch  Amazon Essentials Relaxed Pocket Tee  Subscribe to our free newsletter and don't miss an outfit.   Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine.", "paragraphs": ["ByAndrew Snavely", "There’s a moment when it becomes clear that fall is here. I open the door and the different-over-night weather winks like a grandpa and asks me where my jacket is. Soon I remember how comfortable (and easy to style) layers are and it's like Ralphie waking up and it's Christmas season. This is Fall Getup Week.", "This is the part of the year where clothes stop being things you tolerate and start being things you choose. Layering becomes possible, shoes with some heft return from their seasonal exile, and jackets finish outfits like Bond's bow tie. There’s texture, there’s structure, there's comfort, and for once it feels like the effort has a payoff.", "If there’s a plot this fall, it revolves around proportion and lost favorites from do-not-wear lists of decades past. Pants with classic, fuller cuts, shirts that have room to layer, tuck, and drape, accessories once phased out. Imagine the British countryside aesthetic colliding with the ‘90s J.Crew catalog. The result: modern, fuller silhouettes catch up to the last decade's grounding in refined minimalism.", "These clothes make sense together, and not in a way that requires learning a new aesthetic. For many of us, it's one we grew up with, now through our contemporary lens.", "The jeans and pants drape, shirts offer room for a little lunch, and jackets manage to frame you without making you look like a wedding photo from 1992. Nothing isbaggy, but it all feels a little less precious, everything looks like it belongs to an adult who knows where his keys are.", "No one here is chasing the new for its own sake. As the fits across menswear have loosened, we're invited to a reunion where lost favorites like pants labeled “classic fit,” chunkier-shaped footwear, braided belts, and yes, the prodigal son cargo pant are given a modern edit: shapes you’ve worn before, now with better company.", "Sure, you might grumble that you’ve been there, done that, but isn’t that the point? The challenge is finding out how these old shapes fit the current version of you, who, let’s face it, knows a lot more about taste.", "If autumn had a brand ambassador, it would be Scotland: beautiful scenery, cool air, and weather that asks for layers. This year’s Fall Getup Week was photographed on a road trip starting in Edinburgh and meandering through narrow country roads until we reached the edge of the world in the Isle of Skye.", "The weather is uncooperative, the ground even less so, andthat’sfall, the kind you actually get, not the one they sell on coffee mugs.", "We're setting the tone: start with a waxed jacket, a soft flannel in a “shadow plaid” (low contrast and the lines blend instead of punch), straight fit pants in your new favorite color, and boots actually made to wear.", "There’s a reason people keep buying these. Waxed jackets have been in steady use since the late 1800s.Waxed canvas, for the uninitiated, is cotton that’s been coated in enough wax to repel both rain and unsolicited opinions. It creases, darkens, and looks better for it. They come in hip-length field jackets and shorter trucker style. See ourfull guide on men’s jacket styles.", "", "flint & tinder", "Flannel-Lined Waxed Hudson Jacket", "", "barbour x J.Crew", "Beaufort Wax Jacket", "", "belstaff", "Waxed Trialmaster Jacket", "Or go for atrucker-style jacket for a shorter, waist-length waxed canvas option.", "If your idea of flannel involves grunge rock, a paper towel mascot, or beer pong, this is a correction. Vintage brown plaid and enough room between an undershirt for oxygen.", "", "gap", "Organic Cotton Relaxed Flannel Shirt", "", "buck mason", "Redlands Plaid Flannel", "", "thursday boot co.", "Summit Flannel Shirt", "What the heck is a 5 pocket pant? Well, they're jeans but they're not made out of denim, so not jeans. These? Twill with a flick of stretch. Straight-legged, mid-rise, dignified, easy. Charcoal anchors everything and refuses to clash, no matter how ambitious you get.", "", "amazon", "Lee Extreme Motion Straight Jean", "", "flint & tinder", "365 5-Pocket Pant", "", "gustin", "5 Pocket Twill Pant", "Mud? Fine. Meeting? Also fine.", "", "amazon", "Chippewa Classic 2.0 Boots", "", "dr. Martens", "Made in England 1460 Boot", "", "Allen edmonds", "Made in USA Weatherproof Boots", "The Bertucci A-2T Vintage: field-tested style that nods to WW2-issue watches, built for today. Explore howmilitary history continues to shape modern fashion.", "Tying it all together.", "", "amazon", "Vintage Wash Black Baseball Cap", "", "bertucci", "A-11t Americana Field Watch", "", "Amazon Essentials", "Relaxed Pocket Tee", "", "Subscribe to our free newsletter and don't miss an outfit.", "", "", "Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine."], "word_count": 829, "content_type": "general", "normalized_url": "https://www.primermagazine.com/2025/learn/fall-getup-week-what-the-first-cold-morning-calls-for", "site_name": "Primer Magazine", "site_domain": "primermagazine.com"}
{"url": "https://www.primermagazine.com/2016/spend/gray-denim-style-inspiration", "title": "The Essentials: Gray Denim – 6 Complete Outfits That Prove It Will Change Your Wardrobe", "author": null, "publish_date": null, "text": "You would think having less choices would make dressing well easier. It does just the opposite. Most guys just don't have that many options when it comes to pants. Blue denim. Or chinos. Dark blue slim denim is an absolute staple for every guy's wardrobe regardless of his age. But restricting the entire bottom half of your body to just one color means your options are pretty specific. What does that leave you with? At best,jackets,sweaters, and shirts that are not the same color as your jeans. (That means no navy blazers or raw denim jackets.) At worst you'll be stuck in a sartorial cycle that'll leave you feeling like that guy who wears the same pair of light khaki chinos every – single – day. Put another way, it feels like you're being restricted to a uniform. But there's one color of denim that explodes your options like the Big Bang without increasing your “flashy” level. Ilovewearing charcoal gray jeans. I got my first pair probably a year ago and ever since they've become my go-to for occasions where I want to look my best, regardless of howcasual or dressyI need to be. The reason is simple: They ground the outfit in a timeless way like dark blue while giving you a ton of room to play with the other colors in your outfit. If you're like me, you've never been much of a black jeans kind of guy. They used to be relegated to rock musicians and those trying to dress like them, but there's no mistaking, over the last 10 years or so black denim has become commonplace in a wide range ofmen's fashionstyles like monochrome minimalism, street style, west coast bohemian, among others. I havea pair of black jeans. I like them. But they're not nearly as versatile as gray denim. Gray denim can be swapped in anytime you'd wear black,but don't let that confuse you into thinking that gray is just “light black.”Gray pairs equally well with brown footwear as it does black and plays more into the “flat” color palettes that have become more common across the fashion spectrum. As you can see in the 6 outfits I've put together below,gray achieves something other colors simply can't: Near universal, chameleon-like adaptability. Pair it with a cardigan, blazer, and tie? It's dressed up. Pull together Nikes and a scoop neck tee? Perfect streetwear. Denim jacket and Red Wings? Instant rugged Americana without the normal denim-on-denim worries you get with blue jeans. All 6 outfits were made with one  pair of jeans. TheSlim Leroy in medium/dark grayfrom Mott & Bow on me, and on Shane theskinnyversion (also available in straight fit).  New to Mott & Bow? They're not new to premium denim, with 32 years of working in the industry and using only the best fabrics from the world's top mills, they're changing the way we buy jeans with theirfree HomeTry-on Program. Take a look at these Getups and in the comments tell me which 3 you like the best! Jeans:Mott & Bow Horatio, $128Blazer: Similar –Goodthreads, $27.62 – $82.83/ Shirt:Goodthreads, $8.27 – $25/ Wingtip Dress Boots:DSW, $104.98 Jeans:Mott & Bow Horatio, $128Denim Jacket:Levi's, $29.84 – $99.99/ Pocket T:Gap, $19.95/ Boots:Red Wing Moc Toe: $290 Gray Jeans:Mott & Bow Leroy, $128M-59 Jacket:Alpha Industries, $180/ Shirt:Amazon, $12.50/ Sneakers: Similar –Nike, $85 Gray Jeans:Mott & Bow Leroy, $128Linen Bomber Jacket:Amazon, $49.90/ Henley:Goodthreads, $6.37/ Boots: Similar –Clarks, $52.97 Gray Denim:Mott & Bow Horatio, $128Shawl Collar Cardigan: Similar –L.L. Bean, $109/ Dobby Shirt:Everlane $62/ Boots:Red Wing Iron Ranger, $240/ Watch:Nixon, $95 Gray Denim:Mott & Bow Leroy, $128Blazer: Similar –J.Crew, $248/ Merino Wool Cardigan:Uniqlo, $49.90/ Oxford Shirt:Goodthreads, $25/ Tie:J.Crew, $59.50/ Waterproof Wingtips:Cole Haan, $79.07 Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine. ", "paragraphs": ["You would think having less choices would make dressing well easier.", "It does just the opposite.", "Most guys just don't have that many options when it comes to pants. Blue denim. Or chinos. Dark blue slim denim is an absolute staple for every guy's wardrobe regardless of his age. But restricting the entire bottom half of your body to just one color means your options are pretty specific.", "What does that leave you with?", "At best,jackets,sweaters, and shirts that are not the same color as your jeans. (That means no navy blazers or raw denim jackets.) At worst you'll be stuck in a sartorial cycle that'll leave you feeling like that guy who wears the same pair of light khaki chinos every – single – day.", "Put another way, it feels like you're being restricted to a uniform.", "But there's one color of denim that explodes your options like the Big Bang without increasing your “flashy” level.", "Ilovewearing charcoal gray jeans. I got my first pair probably a year ago and ever since they've become my go-to for occasions where I want to look my best, regardless of howcasual or dressyI need to be. The reason is simple: They ground the outfit in a timeless way like dark blue while giving you a ton of room to play with the other colors in your outfit.", "If you're like me, you've never been much of a black jeans kind of guy. They used to be relegated to rock musicians and those trying to dress like them, but there's no mistaking, over the last 10 years or so black denim has become commonplace in a wide range ofmen's fashionstyles like monochrome minimalism, street style, west coast bohemian, among others. I havea pair of black jeans. I like them. But they're not nearly as versatile as gray denim.", "Gray denim can be swapped in anytime you'd wear black,but don't let that confuse you into thinking that gray is just “light black.”Gray pairs equally well with brown footwear as it does black and plays more into the “flat” color palettes that have become more common across the fashion spectrum.", "As you can see in the 6 outfits I've put together below,gray achieves something other colors simply can't: Near universal, chameleon-like adaptability. Pair it with a cardigan, blazer, and tie? It's dressed up. Pull together Nikes and a scoop neck tee? Perfect streetwear. Denim jacket and Red Wings? Instant rugged Americana without the normal denim-on-denim worries you get with blue jeans.", "All 6 outfits were made with one  pair of jeans. TheSlim Leroy in medium/dark grayfrom Mott & Bow on me, and on Shane theskinnyversion (also available in straight fit).  New to Mott & Bow? They're not new to premium denim, with 32 years of working in the industry and using only the best fabrics from the world's top mills, they're changing the way we buy jeans with theirfree HomeTry-on Program.", "Take a look at these Getups and in the comments tell me which 3 you like the best!", "Jeans:Mott & Bow Horatio, $128Blazer: Similar –Goodthreads, $27.62 – $82.83/ Shirt:Goodthreads, $8.27 – $25/ Wingtip Dress Boots:DSW, $104.98", "Jeans:Mott & Bow Horatio, $128Denim Jacket:Levi's, $29.84 – $99.99/ Pocket T:Gap, $19.95/ Boots:Red Wing Moc Toe: $290", "Gray Jeans:Mott & Bow Leroy, $128M-59 Jacket:Alpha Industries, $180/ Shirt:Amazon, $12.50/ Sneakers: Similar –Nike, $85", "Gray Jeans:Mott & Bow Leroy, $128Linen Bomber Jacket:Amazon, $49.90/ Henley:Goodthreads, $6.37/ Boots: Similar –Clarks, $52.97", "Gray Denim:Mott & Bow Horatio, $128Shawl Collar Cardigan: Similar –L.L. Bean, $109/ Dobby Shirt:Everlane $62/ Boots:Red Wing Iron Ranger, $240/ Watch:Nixon, $95", "Gray Denim:Mott & Bow Leroy, $128Blazer: Similar –J.Crew, $248/ Merino Wool Cardigan:Uniqlo, $49.90/ Oxford Shirt:Goodthreads, $25/ Tie:J.Crew, $59.50/ Waterproof Wingtips:Cole Haan, $79.07", "Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine.", ""], "word_count": 695, "content_type": "general", "normalized_url": "https://www.primermagazine.com/2016/spend/gray-denim-style-inspiration", "site_name": "Primer Magazine", "site_domain": "primermagazine.com"}
{"url": "https://www.primermagazine.com/2025/spend/fall-getup-week-the-creative-office", "title": "Fall Getup Week: The Creative Office", "author": null, "publish_date": null, "text": "ByAndrew Snavely Put together, the entire outfit is a study in adjustment. Shapes are looser, textures speak up, and accessories once deemed outdated now feel current. It’s not aiming to recreate a past era or reject it entirely. It’s doing something harder: integrating what worked then with what feels right now. If you swapped these pants for slims, strapped on a dive watch, and finished it off with a pair of wingtip boots, you'd have the kind of outfit that populated most of 2015. It would look good. Tasteful, even. But it wouldn’t look like this. This looks like something else entirely. They are the fullest cut we’ve likely ever featured. Straight through the leg, higher rise (where the pants sit on your waist), and breaking just slightly at the top of the shoe. There’s been a shift. Aninevitable cultural pushtoward ease through the leg. These trousers move. They pool a little. They’re a change. But because they’re brown twill, they don’t shout about it. The overall shape lands firmly in the 90s J.Crew fit philosophy: drape over definition, flow over restriction. The proportions that 30 years ago defined a whole catalog generation have found their way forward again. There’s a small adjustment period with fuller trousers, usually around the moment you catch your reflection and wonder if you’re swimming in them. You’re not. That’s just your eyes recalibrating. Most modern slimmer pants are tight enough to leave impressions on your kneecaps by lunch. These don’t do that. These ask for shoes that can hold their own, which is why they’re paired with a chunkier style like these Clarks Wallabees.  uniqlo Wide Fit Chino Pants  J.Crew Classic Fit Chinos  buck mason Herringbone Twill Full Saddle Pant Then there's the braided belt. Yes, that braided belt. The one that got pushed into clearance bins around 2004 and stayed there. Once fuller cuts, higher rises, and relaxed silhouettes started reappearing, the reemergence of the braid was less a revival and more a natural consequence. When the foundations change, the accessories that once made sense with them start making sense again. The braided belt traces its roots to early 20th-century European leatherwork. Before stretch fabrics and elastic waistbands, the braid allowed micro-adjustment. By the 60s and 70s, it crossed into American prep wardrobes. By the 90s, it was a business casual staple, worn with chinos and loafers, a touch of texture at the waist. Then came the fall. But with today's transition to relaxed cuts, it's reappeared, often worn a little long, a little tail of leather swinging at the side. From west coast Buck Mason to Drake's of London, the hang-down braid is back:  amazon Eddie Bauer Braided Leather Belt  j.crew Braided Leather Belt with Brass Buckle  buck mason Braided Leather Campus Belt Clarks Wallabees– Readour full article Wallabeesare a design oddity that became a cultural mainstay. Introduced by Clarks Originals in the 1960s and based loosely on a German moccasin called the “Grashopper,” the Wallabee was built on a natural crepe sole and featured a clean, stitched moc toe. Ivy Leaguers were early adopters. British mods picked it up next. By the 1970s, Jamaican rude boys and reggae artists made it their own. Then in the 1990s, American hip-hop artists gave it a new layer of cool. By the time they were worn under khakis in the late 80s and early 90s, they already had decades of credibility stitched into the seams. What made them stick wasn’t nostalgia. Wallabees look equally at home under denim, chinos, or trousers like these. The suede texture here plays well with the ribbed cardigan and slubby linen shirt, creating what stylists sometimes call “tactile symmetry”: all soft surfaces with enough visual interest to hold attention without shine or flash. Opting for a lower profile, finer cardigan can lean into an even more modern, 90s-influenced look. Readour complete guide on sweater styles. Above the belt, we have a charcoal cardigan. Ribbed, soft, and shaped enough to pass as outerwear. Sweaters like this have emerged as “modern outerwear” – the cardigan as jacket, the knit as silhouette-maker. It could be chunky like this one, or slim and non-chunky like a traditional soft thin cardigan. The shape is key here. It falls straight. It recalls the clean, American proportions that J.Crew emphasized in the early 90s, when drape and vertical drop mattered more than trimness.  LLBean Classic Ragg Wool Shawl Collar Cardigan  j.crew Merino Wool-blend Cardigan  uniqlo Lambswool Cardigan Beneath the cardigan sits the most seasonally subversive item in the entire look: a linen shirt. Linen is breathable, yes, but it’s also thermoregulating. Paired with wool or cotton knits, it actually insulates. This is shoulder-season dressing: the not-quite-warm, not-yet-cold window where heavy fabrics feel like a trap, and lighter ones can shine. From a styling standpoint, the shirt adds a wrinkle in the best way. The slub texture contrasts against the smooth rib of the cardigan and the dense twill pant. It’s a breathing fabric. And breathability isn’t seasonal. → Read more:Why some linen sucks  amazon Wills Linen Shirt  Banana Republic Standard Fit Textured Stripe Linen Shirt  suit supply Sand Linen Shirt Finally, the watch. A gold square-face that feels like it was smuggled out of a desk drawer in 1952. Square watches peaked in the 1940s through the 60s, when wristwear meant precision and pride. Now, it offers something distinctly different from our normal chronographs, divers, and field watches and takes on a jewelry-like role. → Read more:How I finally figured out how to wear jewelry  fossil Carraway Quartz Rectangular Watch  Citizen Citizen Rectangle Quartz Watch  timex Timex Automatic 1983 Reissue  Subscribe to our free newsletter and don't miss an outfit.   Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine.", "paragraphs": ["ByAndrew Snavely", "Put together, the entire outfit is a study in adjustment. Shapes are looser, textures speak up, and accessories once deemed outdated now feel current. It’s not aiming to recreate a past era or reject it entirely. It’s doing something harder: integrating what worked then with what feels right now.", "If you swapped these pants for slims, strapped on a dive watch, and finished it off with a pair of wingtip boots, you'd have the kind of outfit that populated most of 2015. It would look good. Tasteful, even. But it wouldn’t look like this. This looks like something else entirely.", "They are the fullest cut we’ve likely ever featured. Straight through the leg, higher rise (where the pants sit on your waist), and breaking just slightly at the top of the shoe.", "There’s been a shift. Aninevitable cultural pushtoward ease through the leg. These trousers move. They pool a little. They’re a change. But because they’re brown twill, they don’t shout about it. The overall shape lands firmly in the 90s J.Crew fit philosophy: drape over definition, flow over restriction. The proportions that 30 years ago defined a whole catalog generation have found their way forward again.", "There’s a small adjustment period with fuller trousers, usually around the moment you catch your reflection and wonder if you’re swimming in them. You’re not. That’s just your eyes recalibrating. Most modern slimmer pants are tight enough to leave impressions on your kneecaps by lunch. These don’t do that. These ask for shoes that can hold their own, which is why they’re paired with a chunkier style like these Clarks Wallabees.", "", "uniqlo", "Wide Fit Chino Pants", "", "J.Crew", "Classic Fit Chinos", "", "buck mason", "Herringbone Twill Full Saddle Pant", "Then there's the braided belt. Yes, that braided belt. The one that got pushed into clearance bins around 2004 and stayed there. Once fuller cuts, higher rises, and relaxed silhouettes started reappearing, the reemergence of the braid was less a revival and more a natural consequence. When the foundations change, the accessories that once made sense with them start making sense again.", "The braided belt traces its roots to early 20th-century European leatherwork. Before stretch fabrics and elastic waistbands, the braid allowed micro-adjustment. By the 60s and 70s, it crossed into American prep wardrobes. By the 90s, it was a business casual staple, worn with chinos and loafers, a touch of texture at the waist. Then came the fall. But with today's transition to relaxed cuts, it's reappeared, often worn a little long, a little tail of leather swinging at the side. From west coast Buck Mason to Drake's of London, the hang-down braid is back:", "", "amazon", "Eddie Bauer Braided Leather Belt", "", "j.crew", "Braided Leather Belt with Brass Buckle", "", "buck mason", "Braided Leather Campus Belt", "Clarks Wallabees– Readour full article", "Wallabeesare a design oddity that became a cultural mainstay. Introduced by Clarks Originals in the 1960s and based loosely on a German moccasin called the “Grashopper,” the Wallabee was built on a natural crepe sole and featured a clean, stitched moc toe. Ivy Leaguers were early adopters. British mods picked it up next. By the 1970s, Jamaican rude boys and reggae artists made it their own. Then in the 1990s, American hip-hop artists gave it a new layer of cool. By the time they were worn under khakis in the late 80s and early 90s, they already had decades of credibility stitched into the seams.", "What made them stick wasn’t nostalgia. Wallabees look equally at home under denim, chinos, or trousers like these. The suede texture here plays well with the ribbed cardigan and slubby linen shirt, creating what stylists sometimes call “tactile symmetry”: all soft surfaces with enough visual interest to hold attention without shine or flash.", "Opting for a lower profile, finer cardigan can lean into an even more modern, 90s-influenced look. Readour complete guide on sweater styles.", "Above the belt, we have a charcoal cardigan. Ribbed, soft, and shaped enough to pass as outerwear. Sweaters like this have emerged as “modern outerwear” – the cardigan as jacket, the knit as silhouette-maker. It could be chunky like this one, or slim and non-chunky like a traditional soft thin cardigan. The shape is key here. It falls straight. It recalls the clean, American proportions that J.Crew emphasized in the early 90s, when drape and vertical drop mattered more than trimness.", "", "LLBean", "Classic Ragg Wool Shawl Collar Cardigan", "", "j.crew", "Merino Wool-blend Cardigan", "", "uniqlo", "Lambswool Cardigan", "Beneath the cardigan sits the most seasonally subversive item in the entire look: a linen shirt. Linen is breathable, yes, but it’s also thermoregulating. Paired with wool or cotton knits, it actually insulates. This is shoulder-season dressing: the not-quite-warm, not-yet-cold window where heavy fabrics feel like a trap, and lighter ones can shine.", "From a styling standpoint, the shirt adds a wrinkle in the best way. The slub texture contrasts against the smooth rib of the cardigan and the dense twill pant. It’s a breathing fabric. And breathability isn’t seasonal.", "→ Read more:Why some linen sucks", "", "amazon", "Wills Linen Shirt", "", "Banana Republic", "Standard Fit Textured Stripe Linen Shirt", "", "suit supply", "Sand Linen Shirt", "Finally, the watch. A gold square-face that feels like it was smuggled out of a desk drawer in 1952. Square watches peaked in the 1940s through the 60s, when wristwear meant precision and pride. Now, it offers something distinctly different from our normal chronographs, divers, and field watches and takes on a jewelry-like role.", "→ Read more:How I finally figured out how to wear jewelry", "", "fossil", "Carraway Quartz Rectangular Watch", "", "Citizen", "Citizen Rectangle Quartz Watch", "", "timex", "Timex Automatic 1983 Reissue", "", "Subscribe to our free newsletter and don't miss an outfit.", "", "", "Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine."], "word_count": 1026, "content_type": "general", "normalized_url": "https://www.primermagazine.com/2025/spend/fall-getup-week-the-creative-office", "site_name": "Primer Magazine", "site_domain": "primermagazine.com"}
{"url": "https://www.primermagazine.com/2025/learn/mens-jewelry-guide", "title": "How I Finally Figured Out How to Wear Jewelry", "author": null, "publish_date": null, "text": "ByAndrew Snavely In music, “swing” is what happens when musicians keep the tempo steady but loosen their grip on precision. The beat stays locked, but the notes lean, a fraction early, a fraction late, skipping a down beat to land a note on the up beat and suddenly the rhythm feels alive. It’s when a good musician prioritizes the ‘feel’ over strict metronome-like tempo. You’ve experienced this before: some background music catches your ear and before you realize it you’re nodding your head with scrunched eyebrows because it *feels* good. Beginner musicians cling to the count, terrified of slipping. Good players know exactly where the beat is, then relax and bend it for feel. That’s the groove. Style works the same way. Clothes are the tempo. A white oxford, gray trousers, or a navy jacket are dependable, even, on time. Jewelry adds the swing. It shifts the feel. A ring that flashes when you raise a glass, a chain that moves when you laugh. Slightly off, slightly unexpected, it turns the outfit from strict timekeeping into rhythm. For years, anything beyond a watch felt like a costume. If I tried on more than that, I imagined I looked like I was sneaking off to Pirates of the Caribbean auditions. Like someone would point me out and say, “Look at this guy, wearing a SILVER BRACELET.” Then Brad Pitt ruined everything. I was sitting in the movie theater with a buddy who suggested we blow off work that afternoon to see F1 on opening day. Immediately I was drawn to the classic and simple costume choices for Pitt's Sonny Hayes character. Faded sweatshirts, open shirts, suede jackets, light jeans, all from a 60s and 70s slant that land as refined masculine but not flashy. But almost immediately in noticing the clothing, I couldn’t help focusing on the jewelry. From basically the first frame of the movie, Pitt’s character is wearing it. And not like apieceof jewelry. He's wearing alotof jewelry. A bunch of rings. At least two bracelets. A chain. Maybe three. His clothing items were simple, minimalist, rugged, worn. But the jewelry feltearlierthan all of it, layered chains and bracelets and rings that read less like ball gown adornment and more like tattoos. That was the part that caught me. Jewelry wasn’t decoration, it was what gave the whole thing its swing. And suddenly I wanted that. Not *those* rings specifically. Not a Sonny Hayes costume. Just that sense of ease. There’s baggage. Jewelry, for a lot of men, brings up a flood of doubts: Is this too much? Too feminine? Too Vegas? But men have always wornsomejewelry. Rings, chains, medals, cufflinks, class rings, ID bracelets; it was part of the uniform. The suspicion toward adornment grew out of the Depression and World War II, when utility took priority and middle-class men pared back to the essentials. That leaner look hardened into habit, and by the early 2000s minimalism made anything beyond a watch feel suspect. Even then, jewelry never disappeared. Plenty of regular guys wore it without a second thought. My father has approached his appearance with a practical, Primer-like philosophy. In the ’70s he wore his class ring daily, keeping it on for decades. That was common. F1's costume designer, Julian Day, echos this when describing the creativedirection to WWD, “The people in the movies in the ’70s had an edge, they weren’t as clean cut as people [are today],”…“So I looked at people like Kris Kristofferson, Steve McQueen, Paul Newman, [Clint] Eastwood.” Much of the jewelry was reportedly Pitt's own collection, brought to set, and selected by him when shooting.  So the hesitation now isn’ttimeless, it’s modern. And it isn’t about jewelry. It’s about being caught trying. The clothes keep the beat. The jewelry alters it. Which is exactly why it feels dangerous, the way a beginner drummer panics about hitting the wrong thing and ruining the song for everyone.  It adds texture. A gray tee, navy chino, white sneaker outfit is oatmeal. Jewelry is the salt and butter. It also makes you consistent. If someone always wears the same necklace, it stops being “jewelry” and starts beingthem. Minimalists should be pleased: it’s the easiest way to add dimension without expanding your closet. You don’t need a whole new wardrobe. Just a chain. My curiosity about jewelry started well before Pitt and Apple triple-downed on Formula One. Primer style contributorDaniel Barakahad been including rings, bracelets, and necklaces in his outfits for years. I looked on the way my dog Leela approaches water, fascinated, tail wagging, ready to leap, then recoiling the instant the tide reaches her paws.  Daniel once told me: “For a guy just getting into jewelry, I’d start with a watch. The second thing would probably be a bracelet, since it feels more personal than a ring and has that sense of being a gift. Another easy option is a simple necklace, something in gold, a light chain, maybe with an interesting design that isn’t too complicated. You can tuck it under your shirt, or if you’re wearing a shirt unbuttoned it frames your face and keeps your neckline interesting. Those are the easiest entry points, and from there you can pile on bracelets as you get more adventurous and eventually venture into rings, even across all four fingers.” What stuck with me was the part about jewelry just… showing up. Not announcing itself. Not jingling around like a cat collar. Start with one thing. A watch, a ring, a leather bracelet, a chain you can hide under your shirt. ↓ Pendant Necklaces Keep pendants small and subtle. Simple shapes in silver or gold; large or ornate pendants almost always look like costume jewelry. Pendants can also be layered with other pendants or with plain chains. When layering, vary the lengths so they fall at slightly different levels.  miansai Mini Dove Pendant Necklace  amazon Made by Nami Surfer Necklace  STAG Provisions All Seeing Eye Pendant  amazon Miansai Silver Pendant Necklace Materials make a difference: Avoid skulls unless you’ve killed someone with your bare hands. Minimal slogans or logos. Stick to clean shapes that look like you inherited them. ↓ Box Chain Bracelets Box chains can run from very inexpensive to special gift territory. If you are new, start with a cheaper one. I received a nicer one as a birthday present, and it means more when I wear it because of that. They work well on their own, stacked with other bracelets, or next to a watch.  david yurman Sterling Silver Box Chain Bracelet  amazon Stackable Gold Plated Box Chain & Cuff  amazon Miabella 925 Sterling Silver Box Chain Bracelet  mejuri Titanium Round Box Chain Bracelet Layering jewelry is not about symmetry. If you’re arranging yourself like a geometry problem, you’ve lost already. Think rhythm instead. Cooking instead of baking. Little improvisations that make sense to your eye but not necessarily to a blueprint. Pieces don’t have to match. A gold necklace with a silver ring is fine, as long as they both feel natural on you. Smaller, delicate things disappear individually, but when combined, they build on each other. The trick is to let one part take the lead. If your wrist is stacked with bracelets, the neck and fingers play background. If you’re heavy on the rings, the wrist takes a nap. You give the whole thing some air so it doesn’t feel like Mr. T rifled through your sock drawer. ↓ Signet Rings Simple, weighty, and meant to look like it’s always been there.  miansai Square Step Signet Ring  amazon Forge & Foundry Stainless Steel Signet Ring  studebaker metals Otto Signet Ring  salty dagger Chaos Theory Signet Ring Don't bail on jewelry after a week. At first you'll keep staring at it, fiddling, wondering if the whole world is staring back. That’s the moment you need to keep going. Wear the bracelet until you forget it’s there. Let the chain flash at the edge of your collar. Wear the ring until you stop playing with it when you’re bored in a meeting.  ↓ Fabric & Beaded Bracelets You can find colorful bracelets cheap in multipacks, but the goal is to eventually pick up a unique one on a trip and swap it in. They can be multicolor for a traveled look or subdued for something quieter. If you go beaded, stay on the smaller side. Too large and it shifts from subtle accent to oversized statement, especially when you are starting out.  amazon Made by Nami 2 Pack Surfer Bracelet  amazon Mezcla Vida Handemade Bracelet 3 Pack  forge & Foundry Black Braided Leather Bracelet  fossil Tigers Eye Bracelet Three to five pieces that stick with you. A watch, a chain, maybe a couple rings. Not rented, not borrowed, not “for the outfit.” They should feel like yours, the way your favorite mug or your worn-out sneakers feel like yours. Like Daniel said, they come with time: one gifted, one picked up on a trip, one bought after staring at Brad Pitt for too long. Eventually they’re not “accessories,” they’re just what you wear. Like a drummer leaning back on the beat, those few pieces shift the whole rhythm of your wardrobe, adding a personal perspective to your style without changing the clothes themselves. The real goal is that nobody notices your jewelry first. They notice you look good. Then, as the conversation goes on, maybe they spot the chain, the ring, the bracelet. That’s when it works. Because jewelry in this way doesn’t add flash. It just needs to add that little skip in the beat, that human rhythm that keeps the outfit alive. And the day you forget to wear it, you’ll feel a fraction off, like a drummer trying to play straight without swing.   What Dressing Intentionally Actually Means  Live Action Getup: Golden Hour Linen  The Late Summer Weekend Uniform That Works Inside and Out  How to Nail Rugged Fall Style in 3 Moves & 3 Outfits  Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine.", "paragraphs": ["ByAndrew Snavely", "In music, “swing” is what happens when musicians keep the tempo steady but loosen their grip on precision. The beat stays locked, but the notes lean, a fraction early, a fraction late, skipping a down beat to land a note on the up beat and suddenly the rhythm feels alive. It’s when a good musician prioritizes the ‘feel’ over strict metronome-like tempo.", "You’ve experienced this before: some background music catches your ear and before you realize it you’re nodding your head with scrunched eyebrows because it *feels* good. Beginner musicians cling to the count, terrified of slipping. Good players know exactly where the beat is, then relax and bend it for feel. That’s the groove.", "Style works the same way.", "Clothes are the tempo. A white oxford, gray trousers, or a navy jacket are dependable, even, on time. Jewelry adds the swing. It shifts the feel. A ring that flashes when you raise a glass, a chain that moves when you laugh. Slightly off, slightly unexpected, it turns the outfit from strict timekeeping into rhythm.", "For years, anything beyond a watch felt like a costume. If I tried on more than that, I imagined I looked like I was sneaking off to Pirates of the Caribbean auditions. Like someone would point me out and say, “Look at this guy, wearing a SILVER BRACELET.”", "Then Brad Pitt ruined everything.", "I was sitting in the movie theater with a buddy who suggested we blow off work that afternoon to see F1 on opening day. Immediately I was drawn to the classic and simple costume choices for Pitt's Sonny Hayes character. Faded sweatshirts, open shirts, suede jackets, light jeans, all from a 60s and 70s slant that land as refined masculine but not flashy.", "But almost immediately in noticing the clothing, I couldn’t help focusing on the jewelry. From basically the first frame of the movie, Pitt’s character is wearing it. And not like apieceof jewelry. He's wearing alotof jewelry. A bunch of rings. At least two bracelets. A chain. Maybe three.", "His clothing items were simple, minimalist, rugged, worn. But the jewelry feltearlierthan all of it, layered chains and bracelets and rings that read less like ball gown adornment and more like tattoos. That was the part that caught me. Jewelry wasn’t decoration, it was what gave the whole thing its swing.", "And suddenly I wanted that. Not *those* rings specifically. Not a Sonny Hayes costume. Just that sense of ease.", "There’s baggage. Jewelry, for a lot of men, brings up a flood of doubts: Is this too much? Too feminine? Too Vegas?", "But men have always wornsomejewelry. Rings, chains, medals, cufflinks, class rings, ID bracelets; it was part of the uniform. The suspicion toward adornment grew out of the Depression and World War II, when utility took priority and middle-class men pared back to the essentials. That leaner look hardened into habit, and by the early 2000s minimalism made anything beyond a watch feel suspect.", "Even then, jewelry never disappeared. Plenty of regular guys wore it without a second thought. My father has approached his appearance with a practical, Primer-like philosophy. In the ’70s he wore his class ring daily, keeping it on for decades. That was common.", "F1's costume designer, Julian Day, echos this when describing the creativedirection to WWD, “The people in the movies in the ’70s had an edge, they weren’t as clean cut as people [are today],”…“So I looked at people like Kris Kristofferson, Steve McQueen, Paul Newman, [Clint] Eastwood.” Much of the jewelry was reportedly Pitt's own collection, brought to set, and selected by him when shooting.", "", "So the hesitation now isn’ttimeless, it’s modern. And it isn’t about jewelry. It’s about being caught trying. The clothes keep the beat. The jewelry alters it. Which is exactly why it feels dangerous, the way a beginner drummer panics about hitting the wrong thing and ruining the song for everyone.", "", "It adds texture. A gray tee, navy chino, white sneaker outfit is oatmeal. Jewelry is the salt and butter. It also makes you consistent. If someone always wears the same necklace, it stops being “jewelry” and starts beingthem.", "Minimalists should be pleased: it’s the easiest way to add dimension without expanding your closet. You don’t need a whole new wardrobe. Just a chain.", "My curiosity about jewelry started well before Pitt and Apple triple-downed on Formula One. Primer style contributorDaniel Barakahad been including rings, bracelets, and necklaces in his outfits for years. I looked on the way my dog Leela approaches water, fascinated, tail wagging, ready to leap, then recoiling the instant the tide reaches her paws.", "", "Daniel once told me:", "“For a guy just getting into jewelry, I’d start with a watch. The second thing would probably be a bracelet, since it feels more personal than a ring and has that sense of being a gift. Another easy option is a simple necklace, something in gold, a light chain, maybe with an interesting design that isn’t too complicated. You can tuck it under your shirt, or if you’re wearing a shirt unbuttoned it frames your face and keeps your neckline interesting. Those are the easiest entry points, and from there you can pile on bracelets as you get more adventurous and eventually venture into rings, even across all four fingers.”", "What stuck with me was the part about jewelry just… showing up. Not announcing itself. Not jingling around like a cat collar.", "Start with one thing. A watch, a ring, a leather bracelet, a chain you can hide under your shirt.", "↓ Pendant Necklaces", "Keep pendants small and subtle. Simple shapes in silver or gold; large or ornate pendants almost always look like costume jewelry. Pendants can also be layered with other pendants or with plain chains. When layering, vary the lengths so they fall at slightly different levels.", "", "miansai", "Mini Dove Pendant Necklace", "", "amazon", "Made by Nami Surfer Necklace", "", "STAG Provisions", "All Seeing Eye Pendant", "", "amazon", "Miansai Silver Pendant Necklace", "Materials make a difference:", "Avoid skulls unless you’ve killed someone with your bare hands. Minimal slogans or logos. Stick to clean shapes that look like you inherited them.", "↓ Box Chain Bracelets", "Box chains can run from very inexpensive to special gift territory. If you are new, start with a cheaper one. I received a nicer one as a birthday present, and it means more when I wear it because of that. They work well on their own, stacked with other bracelets, or next to a watch.", "", "david yurman", "Sterling Silver Box Chain Bracelet", "", "amazon", "Stackable Gold Plated Box Chain & Cuff", "", "amazon", "Miabella 925 Sterling Silver Box Chain Bracelet", "", "mejuri", "Titanium Round Box Chain Bracelet", "Layering jewelry is not about symmetry. If you’re arranging yourself like a geometry problem, you’ve lost already. Think rhythm instead. Cooking instead of baking. Little improvisations that make sense to your eye but not necessarily to a blueprint.", "Pieces don’t have to match. A gold necklace with a silver ring is fine, as long as they both feel natural on you. Smaller, delicate things disappear individually, but when combined, they build on each other.", "The trick is to let one part take the lead. If your wrist is stacked with bracelets, the neck and fingers play background. If you’re heavy on the rings, the wrist takes a nap. You give the whole thing some air so it doesn’t feel like Mr. T rifled through your sock drawer.", "↓ Signet Rings", "Simple, weighty, and meant to look like it’s always been there.", "", "miansai", "Square Step Signet Ring", "", "amazon", "Forge & Foundry Stainless Steel Signet Ring", "", "studebaker metals", "Otto Signet Ring", "", "salty dagger", "Chaos Theory Signet Ring", "Don't bail on jewelry after a week. At first you'll keep staring at it, fiddling, wondering if the whole world is staring back. That’s the moment you need to keep going. Wear the bracelet until you forget it’s there. Let the chain flash at the edge of your collar. Wear the ring until you stop playing with it when you’re bored in a meeting.", "", "↓ Fabric & Beaded Bracelets", "You can find colorful bracelets cheap in multipacks, but the goal is to eventually pick up a unique one on a trip and swap it in. They can be multicolor for a traveled look or subdued for something quieter. If you go beaded, stay on the smaller side. Too large and it shifts from subtle accent to oversized statement, especially when you are starting out.", "", "amazon", "Made by Nami 2 Pack Surfer Bracelet", "", "amazon", "Mezcla Vida Handemade Bracelet 3 Pack", "", "forge & Foundry", "Black Braided Leather Bracelet", "", "fossil", "Tigers Eye Bracelet", "Three to five pieces that stick with you. A watch, a chain, maybe a couple rings. Not rented, not borrowed, not “for the outfit.” They should feel like yours, the way your favorite mug or your worn-out sneakers feel like yours.", "Like Daniel said, they come with time: one gifted, one picked up on a trip, one bought after staring at Brad Pitt for too long. Eventually they’re not “accessories,” they’re just what you wear. Like a drummer leaning back on the beat, those few pieces shift the whole rhythm of your wardrobe, adding a personal perspective to your style without changing the clothes themselves.", "The real goal is that nobody notices your jewelry first. They notice you look good. Then, as the conversation goes on, maybe they spot the chain, the ring, the bracelet. That’s when it works.", "Because jewelry in this way doesn’t add flash. It just needs to add that little skip in the beat, that human rhythm that keeps the outfit alive. And the day you forget to wear it, you’ll feel a fraction off, like a drummer trying to play straight without swing.", "", "", "What Dressing Intentionally Actually Means", "", "Live Action Getup: Golden Hour Linen", "", "The Late Summer Weekend Uniform That Works Inside and Out", "", "How to Nail Rugged Fall Style in 3 Moves & 3 Outfits", "", "Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine."], "word_count": 1739, "content_type": "general", "normalized_url": "https://www.primermagazine.com/2025/learn/mens-jewelry-guide", "site_name": "Primer Magazine", "site_domain": "primermagazine.com"}
{"url": "https://www.primermagazine.com/2019/spend/best-weekend-bags-under-150", "title": "The Best Weekend Bags Under $150 – Update with Video!", "author": null, "publish_date": null, "text": " Pick up a lightweight, affordable weekender for your next trip out of town. Words & Photos by Andrew Snavely Once upon a time, you could stuff a few days’ worth of essentials into a backpack and be done packing.Well, not anymore. Now you’ve got good shoes, and collared shirts, and other items that deserve better than being crammed into a book bag. Not to mention, the same bag that saw you through college probably won’t cut it on a business trip. But rather than reaching for an unwieldy suitcase, consider a third option: a ruggedly handsome weekend bag. Often made from leather or heavy-duty canvas, these overnight bags are usually more structured than a duffel bag, but more stylish than the average hard-shell case. Plus the lack of wheels and slight “squishability” (technical term used by expert travelers) means they fit easily in an overhead compartment, trunk, back seat, and so on. When choosing an overnight bag, look for one with plenty of compartments — keeping your devices and toiletries separate from your clothing makes it easier to pack, unpack, and find things when you’re halfway through your trip. Premium weekender bags can cost upwards of several hundred dollars. But we’ve rounded up a bunch of durable, versatile, and functional overnight bags that are affordable, so you can spend more money on experience rather than your luggage. Updated June 2019 Watch our video guide, or scroll on to read our picks!  Click here to subscribe toPrimer on Youtube! Amazon, $9825 x 11 x 10 in A hidden gem popular among style forums, this goatskin duffel comes looking like it’s seen some adventures right out of the box. The leather is naturally spotted, marked, and wrinkled giving it a distressed or vintage feel. It has 2 end pockets and 2 front pockets, and the inside has a durable canvas lining. A few comments on Amazon complained of a strong smell but I didn't have that experience at all. If you want a leather duffel but don't want to drop a lot of money, it's tough to beat this bag. ⤋ Amazon, $5521.7 x 14.8 x 10.2 in This classic and handsome weekender is made of canvas and buttery-soft oiled leather. That, and with it's nicely finished interior, make this bag seem like it should cost 4 times as much. Two outside zipper pockets stow small gadgets at a finger's reach and the inside has 2 zip pockets as well as 2 open top pockets. The bottom is canvas, but protected by metal feet. This bag design is available from a few brand names, likely being a white-labeled product. ⤋ Amazon, $13523 x 12 x 12 in If you're looking for a leather weekender of decent quality for less than the cost of a night in a hotel room, you're looking at it. Leather bags are virtually unavailable for less than a couple hundred dollars. Because of its more structured form it's also the largest bag on the list, that may be good or bad depending on what you're looking for. It features compartments on each end with travel pockets, and two zippered pockets on each of the long sides. The leather is soft and thick, and the inside is lined with black. The shoulder strap is also leather, which is a nice touch, though the back of it is canvas. ⤋ Everlane, $85(Updated version)14.2 x 7.3 x 19.5 in Everlane practically invented the trendy concept among online retailers of “radical transparency” and cutting out the middlemen markup of traditional luxury goods. Their rise to millennial fandom began with their clean and minimalist-designed twill weekender. The simple shape and lack of adornment gives the bag a designer look for less than C-note. ⤋ Beckel Canvas, $85(Updated version)18 x 12 x 8 in Beckel Canvas is a small family-owned American company that started as, and continues to be, a canvas tent manufacturer. A nice height considering its shorter length, the Possibilities Bag is made of 20 oz canvas, heavy duty webbing, and reinforced with leather, the same material they make their tents out of. This buy-it-for-life bag is minimalist function at its best: sturdy and built to be beat around, the interior is unfinished and unlined. If you're looking for a bag that has a beautiful and simple aesthetic that can take whatever you throw at it, this bag will see you through a life's worth of weekend trips. ⤋ Amazon, $4621.6 x 9.8 x 11.8 in Another S-Zone bag we stumbled across on Amazon. After our positive experience with the duffel featured above, we pulled the trigger on thiswaxed canvasvariant. For less than $50, it's tough to beat this option. While water does roll off the exterior thanks to its waxed waterproof coating, the leather is not as nice as the other bag featured above. Still, it's a bag I carry regularly and love. Watch our full video below andread the full review. ⤋  Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine.", "paragraphs": ["", "Pick up a lightweight, affordable weekender for your next trip out of town.", "Words & Photos by Andrew Snavely", "Once upon a time, you could stuff a few days’ worth of essentials into a backpack and be done packing.Well, not anymore. Now you’ve got good shoes, and collared shirts, and other items that deserve better than being crammed into a book bag. Not to mention, the same bag that saw you through college probably won’t cut it on a business trip.", "But rather than reaching for an unwieldy suitcase, consider a third option: a ruggedly handsome weekend bag. Often made from leather or heavy-duty canvas, these overnight bags are usually more structured than a duffel bag, but more stylish than the average hard-shell case. Plus the lack of wheels and slight “squishability” (technical term used by expert travelers) means they fit easily in an overhead compartment, trunk, back seat, and so on.", "When choosing an overnight bag, look for one with plenty of compartments — keeping your devices and toiletries separate from your clothing makes it easier to pack, unpack, and find things when you’re halfway through your trip.", "Premium weekender bags can cost upwards of several hundred dollars. But we’ve rounded up a bunch of durable, versatile, and functional overnight bags that are affordable, so you can spend more money on experience rather than your luggage.", "Updated June 2019", "Watch our video guide, or scroll on to read our picks!", "", "Click here to subscribe toPrimer on Youtube!", "Amazon, $9825 x 11 x 10 in", "A hidden gem popular among style forums, this goatskin duffel comes looking like it’s seen some adventures right out of the box. The leather is naturally spotted, marked, and wrinkled giving it a distressed or vintage feel. It has 2 end pockets and 2 front pockets, and the inside has a durable canvas lining. A few comments on Amazon complained of a strong smell but I didn't have that experience at all. If you want a leather duffel but don't want to drop a lot of money, it's tough to beat this bag.", "⤋", "Amazon, $5521.7 x 14.8 x 10.2 in", "This classic and handsome weekender is made of canvas and buttery-soft oiled leather. That, and with it's nicely finished interior, make this bag seem like it should cost 4 times as much. Two outside zipper pockets stow small gadgets at a finger's reach and the inside has 2 zip pockets as well as 2 open top pockets. The bottom is canvas, but protected by metal feet. This bag design is available from a few brand names, likely being a white-labeled product.", "⤋", "Amazon, $13523 x 12 x 12 in", "If you're looking for a leather weekender of decent quality for less than the cost of a night in a hotel room, you're looking at it. Leather bags are virtually unavailable for less than a couple hundred dollars. Because of its more structured form it's also the largest bag on the list, that may be good or bad depending on what you're looking for. It features compartments on each end with travel pockets, and two zippered pockets on each of the long sides. The leather is soft and thick, and the inside is lined with black. The shoulder strap is also leather, which is a nice touch, though the back of it is canvas.", "⤋", "Everlane, $85(Updated version)14.2 x 7.3 x 19.5 in", "Everlane practically invented the trendy concept among online retailers of “radical transparency” and cutting out the middlemen markup of traditional luxury goods. Their rise to millennial fandom began with their clean and minimalist-designed twill weekender. The simple shape and lack of adornment gives the bag a designer look for less than C-note.", "⤋", "Beckel Canvas, $85(Updated version)18 x 12 x 8 in", "Beckel Canvas is a small family-owned American company that started as, and continues to be, a canvas tent manufacturer. A nice height considering its shorter length, the Possibilities Bag is made of 20 oz canvas, heavy duty webbing, and reinforced with leather, the same material they make their tents out of. This buy-it-for-life bag is minimalist function at its best: sturdy and built to be beat around, the interior is unfinished and unlined. If you're looking for a bag that has a beautiful and simple aesthetic that can take whatever you throw at it, this bag will see you through a life's worth of weekend trips.", "⤋", "Amazon, $4621.6 x 9.8 x 11.8 in", "Another S-Zone bag we stumbled across on Amazon. After our positive experience with the duffel featured above, we pulled the trigger on thiswaxed canvasvariant. For less than $50, it's tough to beat this option. While water does roll off the exterior thanks to its waxed waterproof coating, the leather is not as nice as the other bag featured above. Still, it's a bag I carry regularly and love. Watch our full video below andread the full review.", "⤋", "", "Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine."], "word_count": 904, "content_type": "general", "normalized_url": "https://www.primermagazine.com/2019/spend/best-weekend-bags-under-150", "site_name": "Primer Magazine", "site_domain": "primermagazine.com"}
{"url": "https://www.amazon.com/thunderfit-men-silicone-wedding-rings/dp/b07zkfj4f3/ref=as_li_ss_tl?dchild=1&pf_rd_i=517808&pf_rd_m=atvpdkikx0der&pf_rd_p=b58fce66-1139-4dc5-817c-bdd1ee50ceb2&pf_rd_r=qjb59mwqyrp5j16dpsps&pf_rd_s=merchandised-search-5&pf_rd_t=101&qid=1596745815&smid=a2m0k7wvhc28lm&sr=8-1&linkcode=ll1&tag=primer05-20&linkid=10078be1162fb84be2153835ef3ddeef&language=en_us", "title": "ThunderFit Men's Silicone Wedding Rings, Step Edge Breathable Rubber Engagement Bands 8.7mm Wide 2.5mm Thick - 1/4/7 Variety Multipack", "author": null, "publish_date": null, "text": "We offer easy, convenient returns with at least one free return option: no shipping charges. All returns must comply with our returns policy. Born Victorious We provide a great alternative for a wedding band which is much more comfortable and safer that carries the same meaning of love and commitment. This makes it the perfect band to wear during working out, weight lifting, outdoor activities, while performing in sports and many more. But most importantly, our silicone bands are also safer, designed to break when too much pressure is applied. A unique formula of high quality, hypoallergenic,  light silicone material makes our bands comfortable to wear throughout any activity This special way of showing your love also allows you to have multiple colors to match with your day to day fashionable outfits. Go on that outdoor adventure you've always wanted to take. Never worry about damaging or forgetting your ring in the car or at home. Customer Reviews, including Product Star Ratings help customers to learn more about the product and decide whether it is the right product for them. To calculate the overall star rating and percentage breakdown by star, we don’t use a simple average. Instead, our system considers things like how recent a review is and if the reviewer bought the item on Amazon. It also analyzed reviews to verify trustworthiness. Customers find these silicone rings to be of good quality, comfortable, and excellent value for money. They appreciate the variety of colors that look like real metal rings, and one customer mentions being able to change the look from day to day. The rings are durable, with one noting they don't tear easily, and customers like their fit. Regarding sizing, while some find them properly sized, others report they run a little small. AI Generated from the text of customer reviews Customers find these rings to be of good quality, with one customer noting they are better than regular wedding bands. \"Excellent design and comfortablerings. The best yet. It doesn’t kink and it feels very comfortable on my finger.\"Read more \"Great product. Best price on here. And the greatest customer service I have ever received!!\"Read more \"Great qualityand best bang for your buck! My ring is everything I could’ve asked for.\"Read more \"...All in all these ThunderFit rings are agreat product, and value. They are breathable, and feel great when wearing. Give them a shot!\"Read more Customers are satisfied with how the ring fits, with one mentioning that it expands just enough for a perfect fit. \"Great fit, comfortable, light weight. The sizing guide was right on and I like the fact it has the grooves on the inside to allow for some air flow.\"Read more \"Fits great, if anything I would order smaller than normal size if you are unsure, the rings can be stretched some. Overall good purchase.\"Read more \"I haven’t had them for very long, but the quality is great, theyfit well, and the price was very reasonable. I would definitely recommend them.\"Read more \"Perfect fit. It is perfect for the industry I work in. No fear of losing my finger while I'm at work if the ring gets caught on a sharp edge.\"Read more Customers find the ring comfortable, with one mentioning it works well on their car. \"Great fit,comfortable, light weight. The sizing guide was right on and I like the fact it has the grooves on the inside to allow for some air flow.\"Read more \"My husband really likes these rings.Comfortableand safe for working. Great seller communication and excellent customer service!\"Read more \"So a few things to note. It'svery comfortable. Size is spot on. However, be aware that unlike a metal band, the silicone band can stretch....\"Read more \"My husband loves it so far.Very comfortableand fit was perfect. Ventilation is great, no issues with sweat or pruning of the skin.\"Read more Customers find the rings to be excellent value for money, offering quality at a great price. \"Great value! Very comfortable to wear all the time. I do not even notice I am wearing it. Does not make my finger sweat or hold moisture.\"Read more \"This is a great ring for agreat price! Its so lightweight that you almost don't notice that you're wearing it. Breathable and stylish.\"Read more \"Fits true to size.Good value.\"Read more \"...There are a GREAT find. Very comfortable ring, and agreat value. 4 for $10 or so? Awesome....\"Read more Customers like the appearance of the ring, describing it as shiny and nice-looking, with one customer noting its matte finish and another mentioning it looks like a real metal ring. \"Fits great,looks great, comfy , and affordable. I wear it for work and it's so comfortable it never bothers me.\"Read more \"Fit andlook great. Initial purchase was a bit oversized and the vendor quickly resolved the issue with new, slightly smaller rings.\"Read more \"Looks great, very comfortable. Durability will prove its self in time. Great offer, 4 rings for different occasions.\"Read more \"I’m 6’1” 259 pounds. The ring is completely comfortable, durable andstylish. I have big hands and a size 10-11 worked perfectly for me....\"Read more Customers find the ring durable, noting that it doesn't tear easily, and one customer mentions it holds its shape well. \"...This ring is so comfortable but better yetdurable!! I would have never thought that a rubber ring would look and feel great but it does!!\"Read more \"Comfortable. Stylish.Durable....\"Read more \"...They are just as described. They are stretchy andvery durable. The color looks like a real metal ring.\"Read more \"...it looks like the color wasn't applied completely, or as if it'swearing off. This is the case with both sets....\"Read more Customers appreciate the ring's variety of colors, noting that they look like real metal rings, with one customer mentioning that the color has not faded over time. \"EXCELLENT quality andcolor of the ring. Would definitely buy again.\"Read more \"Still have the same ring and still looks great.Color has not faded. Comfort is still great. No issues at all.\"Read more \"Fit great loves havingdifferent colors to choose from.\"Read more \"Fit great andgreat colors\"Read more Customers have mixed experiences with the sizing of these rings, with some finding them true to size while others report they run small and too tight. \"I used the instructions for sizing. These aretoo big. I need 14.5-15 ring size. Description says they will send new ones with no return necessary.\"Read more \"...these for my husband, he really likes them, they are comfortable,true to size, have a nice style and the fact that they have notches inside the...\"Read more \"...ordered what I thought would be the right size, but now they are alittle too big. But honestly they work and achieve what I was looking for....\"Read more \"Runs true to size, comfy.\"Read more", "paragraphs": ["We offer easy, convenient returns with at least one free return option: no shipping charges. All returns must comply with our returns policy.", "Born Victorious", "We provide a great alternative for a wedding band which is much more comfortable and safer that carries the same meaning of love and commitment.", "This makes it the perfect band to wear during working out, weight lifting, outdoor activities, while performing in sports and many more.", "But most importantly, our silicone bands are also safer, designed to break when too much pressure is applied.", "A unique formula of high quality, hypoallergenic,  light silicone material makes our bands comfortable to wear throughout any activity", "This special way of showing your love also allows you to have multiple colors to match with your day to day fashionable outfits.", "Go on that outdoor adventure you've always wanted to take. Never worry about damaging or forgetting your ring in the car or at home.", "Customer Reviews, including Product Star Ratings help customers to learn more about the product and decide whether it is the right product for them.", "To calculate the overall star rating and percentage breakdown by star, we don’t use a simple average. Instead, our system considers things like how recent a review is and if the reviewer bought the item on Amazon. It also analyzed reviews to verify trustworthiness.", "Customers find these silicone rings to be of good quality, comfortable, and excellent value for money. They appreciate the variety of colors that look like real metal rings, and one customer mentions being able to change the look from day to day. The rings are durable, with one noting they don't tear easily, and customers like their fit. Regarding sizing, while some find them properly sized, others report they run a little small.", "AI Generated from the text of customer reviews", "Customers find these rings to be of good quality, with one customer noting they are better than regular wedding bands.", "\"Excellent design and comfortablerings. The best yet. It doesn’t kink and it feels very comfortable on my finger.\"Read more", "\"Great product. Best price on here. And the greatest customer service I have ever received!!\"Read more", "\"Great qualityand best bang for your buck! My ring is everything I could’ve asked for.\"Read more", "\"...All in all these ThunderFit rings are agreat product, and value. They are breathable, and feel great when wearing. Give them a shot!\"Read more", "Customers are satisfied with how the ring fits, with one mentioning that it expands just enough for a perfect fit.", "\"Great fit, comfortable, light weight. The sizing guide was right on and I like the fact it has the grooves on the inside to allow for some air flow.\"Read more", "\"Fits great, if anything I would order smaller than normal size if you are unsure, the rings can be stretched some. Overall good purchase.\"Read more", "\"I haven’t had them for very long, but the quality is great, theyfit well, and the price was very reasonable. I would definitely recommend them.\"Read more", "\"Perfect fit. It is perfect for the industry I work in. No fear of losing my finger while I'm at work if the ring gets caught on a sharp edge.\"Read more", "Customers find the ring comfortable, with one mentioning it works well on their car.", "\"Great fit,comfortable, light weight. The sizing guide was right on and I like the fact it has the grooves on the inside to allow for some air flow.\"Read more", "\"My husband really likes these rings.Comfortableand safe for working. Great seller communication and excellent customer service!\"Read more", "\"So a few things to note. It'svery comfortable. Size is spot on. However, be aware that unlike a metal band, the silicone band can stretch....\"Read more", "\"My husband loves it so far.Very comfortableand fit was perfect. Ventilation is great, no issues with sweat or pruning of the skin.\"Read more", "Customers find the rings to be excellent value for money, offering quality at a great price.", "\"Great value! Very comfortable to wear all the time. I do not even notice I am wearing it. Does not make my finger sweat or hold moisture.\"Read more", "\"This is a great ring for agreat price! Its so lightweight that you almost don't notice that you're wearing it. Breathable and stylish.\"Read more", "\"Fits true to size.Good value.\"Read more", "\"...There are a GREAT find. Very comfortable ring, and agreat value. 4 for $10 or so? Awesome....\"Read more", "Customers like the appearance of the ring, describing it as shiny and nice-looking, with one customer noting its matte finish and another mentioning it looks like a real metal ring.", "\"Fits great,looks great, comfy , and affordable. I wear it for work and it's so comfortable it never bothers me.\"Read more", "\"Fit andlook great. Initial purchase was a bit oversized and the vendor quickly resolved the issue with new, slightly smaller rings.\"Read more", "\"Looks great, very comfortable. Durability will prove its self in time. Great offer, 4 rings for different occasions.\"Read more", "\"I’m 6’1” 259 pounds. The ring is completely comfortable, durable andstylish. I have big hands and a size 10-11 worked perfectly for me....\"Read more", "Customers find the ring durable, noting that it doesn't tear easily, and one customer mentions it holds its shape well.", "\"...This ring is so comfortable but better yetdurable!! I would have never thought that a rubber ring would look and feel great but it does!!\"Read more", "\"Comfortable. Stylish.Durable....\"Read more", "\"...They are just as described. They are stretchy andvery durable. The color looks like a real metal ring.\"Read more", "\"...it looks like the color wasn't applied completely, or as if it'swearing off. This is the case with both sets....\"Read more", "Customers appreciate the ring's variety of colors, noting that they look like real metal rings, with one customer mentioning that the color has not faded over time.", "\"EXCELLENT quality andcolor of the ring. Would definitely buy again.\"Read more", "\"Still have the same ring and still looks great.Color has not faded. Comfort is still great. No issues at all.\"Read more", "\"Fit great loves havingdifferent colors to choose from.\"Read more", "\"Fit great andgreat colors\"Read more", "Customers have mixed experiences with the sizing of these rings, with some finding them true to size while others report they run small and too tight.", "\"I used the instructions for sizing. These aretoo big. I need 14.5-15 ring size. Description says they will send new ones with no return necessary.\"Read more", "\"...these for my husband, he really likes them, they are comfortable,true to size, have a nice style and the fact that they have notches inside the...\"Read more", "\"...ordered what I thought would be the right size, but now they are alittle too big. But honestly they work and achieve what I was looking for....\"Read more", "\"Runs true to size, comfy.\"Read more"], "word_count": 1124, "content_type": "general", "normalized_url": "https://www.amazon.com/thunderfit-men-silicone-wedding-rings/dp/b07zkfj4f3/ref=as_li_ss_tl?dchild=1&pf_rd_i=517808&pf_rd_m=atvpdkikx0der&pf_rd_p=b58fce66-1139-4dc5-817c-bdd1ee50ceb2&pf_rd_r=qjb59mwqyrp5j16dpsps&pf_rd_s=merchandised-search-5&pf_rd_t=101&qid=1596745815&smid=a2m0k7wvhc28lm&sr=8-1&linkcode=ll1&tag=primer05-20&linkid=10078be1162fb84be2153835ef3ddeef&language=en_us", "site_name": "Primer Magazine", "site_domain": "primermagazine.com"}
{"url": "https://www.primermagazine.com/2025/learn/fall-getup-week-blazer-with-jeans-now-how-we-got-here-from-the-90s-and-2010s", "title": "Fall Getup Week: Blazer with Jeans Now – How We Got Here from the 90s and 2010s", "author": null, "publish_date": null, "text": "Its an outfit men have worn for decades: navy blazer, jeans, loafers. The format stays the same, but each decade has shaped it into its own reflection. In the early 1990s, this look was part of a larger mood, affluent, collegiate, at ease with itself. American menswear favored natural shoulders, soft tailoring, heavier denim, and a laid-back kind of polish. It was the height of post-1980s optimism and the start of what you might call the “Gap-era democracy” when dressingwelldidn't meanhard. The J.Crew catalog sold this look by staging it near docks and Jeeps, always within walking distance of either a lacrosse field or a bookstore. Get the look: Blazer:J.Crew/Faherty/Lands EndSweater:Amazon Essentials/Flint & Tinder/QuinceStriped Oxford Shirt:Amazon EssentialsJeans:Flint & Tinder/HuckberryKnit Tie:J.Crew/AmazonRagg Socks:J.CrewPenny Loafers:Florsheim/Banana Republic Factory/GH BassJewelry The creative direction of that era was to appear competent and culturally fluent: a man who played touch football at Thanksgiving and helped his cousin move on weekends. The looseness of the blazer, the familiarity of the jeans, and the tie left slightly loosened all signaled a kind of regular excellence. You wore the outfit because it worked andhadworked, and the fact that it looked a little old-fashioned was part of the charm, not in the costume sense, but in the way the pieces looked like things you’d always had. Like the pleated chinos you mightpaint the ceiling in, as one J.Crew cover in 1993 showed. The old-fashioned quality came from polish that felt lived in. “This is just what I wear.” That’s why it looked so casual. By 2015, that goodwill had tightened. The culture had shifted toward optimization: Calorie tracking, standing desks, personal branding. But it didn’t happen all at once. The silhouettes of the 90s were loose and easy, but they lived in distinct silos; your dress clothes were one thing, your casual clothes another. They didn’t mix. As young millennial professionals pushed into spaces that still required business casual+, the instinct was to carry forward the dressy silhouette in more casual materials: Jeans, sweaters, and shirts all got slimmer to pass. Slimmer meant sharper, and sharper could mix with the leftover tailoring. A tie was still worn, but maybe it was skinny now. Jeans replaced pleated khakis, but had to be dark, slim, and sharp. You were still assembling the look, but with more casual ingredients. This was the birth of what emerged assmart casual: adress codeapproach that nodded towardoutcomeversus a specific list of acceptable items like khakis or a tie. A pass / fail test for situational appropriateness, and less a uniform. The proportions continued to narrow, fabrics got sleeker, and heritage was packaged into precise, curated choices. The jeans were stiff and dark, often raw, and intentionally cuffed. The blazer was shorter, the fit closer, the styling full of little moves like pocket squares but no belt, sprezzatura ties, and monk straps. In the early 2000s we still wore dress socks with loafers but theyhadto be fun patterns. By the mid 10s, the socks were gone altogether. You wore it to prove you could still look dressed while dodging the formality of an actual suit. It co-evolved with open office plans and startup culture, workplaces that traded hierarchy for hoodies but still expected you to look like you had taste. The J.Crew of this era gave you rules: trim your collar, hem your pants, slim your life. It was still aspirational, but with homework. As it always does, a new generation has entered the workforce responding to what came before. If millennials were avoiding the rigidity of business casual by refining their casual clothing, Gen Z has inherited an environment where they reject the need to justify what they want to wear. Looser fits aren’tjustabout comfort, the proportions have softened because the posture has too. The rejection isn’t a rejection to the polish, it’s refusing the obligation to justify choosing comfort and drape. While it can seem like a full aesthetic swing from just a few years ago, philosophically they’re continuing what the millennials started before them, and Gen X before them, and the Baby Boomers before that. Each generation has reacted to the expectations it inherited. The media often describes it like a trend swing, but really it’s a natural progression. In 2025, the jeans are fuller and lighter wash. The blazer fits, but doesn’t hug the body. The tie isn’t there to prove anything. Wear it, don't wear it, it doesn't matter; more akin to deciding if you’ll wear a watch or not. There’s less tension between the pieces. The socks are present with loafers again. The belt has texture but is neither a dress belt or a thick jeans belt. It’s not trying to dress down tailoring to make it acceptable. It’s just… worn. In 1990, it was refined confidence by calculated nonchalance. In 2015, it was tasteful casual via precision. In 2025, it’s balance without justification. None of these versions are better or worse. They just tell you what the moment valued. And that’s what keeps the outfit useful. The form doesn’t change much, but the approach does. Check out all of Fall Getup Week: Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine. ", "paragraphs": ["Its an outfit men have worn for decades: navy blazer, jeans, loafers.", "The format stays the same, but each decade has shaped it into its own reflection. In the early 1990s, this look was part of a larger mood, affluent, collegiate, at ease with itself.", "American menswear favored natural shoulders, soft tailoring, heavier denim, and a laid-back kind of polish. It was the height of post-1980s optimism and the start of what you might call the “Gap-era democracy” when dressingwelldidn't meanhard. The J.Crew catalog sold this look by staging it near docks and Jeeps, always within walking distance of either a lacrosse field or a bookstore.", "Get the look:", "Blazer:J.Crew/Faherty/Lands EndSweater:Amazon Essentials/Flint & Tinder/QuinceStriped Oxford Shirt:Amazon EssentialsJeans:Flint & Tinder/HuckberryKnit Tie:J.Crew/AmazonRagg Socks:J.CrewPenny Loafers:Florsheim/Banana Republic Factory/GH BassJewelry", "The creative direction of that era was to appear competent and culturally fluent: a man who played touch football at Thanksgiving and helped his cousin move on weekends. The looseness of the blazer, the familiarity of the jeans, and the tie left slightly loosened all signaled a kind of regular excellence. You wore the outfit because it worked andhadworked, and the fact that it looked a little old-fashioned was part of the charm, not in the costume sense, but in the way the pieces looked like things you’d always had.", "Like the pleated chinos you mightpaint the ceiling in, as one J.Crew cover in 1993 showed. The old-fashioned quality came from polish that felt lived in. “This is just what I wear.” That’s why it looked so casual.", "By 2015, that goodwill had tightened.", "The culture had shifted toward optimization: Calorie tracking, standing desks, personal branding. But it didn’t happen all at once.", "The silhouettes of the 90s were loose and easy, but they lived in distinct silos; your dress clothes were one thing, your casual clothes another. They didn’t mix. As young millennial professionals pushed into spaces that still required business casual+, the instinct was to carry forward the dressy silhouette in more casual materials: Jeans, sweaters, and shirts all got slimmer to pass. Slimmer meant sharper, and sharper could mix with the leftover tailoring.", "A tie was still worn, but maybe it was skinny now. Jeans replaced pleated khakis, but had to be dark, slim, and sharp. You were still assembling the look, but with more casual ingredients.", "This was the birth of what emerged assmart casual: adress codeapproach that nodded towardoutcomeversus a specific list of acceptable items like khakis or a tie. A pass / fail test for situational appropriateness, and less a uniform.", "The proportions continued to narrow, fabrics got sleeker, and heritage was packaged into precise, curated choices. The jeans were stiff and dark, often raw, and intentionally cuffed. The blazer was shorter, the fit closer, the styling full of little moves like pocket squares but no belt, sprezzatura ties, and monk straps.", "In the early 2000s we still wore dress socks with loafers but theyhadto be fun patterns. By the mid 10s, the socks were gone altogether.", "You wore it to prove you could still look dressed while dodging the formality of an actual suit. It co-evolved with open office plans and startup culture, workplaces that traded hierarchy for hoodies but still expected you to look like you had taste.", "The J.Crew of this era gave you rules: trim your collar, hem your pants, slim your life. It was still aspirational, but with homework.", "As it always does, a new generation has entered the workforce responding to what came before. If millennials were avoiding the rigidity of business casual by refining their casual clothing, Gen Z has inherited an environment where they reject the need to justify what they want to wear. Looser fits aren’tjustabout comfort, the proportions have softened because the posture has too. The rejection isn’t a rejection to the polish, it’s refusing the obligation to justify choosing comfort and drape.", "While it can seem like a full aesthetic swing from just a few years ago, philosophically they’re continuing what the millennials started before them, and Gen X before them, and the Baby Boomers before that. Each generation has reacted to the expectations it inherited. The media often describes it like a trend swing, but really it’s a natural progression.", "In 2025, the jeans are fuller and lighter wash. The blazer fits, but doesn’t hug the body. The tie isn’t there to prove anything. Wear it, don't wear it, it doesn't matter; more akin to deciding if you’ll wear a watch or not.", "There’s less tension between the pieces. The socks are present with loafers again. The belt has texture but is neither a dress belt or a thick jeans belt. It’s not trying to dress down tailoring to make it acceptable. It’s just… worn.", "In 1990, it was refined confidence by calculated nonchalance. In 2015, it was tasteful casual via precision. In 2025, it’s balance without justification. None of these versions are better or worse. They just tell you what the moment valued.", "And that’s what keeps the outfit useful. The form doesn’t change much, but the approach does.", "Check out all of Fall Getup Week:", "Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine.", ""], "word_count": 932, "content_type": "general", "normalized_url": "https://www.primermagazine.com/2025/learn/fall-getup-week-blazer-with-jeans-now-how-we-got-here-from-the-90s-and-2010s", "site_name": "Primer Magazine", "site_domain": "primermagazine.com"}
{"url": "https://www.primermagazine.com/2015/live/one-simple-trick-to-building-diet-discipline-and-changing-your-life", "title": "One Simple Trick to Building Diet Discipline and Changing Your Life", "author": null, "publish_date": null, "text": "There’s an old adage when it comes to grocery shopping and dieting: If you don’t want to eat it, don’t buy it. It’s a simple way of restricting what you eat, but there’s a big problem with it. Just like spraying Febreeze in the kitchen instead of taking out the trash, this method of diet restriction is only masking the problem. You’re achieving an end result without actually altering the behavior that is the root of the problem. It won’t take long before that end result is unsustainable. The actual problem with almost any negative behavior in our lives is our uncanny ability to trick ourselves when our attempts to restrict that behavior fly in the face of our in-the-moment desires. It’s easy to not eat junk food you didn’t buy because if you don’t have it, you can’t eat it. But what happens when in the course of your life you ARE presented with the opportunity to splurge on junk food? All of a sudden your cravings have the salesman skills of Zig Ziglar and you convince yourself that it’s ok: “Oh, I’m out with friends so it’s alright. The giant side of french fries comes with the meal so I can eat them.” “I’m having a long day so it’s ok to have a 1,000caloriecoffee drink to just get me through it.” “I’m tired from a long week and don’t feel like cooking, I’ll just order a pizza, which is fine because I haven’t had any since last week.” So what happens when you’re presented with the easily attainable junk food? You eat it. Because you haven’t developed any discipline that gives you the strength to say no to the salesman. You’ve decided that you want to “eat healthier” or “eat McDonalds less” or “stop drinking so much soda” but the problem is those are not goals. And people who are not ready to fully make a commitment to the change love to make blurry goals like these because these are the easiest to defeat when they decide they don’t want to listen to them. If you’re trying to drink soda less, how do you know if you’re on track when you start craving one? A real goal is hard, specific and non-negotiable. There is no wiggle room in your moments of craving, it either is or it isn’t. “I will only drink soda 3 times per week.” That is a goal. And the reason people who don’t really want to make progress are scared of that is because once you’ve had your 3, there is no room for one more. There’s no sales trick to make it ok. When the opportunity to order that 4th soda comes, you either have the strength to say no or you don’t. If you’re unhappy with your diet you have to learn to recondition yourself. You have to train yourself that just because you SEE something you’d like to eat, doesn’t mean you HAVE to eat it. Discipline is a muscle; you can’t just expect to be able to stick with a restrictive goal because you’ve set your mind to it. Ourraptor brains are programmedto say yes to cravings, no matter what our more logical thoughts try to say. You would never think you could run 10 miles if you’ve never run a mile, and you can’t expect to be able to say no to a constant barrage of junk food opportunities in your life if you haven’t first trained yourself to be able to say no once. To do this, you intentionally buy your favorite craving food with the goal of never opening it. You learn to constantly see this irresistible treat and develop a voice in your head that can say no to it. For me that’s Mega Stuf Oreos. There’s nothing like a fresh Oreo, and just like the examples above, I would trick myself into thinking that if I bought a package I would eat them at a reasonable, drawn out pace. But what actually happens when you buy a package of Oreos? You open it to eat one and end up eating 4. And by the end of the week you’ve eaten an entire pack of Oreos by yourself. That’s 2,000 calories in JUST Oreos. Figure out what craving challenges you the most. If it’s Coke, buy just one can. If it’s ice cream, pick up a carton. The goal here is simple: If you open the packaging, you’ve failed. This takes the wishy-washiness out of diet restriction. Every time you’re touring your kitchen for something to satisfy your craving there is only one decision to make: Am I strong enough to say no or will I fail the exercise by opening the package? The incredible thing is how exponential this is. It only took me about a week and a half of learning to say no to the Oreos before an inspiring thing happened. I now found I had the strength to start saying no to other junk food in my daily life. Just because I’m hungry and pass a McDonalds doesn’t mean I HAVE to go through the drive-thru. Just because I always order soda with dinner, doesn’t mean I can’t order unsweetened iced tea or water. Just as you begin raising the weight on bench press as you get stronger, my personal discipline to say no to cravings started getting stronger. And perhaps the craziest thing of all: I got so good at saying no, the salesman in my mind started working for his competitor. Instead of hearing a voice explaining why it’s ok to splurge, a new voice emerged, one reminding me how easy it is to say no, and how excited I feel when I can give a craving the finger. One of encouragement saying, “It’s ok if you eat this, but what if you didn’t?” So my challenge to you is this: Are you ready to commit to learning to say no? Are you ready to lose weight and eat healthier? Are you ready to becomeemotionallystronger than you’ve ever been? If yes, go out and buy your junk food and learn that you have the power to change your life. Here’s to a new you, and a lot of unopened Oreo packages. Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine. ", "paragraphs": ["There’s an old adage when it comes to grocery shopping and dieting: If you don’t want to eat it, don’t buy it. It’s a simple way of restricting what you eat, but there’s a big problem with it. Just like spraying Febreeze in the kitchen instead of taking out the trash, this method of diet restriction is only masking the problem. You’re achieving an end result without actually altering the behavior that is the root of the problem. It won’t take long before that end result is unsustainable.", "The actual problem with almost any negative behavior in our lives is our uncanny ability to trick ourselves when our attempts to restrict that behavior fly in the face of our in-the-moment desires. It’s easy to not eat junk food you didn’t buy because if you don’t have it, you can’t eat it. But what happens when in the course of your life you ARE presented with the opportunity to splurge on junk food?", "All of a sudden your cravings have the salesman skills of Zig Ziglar and you convince yourself that it’s ok:", "“Oh, I’m out with friends so it’s alright. The giant side of french fries comes with the meal so I can eat them.”", "“I’m having a long day so it’s ok to have a 1,000caloriecoffee drink to just get me through it.”", "“I’m tired from a long week and don’t feel like cooking, I’ll just order a pizza, which is fine because I haven’t had any since last week.”", "So what happens when you’re presented with the easily attainable junk food? You eat it. Because you haven’t developed any discipline that gives you the strength to say no to the salesman.", "You’ve decided that you want to “eat healthier” or “eat McDonalds less” or “stop drinking so much soda” but the problem is those are not goals. And people who are not ready to fully make a commitment to the change love to make blurry goals like these because these are the easiest to defeat when they decide they don’t want to listen to them.", "If you’re trying to drink soda less, how do you know if you’re on track when you start craving one? A real goal is hard, specific and non-negotiable. There is no wiggle room in your moments of craving, it either is or it isn’t. “I will only drink soda 3 times per week.” That is a goal. And the reason people who don’t really want to make progress are scared of that is because once you’ve had your 3, there is no room for one more. There’s no sales trick to make it ok. When the opportunity to order that 4th soda comes, you either have the strength to say no or you don’t.", "If you’re unhappy with your diet you have to learn to recondition yourself. You have to train yourself that just because you SEE something you’d like to eat, doesn’t mean you HAVE to eat it.", "Discipline is a muscle; you can’t just expect to be able to stick with a restrictive goal because you’ve set your mind to it. Ourraptor brains are programmedto say yes to cravings, no matter what our more logical thoughts try to say.", "You would never think you could run 10 miles if you’ve never run a mile, and you can’t expect to be able to say no to a constant barrage of junk food opportunities in your life if you haven’t first trained yourself to be able to say no once.", "To do this, you intentionally buy your favorite craving food with the goal of never opening it. You learn to constantly see this irresistible treat and develop a voice in your head that can say no to it.", "For me that’s Mega Stuf Oreos. There’s nothing like a fresh Oreo, and just like the examples above, I would trick myself into thinking that if I bought a package I would eat them at a reasonable, drawn out pace. But what actually happens when you buy a package of Oreos? You open it to eat one and end up eating 4. And by the end of the week you’ve eaten an entire pack of Oreos by yourself. That’s 2,000 calories in JUST Oreos.", "Figure out what craving challenges you the most. If it’s Coke, buy just one can. If it’s ice cream, pick up a carton. The goal here is simple: If you open the packaging, you’ve failed. This takes the wishy-washiness out of diet restriction. Every time you’re touring your kitchen for something to satisfy your craving there is only one decision to make: Am I strong enough to say no or will I fail the exercise by opening the package?", "The incredible thing is how exponential this is. It only took me about a week and a half of learning to say no to the Oreos before an inspiring thing happened. I now found I had the strength to start saying no to other junk food in my daily life. Just because I’m hungry and pass a McDonalds doesn’t mean I HAVE to go through the drive-thru. Just because I always order soda with dinner, doesn’t mean I can’t order unsweetened iced tea or water. Just as you begin raising the weight on bench press as you get stronger, my personal discipline to say no to cravings started getting stronger.", "And perhaps the craziest thing of all: I got so good at saying no, the salesman in my mind started working for his competitor. Instead of hearing a voice explaining why it’s ok to splurge, a new voice emerged, one reminding me how easy it is to say no, and how excited I feel when I can give a craving the finger. One of encouragement saying, “It’s ok if you eat this, but what if you didn’t?”", "So my challenge to you is this: Are you ready to commit to learning to say no? Are you ready to lose weight and eat healthier? Are you ready to becomeemotionallystronger than you’ve ever been? If yes, go out and buy your junk food and learn that you have the power to change your life. Here’s to a new you, and a lot of unopened Oreo packages.", "Andrew foundedPrimer in 2008and brings 15+ years of men's style expertise. Known for his practical, relatable approach to style and self-development, he has been a recognized speaker at conferences and has styled work for top brands. Off-duty, he loves photography & editing, and enjoys road trips with his dog, Leela. Raised in rural Pennsylvania, educated in DC, and living in LA for nearly 20 years, Andrew's diverse experiences shape the relatable and real-world advice that has helped millions through Primer. On Instagram:@andrewsnavelyand@primermagazine.", ""], "word_count": 1124, "content_type": "general", "normalized_url": "https://www.primermagazine.com/2015/live/one-simple-trick-to-building-diet-discipline-and-changing-your-life", "site_name": "Primer Magazine", "site_domain": "primermagazine.com"}
