{"url": "https://www.themodestman.com/alpha-industries-b-3-sherpa-bomber-leather-jacket", "title": "B-3 SHERPA LEATHER JACKET", "author": null, "publish_date": null, "text": "With arm relaxed at your side, measure from center back neck, to point of shoulder, and along the arm to the wrist (just below round bone). Measure around body with tape leveled on the fullest part of your chest. Measure around your waist with the tape leveled at the narrowest point of your torso. Stand with heels 2 to 3” apart. Keep the tape leveled and measure around the fullest part of your hips. NEED HELP?CONTACT US CLOSE BORN OF PURPOSE TOTAL $ B-3 SHERPA LEATHER JACKET $1,300.00 Translation missing: en.products.product.regular_price$1,300.00 BROWN Please select a size The Alpha B-3 air force bomber jacket is a classic coat that never goes out of style. This leather bomber jacket is made from genuine distressed leather and is lined in sherpa sheepskin for warmth in any conditions. The dual adjustable collar keeps your neck covered, while the slash pockets will give you a place to store necessities. Side buckle straps ensure a fashionably tight fit and the antiqued zipper indicates a durable traditional construction that can't be beat.  YOU'REAWAY FROM FREE SHIPPING. CONGRATS! YOU GET FREE SHIPPING. TOTAL $0.00 USD 0 Are you sure you want to cancel this order? Something went wrong If you cancel an order, the order will not be dispatched to the customer. Your account will be credited for\n          the amount of the cancelled order. cancel order  Standard Fit Sort By: The Alpha B-3 air force bomber jacket is a classic coat that never goes out of style. This leather bomber jacket is made from genuine distressed leather and is lined in sherpa sheepskin for warmth in any conditions. The dual adjustable collar keeps your neck covered, while the slash pockets will give you a place to store necessities. Side buckle straps ensure a fashionably tight fit and the antiqued zipper indicates a durable traditional construction that can't be beat.", "paragraphs": ["With arm relaxed at your side, measure from center back neck, to point of shoulder, and along the arm to the wrist (just below round bone).", "Measure around body with tape leveled on the fullest part of your chest.", "Measure around your waist with the tape leveled at the narrowest point of your torso.", "Stand with heels 2 to 3” apart. Keep the tape leveled and measure around the fullest part of your hips.", "NEED HELP?CONTACT US", "CLOSE", "BORN OF PURPOSE", "TOTAL", "$", "B-3 SHERPA LEATHER JACKET", "$1,300.00", "Translation missing: en.products.product.regular_price$1,300.00", "BROWN", "Please select a size", "The Alpha B-3 air force bomber jacket is a classic coat that never goes out of style. This leather bomber jacket is made from genuine distressed leather and is lined in sherpa sheepskin for warmth in any conditions. The dual adjustable collar keeps your neck covered, while the slash pockets will give you a place to store necessities. Side buckle straps ensure a fashionably tight fit and the antiqued zipper indicates a durable traditional construction that can't be beat.", "", "YOU'REAWAY FROM FREE SHIPPING.", "CONGRATS! YOU GET FREE SHIPPING.", "TOTAL", "$0.00 USD", "0", "Are you sure you want to cancel this order?", "Something went wrong", "If you cancel an order, the order will not be dispatched to the customer. Your account will be credited for\n          the amount of the cancelled order.", "cancel order", "", "Standard Fit", "Sort By:", "The Alpha B-3 air force bomber jacket is a classic coat that never goes out of style. This leather bomber jacket is made from genuine distressed leather and is lined in sherpa sheepskin for warmth in any conditions. The dual adjustable collar keeps your neck covered, while the slash pockets will give you a place to store necessities. Side buckle straps ensure a fashionably tight fit and the antiqued zipper indicates a durable traditional construction that can't be beat."], "word_count": 311, "content_type": "general", "normalized_url": "https://www.themodestman.com/alpha-industries-b-3-sherpa-bomber-leather-jacket", "site_name": "The Modest Man", "site_domain": "themodestman.com"}
{"url": "https://www.themodestman.com/blog", "title": "Blog", "author": null, "publish_date": null, "text": "Welcome to The Modest Man blog! Here you'll find every article we've ever published, in order by date (newest to oldest). With the thought of marriage, \"change\" is the next word that comes into our mind. Marriage is not just a relationship status changer; it is way more profound in impact. Aabout 15 Surprising Ways Marriage Can Affect Your Health So, the first date kinda flopped, huh? Maybe you talked too fast, tripped over your words, or got spinach stuck in your teeth. Happens to the best of us. (Seriously,about Dropped the Ball on the First Date? Don’t Worry, These 17 Tricks Will Make Them Text You Back Long-term relationships aren’t built on romance alone. They’re built on small decisions, tough conversations, and quiet loyalty when things get hard. Every man who’s beenabout 15 Best (and Worst) Moments in Every Long-Term Relationship Moving in together marks a huge step in any relationship–it’s exciting, intimate, and yes, a little scary. You’re not just merging furniture; you’re merging habits,about Moving In Together? 17 Tips to Make It Easier for You and Your Partner When two people first click and launch into a relationship, it’s like they’ve been handed a VIP pass to the velvet-rope section of their own emotional lives: the worldabout Everything You Need to Know About the “Honeymoon Phase” There’s this thing people do, they give and give until they’re running on fumes. You might be that person who drops everything for others, but somehow forgets yourself inabout You Can’t Pour From an Empty Cup: 16 Reasons Why You Should Love Yourself First Before Anyone Else There comes a moment in most long-term relationships when things feel different. Life takes over, work, bills, the never-ending to-do lists, and suddenly, the magic thatabout 16 Reasons Why Renewing Wedding Vows Can Bring Back The Spark You Thought Was Lost Somewhere along the way, people started selling marriage like it was a gym membership. “No pain, no gain!” they said. But love was never supposed to feel like boot campabout Marriage Was Never Supposed to Be “Hard”: 15 Signs You Married the Wrong Person Let’s be real here. Men don’t wake up one morning and decide, “You know what? I’m done.” Nope. It’s a slow fade, a death by a thousand eye rolls, sighs, andabout Husbands Lose Interest Quickly When Their Wives Do These 15 Annoying Things Women form opinions about men faster than most guys realize—sometimes in under ten seconds. You don’t need to play games or pretend to be someone else, but you do need toabout 15 Best (and Worst) Traits Women Notice First in a Man Words are like fingerprints. They leave marks that never fully fade, especially in marriage. Men might forget dates or small fights, but they don’t forget the words thatabout 17 Best (and Worst) Things Wives Say That Stick With Their Husbands Forever Every man has opinions on what kind of woman makes marriage work. But the truth hits harder once you’ve lived through a few years of it—or survived a divorce. Ask menabout 17 Best (and Worst) Types of Women to Marry, According to Men Who’ve Been There Every husband walks into marriage carrying a lifetime of habits he doesn’t even think about. Some of those habits build connection, respect, and peace. Others chip awayabout 17 Best (and Worst) Habits Husbands Bring Into Marriage You can tell a lot about a man by how he handles himself when no one’s watching. The truth? Most men can fake confidence or charm for a while, but the rare ones haveabout He’s A Total Catch If He Has These 17 Rare Traits You know what’s exhausting? Doing stuff that’s supposed to scream “I love you” and getting crickets in return. Husbands aren’t perfect, not evenabout Husbands Are Sick and Tired of Their Wives Not Appreciating These 17 Thoughtful Gestures Catching a cheater goes beyond lipstick on the collar or late-night texts from “coworkers.” It’s about noticing the small details, the inconsistencies, and the strangeabout These 16 Signs Will Help You Spot a Cheater From a Mile Away Once upon a time, courting actually meant something. A guy would dress up, show up, and mean it when he said he was interested. Letters got written, plans wereabout 15 Reasons Why Courting a Woman Has Become a Lost Art in Today’s World You’ve probably met one, the woman who swears she’s “seeing where things go,” but deep down, she’s already made up her mind that you’re not the one. She’s there for theabout 16 Terrible Excuses Women Love to Make When They’re Just Dating You for Convenience Cheating doesn’t always mean sleeping with someone else. Sometimes it’s the flirty texts, the secret compliments, the hidden messages that “don’t mean anything.” But whenabout 15 Reasons Why Micro-Cheating Is Just as Bad as Actual Cheating Love shines brightest through the everyday things we do. It’s those small gestures that tell your partner, “Hey, you matter to me.” The soft words, theabout 17 Small Ways to Show Your Partner That You Appreciate Them Love wasn't a contest, but it certainly has turned into one in these times. No one has been affected more deeply by the capriciousness and utter contrivances that modernabout Modern Love and 15 Reasons Why Men are Tired of Competing for It Men don't go quiet without reason. This happens when they feel they aren't being appreciated any longer and their contributions are trivialized at every turn. This worldabout He’s Not Cold: 17 Reasons Why He’s Tired of Being Taken for Granted No one thinks about the possibility of divorce when they are walking down the aisle, making vows, or kissing their beloved wife. They staunchly believe that life holdsabout The Silent Breakup Triggers: 17 Top Reasons Why Couples End Up Divorcing Have you ever felt like you were just destined to meet someone? It is as if fate itself was conspiring to cross your paths together, and as if the university was silentlyabout 17 Signs You’re Living the “Invisible String Theory” in Your Love Life Being a good husband isn’t about having a perfect life or a fat paycheck. What actually keeps a marriage strong are the traits you show every day when no one’s watching.about 14 Personality Traits That Predict a Man Will Be a Loving, Long-Term Husband If you’ve noticed more women in your circle seem fine being single or unwilling to settle, you’re not imagining it. Women are rewriting the rules on what partnershipabout 17 Reasons Women Are Choosing Single Life Over Settling for Less Let’s be honest: dating in 2025 feels like a completely different sport, and a lot of men don’t even realize the rules have changed. Women have adapted, evolved, andabout 17 Reasons Single Women Are Winning at Modern Dating (and Men Are Quietly Losing Ground) Most men think attraction starts with looks, but the truth is, women remember how a man makes them feel long after they forget what he wore. It’s not the car, the abs, orabout 15 Things That Make Women Fall for a Man — and It’s Not His Face or Body A man’s dignity doesn’t come from how much he earns or how much he can endure. It comes from the standards he holds and the boundaries he keeps. When you’ve grown throughabout 15 Things Every Man With Dignity Refuses to Tolerate in a Relationship You can hold down a job, fix the leaks, show up for everyone, and still feel invisible at home. It’s a quiet pain most men won’t admit out loud. When appreciation fades,about Men Admit These 15 Things Hurt When Their Wives Don’t Appreciate Them  Home•Blog•Resources•Contact•Advertise  Privacy Policy & Affiliate Disclosure•Terms & Conditions•Sitemap  As an Amazon Associate I earn from qualifying purchases.  Copyright © 2025 The Modest Man (Registered Trademark)", "paragraphs": ["Welcome to The Modest Man blog! Here you'll find every article we've ever published, in order by date (newest to oldest).", "With the thought of marriage, \"change\" is the next word that comes into our mind. Marriage is not just a relationship status changer; it is way more profound in impact. Aabout 15 Surprising Ways Marriage Can Affect Your Health", "So, the first date kinda flopped, huh? Maybe you talked too fast, tripped over your words, or got spinach stuck in your teeth. Happens to the best of us. (Seriously,about Dropped the Ball on the First Date? Don’t Worry, These 17 Tricks Will Make Them Text You Back", "Long-term relationships aren’t built on romance alone. They’re built on small decisions, tough conversations, and quiet loyalty when things get hard. Every man who’s beenabout 15 Best (and Worst) Moments in Every Long-Term Relationship", "Moving in together marks a huge step in any relationship–it’s exciting, intimate, and yes, a little scary. You’re not just merging furniture; you’re merging habits,about Moving In Together? 17 Tips to Make It Easier for You and Your Partner", "When two people first click and launch into a relationship, it’s like they’ve been handed a VIP pass to the velvet-rope section of their own emotional lives: the worldabout Everything You Need to Know About the “Honeymoon Phase”", "There’s this thing people do, they give and give until they’re running on fumes. You might be that person who drops everything for others, but somehow forgets yourself inabout You Can’t Pour From an Empty Cup: 16 Reasons Why You Should Love Yourself First Before Anyone Else", "There comes a moment in most long-term relationships when things feel different. Life takes over, work, bills, the never-ending to-do lists, and suddenly, the magic thatabout 16 Reasons Why Renewing Wedding Vows Can Bring Back The Spark You Thought Was Lost", "Somewhere along the way, people started selling marriage like it was a gym membership. “No pain, no gain!” they said. But love was never supposed to feel like boot campabout Marriage Was Never Supposed to Be “Hard”: 15 Signs You Married the Wrong Person", "Let’s be real here. Men don’t wake up one morning and decide, “You know what? I’m done.” Nope. It’s a slow fade, a death by a thousand eye rolls, sighs, andabout Husbands Lose Interest Quickly When Their Wives Do These 15 Annoying Things", "Women form opinions about men faster than most guys realize—sometimes in under ten seconds. You don’t need to play games or pretend to be someone else, but you do need toabout 15 Best (and Worst) Traits Women Notice First in a Man", "Words are like fingerprints. They leave marks that never fully fade, especially in marriage. Men might forget dates or small fights, but they don’t forget the words thatabout 17 Best (and Worst) Things Wives Say That Stick With Their Husbands Forever", "Every man has opinions on what kind of woman makes marriage work. But the truth hits harder once you’ve lived through a few years of it—or survived a divorce. Ask menabout 17 Best (and Worst) Types of Women to Marry, According to Men Who’ve Been There", "Every husband walks into marriage carrying a lifetime of habits he doesn’t even think about. Some of those habits build connection, respect, and peace. Others chip awayabout 17 Best (and Worst) Habits Husbands Bring Into Marriage", "You can tell a lot about a man by how he handles himself when no one’s watching. The truth? Most men can fake confidence or charm for a while, but the rare ones haveabout He’s A Total Catch If He Has These 17 Rare Traits", "You know what’s exhausting? Doing stuff that’s supposed to scream “I love you” and getting crickets in return. Husbands aren’t perfect, not evenabout Husbands Are Sick and Tired of Their Wives Not Appreciating These 17 Thoughtful Gestures", "Catching a cheater goes beyond lipstick on the collar or late-night texts from “coworkers.” It’s about noticing the small details, the inconsistencies, and the strangeabout These 16 Signs Will Help You Spot a Cheater From a Mile Away", "Once upon a time, courting actually meant something. A guy would dress up, show up, and mean it when he said he was interested. Letters got written, plans wereabout 15 Reasons Why Courting a Woman Has Become a Lost Art in Today’s World", "You’ve probably met one, the woman who swears she’s “seeing where things go,” but deep down, she’s already made up her mind that you’re not the one. She’s there for theabout 16 Terrible Excuses Women Love to Make When They’re Just Dating You for Convenience", "Cheating doesn’t always mean sleeping with someone else. Sometimes it’s the flirty texts, the secret compliments, the hidden messages that “don’t mean anything.” But whenabout 15 Reasons Why Micro-Cheating Is Just as Bad as Actual Cheating", "Love shines brightest through the everyday things we do. It’s those small gestures that tell your partner, “Hey, you matter to me.” The soft words, theabout 17 Small Ways to Show Your Partner That You Appreciate Them", "Love wasn't a contest, but it certainly has turned into one in these times. No one has been affected more deeply by the capriciousness and utter contrivances that modernabout Modern Love and 15 Reasons Why Men are Tired of Competing for It", "Men don't go quiet without reason. This happens when they feel they aren't being appreciated any longer and their contributions are trivialized at every turn. This worldabout He’s Not Cold: 17 Reasons Why He’s Tired of Being Taken for Granted", "No one thinks about the possibility of divorce when they are walking down the aisle, making vows, or kissing their beloved wife. They staunchly believe that life holdsabout The Silent Breakup Triggers: 17 Top Reasons Why Couples End Up Divorcing", "Have you ever felt like you were just destined to meet someone? It is as if fate itself was conspiring to cross your paths together, and as if the university was silentlyabout 17 Signs You’re Living the “Invisible String Theory” in Your Love Life", "Being a good husband isn’t about having a perfect life or a fat paycheck. What actually keeps a marriage strong are the traits you show every day when no one’s watching.about 14 Personality Traits That Predict a Man Will Be a Loving, Long-Term Husband", "If you’ve noticed more women in your circle seem fine being single or unwilling to settle, you’re not imagining it. Women are rewriting the rules on what partnershipabout 17 Reasons Women Are Choosing Single Life Over Settling for Less", "Let’s be honest: dating in 2025 feels like a completely different sport, and a lot of men don’t even realize the rules have changed. Women have adapted, evolved, andabout 17 Reasons Single Women Are Winning at Modern Dating (and Men Are Quietly Losing Ground)", "Most men think attraction starts with looks, but the truth is, women remember how a man makes them feel long after they forget what he wore. It’s not the car, the abs, orabout 15 Things That Make Women Fall for a Man — and It’s Not His Face or Body", "A man’s dignity doesn’t come from how much he earns or how much he can endure. It comes from the standards he holds and the boundaries he keeps. When you’ve grown throughabout 15 Things Every Man With Dignity Refuses to Tolerate in a Relationship", "You can hold down a job, fix the leaks, show up for everyone, and still feel invisible at home. It’s a quiet pain most men won’t admit out loud. When appreciation fades,about Men Admit These 15 Things Hurt When Their Wives Don’t Appreciate Them", "", "Home•Blog•Resources•Contact•Advertise", "", "Privacy Policy & Affiliate Disclosure•Terms & Conditions•Sitemap", "", "As an Amazon Associate I earn from qualifying purchases.", "", "Copyright © 2025 The Modest Man (Registered Trademark)"], "word_count": 1296, "content_type": "general", "normalized_url": "https://www.themodestman.com/blog", "site_name": "The Modest Man", "site_domain": "themodestman.com"}
{"url": "https://www.amazon.com/dp/b002vwk5qy?tag=themodestman-20", "title": "Alpha Industries MA-1 Bomber Flight Jacket - Fighter Pilot Flight Jacket", "author": null, "publish_date": null, "text": "We offer easy, convenient returns with at least one free return option: no shipping charges. All returns must comply with our returns policy. Visit the Store Visit the Store Visit the Store Visit the Store Visit the Store In 1959 Alpha Industries was commissioned by the department of defense to design and manufacture high performance outerwear for the U.S. military. The company quickly became synonymous with developing the iconic MA-1, M-65, and N-3B trusted by soldiers, sailors and aviators to protect them from the most dire conditions across the land, sea and air. Today, Alpha’s mission is to protect and inspire heroism in all forms by outfitting men and women to realize their limitless potential. Product Specs  Recommended Weather  Recommended Care  Constructed from mid-weight flight nylon with water resistance, the MA-1 fighter pilot jacket was one of the first military flight jacket to cross over into civilian fashion. This current version has been kept as close as possible to the classic military specifications.         Introduced by the mid-1950s, the MA-1 became the flight jacket of U.S. Air Force and Navy pilots and ground crew. Designed for use in temperatures of 14-50 degrees F, the MA-1 had a 100% wool knit collar, waistband and cuffs. The MA-1 discarded the mouton fur collar of its predecessor, the B-15, because it interfered with the parachute harness worn by aviators. Other features of the jacket included a tab that the oxygen mask was clipped to, tabs to hold the headset wires in place and the original U.S. Air Force decal. These features were eventually removed from the flight jacket as it was adopted by other branches of the U.S. Armed Forces and equipment for pilots changed. The ma-1 or bomber jacket was first developed in the mid-1950s. The ma-1 and its predecessor, the b-15 flight jacket, were needed at that time because the emergence of the jet age created new requirements for pilot performance, safety and comfort. The jacket was warm enough when flying in cold temperatures. An ma-1 mid-weight nylon jacket is water/weather resistant. The ma-1 navy fighter pilot jacket was the first military flight jacket to cross over into civilian fashion. Our nylon flight jacket includes a knit collar, cuffs and waistband, as well as a heavy gauge brass zipper with storm flap for warmth. Our ma-1 jackets are reversible to bright orange, making them ideal for rescue missions and other times when visibility is imperative. This current version has been kept as close as possible to the classic specifications, which debuted in 1950. In 1963 the jacket received substantial revisions by changing the lining to bright orange and making the jacket reversible. The flight jacket design conveys positive images of strength, power and quality **please note that the original color 'navy' ordered by the u.s. Military is more of a teal shade to it...rather than the darker 'navy blue' traditional jackets are known for. The Alpha MA-1 Flight Jacket, often copied but never duplicated. This is the classic jacket made by Alpha Industries for the military for over 40 years; issued to both the U.S. Air Force and Navy pilots. Customer Reviews, including Product Star Ratings help customers to learn more about the product and decide whether it is the right product for them. To calculate the overall star rating and percentage breakdown by star, we don’t use a simple average. Instead, our system considers things like how recent a review is and if the reviewer bought the item on Amazon. It also analyzed reviews to verify trustworthiness. Customers find the flight jacket's quality excellent, with one noting it's a great 3-season option, and they appreciate its well-insulated design that keeps them warm in winter. The jacket receives positive feedback for its style, comfort, and value for money, with customers describing it as cozy and well-designed. Regarding size and length, while some find it true to size and perfect in length, others report it runs large and is too short. AI Generated from the text of customer reviews Customers praise the quality of the flight jacket, describing it as a bomber that's perfect for its intended use. \"Great jacket. Classic look. Much warmer than the information would lead you to believe. Thicker than expected. Made using the best materials....\"Read more \"...However, that aside, it's agreat jacket, I only paid $80 for the Navy (which isn't quite Navy, more of a blue-green) not a whole lot to complain...\"Read more \"Nice jacket, my son loved it. Runs a bit small but I guess that's how it is designed to fit\"Read more \"I love this jacket.Great quality, warm and versatile. I'm 5'9\" 176lbs, 41\" chest, 32\" waist, 16\" arms, muscular athletic build....\"Read more Customers like how the jacket fits, with one mentioning the baggy sleeves. \"...It is alpha. No doubt! I am 5.08\" and 32inch... Medium isperfect fit. Good for spring and autumn. Early winter also no problm.\"Read more \"...Purchased for my 50 yr. old son in XLTall. [6'1'' 200+Lbs].Perfect fit, very well made! One of the best buys I've made from Amazon!...\"Read more \"JUST AS ADVERTISED.Great fitand quality. came quickly in mail/ups. The MA1 was the primo wwii jacket with a fur collar AF in Alaska....\"Read more \"...In the regular cut medium, thesleeves were too longand the length of the jacket was also too long. The chest was also very big....\"Read more Customers find the jacket well insulated and super warm in winter, particularly noting its effectiveness in cold Nebraska winters and during fall and early winter seasons. \"I love this jacket. Great quality,warmand versatile. I'm 5'9\" 176lbs, 41\" chest, 32\" waist, 16\" arms, muscular athletic build....\"Read more \"...its nice and thick, and you can tell its well made. Itsvery warm, and fits a tad bit strangely, but maybe im not used to the bomber style jacket....\"Read more \"Great Jacket.Very warm. Good jacket but not recommended for a lot of activity. The jacket gets really hot if you move around too much....\"Read more \"This is my second MA-1. Love these coats.Warm, lightweight, excellent quality! Highly recommend!\"Read more Customers appreciate the jacket's style, describing it as well-designed and good-looking, with one customer noting its modernist vibe. \"looks greatand feels well made. I sized up based on other reviews, but probably would have been fine ordering my regular size....\"Read more \"...Quality is very good, looks very classy andstylishand the price is much lover than for the same quality jackets (Carhart etc.)....\"Read more \"Love the jacket. Well made. Fits perfect.Looks great. My only complaint in that it's made in China. These jackets used to be made in Tennessee....\"Read more \"Great looking jacket.\"Read more Customers find the flight jacket to be a great value for the money. \"...Great quaility at agreat price...a must! Not to mention very stylish\"Read more \"I love this jacket!!!Great price, looks and feels great. Just like the one I had in the Marine Corps.\"Read more \"Excellent Quality forgood price,$63, jacket was over $100 at other vendors. Ordered sat and delivered Monday morning\"Read more \"...The jacket fits perfectly. Coat was pricey but it wasworth the moneyto see the happy smile on my husband's face....\"Read more Customers find the flight jacket comfortable and cozy. \"This is a great jacket that iscomfortable, keeps you warm and dry, and I only wish it had a hood. Otherwise, It fit exactly like I expected.\"Read more \"...This one isvery comfortableand warm. Zippers are heavy duty, pockets snaps robust, and the seam work appears to be good quality.\"Read more \"Really well made jacket. Very warm.Very comfortable. I'd be hard-pressed to pay retail, but at less than half, it's a great jacket.\"Read more \"Perfect Jacket. It provides a high level of warmth andcomfortwithout sacrificing in style at all. A jacket like this is a rare find....\"Read more Customers have mixed opinions about the jacket's size, with some finding it true to size while others report that it runs large, particularly noting that the arms are disproportionately wide. \"The jacket is very good and I liked the color. Unfortunated it wastoo small. I am 6”, 195 lbs. My measurements put me in a large....\"Read more \"...Well made, warm, andtrue to size, unlike many \"replica\" flight jackets on the market. If you purchase one, you'll not regret it.\"Read more \"Wayto smalland short for my size. I ordered an XL (6'2\" and 225lbs) and it rides above my belly button ....\"Read more \"...The classic fit (this one) definitelyruns a little large(a medium fits like a large) but I believe that is how it was intended to fit....\"Read more Customers have mixed opinions about the length of the jacket, with some finding it perfect while others report it being too short. \"...I could fit a sweatshirt underneath. Thesleeve length is perfect(normally a 32/33 sleeve length)....\"Read more \"...The large jacket was tight in the shoulders and chest, plus thesleeves were short. I reordered an XL which fits perfectly....\"Read more \"...It fit perfect in body length, chest and hip width andsleeve length. I would definitely say it is worth the money!\"Read more \"...Thesleeves run long, but I expected that....\"Read more", "paragraphs": ["We offer easy, convenient returns with at least one free return option: no shipping charges. All returns must comply with our returns policy.", "Visit the Store", "Visit the Store", "Visit the Store", "Visit the Store", "Visit the Store", "In 1959 Alpha Industries was commissioned by the department of defense to design and manufacture high performance outerwear for the U.S. military. The company quickly became synonymous with developing the iconic MA-1, M-65, and N-3B trusted by soldiers, sailors and aviators to protect them from the most dire conditions across the land, sea and air. Today, Alpha’s mission is to protect and inspire heroism in all forms by outfitting men and women to realize their limitless potential.", "Product Specs", "", "Recommended Weather", "", "Recommended Care", "", "Constructed from mid-weight flight nylon with water resistance, the MA-1 fighter pilot jacket was one of the first military flight jacket to cross over into civilian fashion. This current version has been kept as close as possible to the classic military specifications.", "", "", "", "", "", "", "", "", "Introduced by the mid-1950s, the MA-1 became the flight jacket of U.S. Air Force and Navy pilots and ground crew. Designed for use in temperatures of 14-50 degrees F, the MA-1 had a 100% wool knit collar, waistband and cuffs. The MA-1 discarded the mouton fur collar of its predecessor, the B-15, because it interfered with the parachute harness worn by aviators. Other features of the jacket included a tab that the oxygen mask was clipped to, tabs to hold the headset wires in place and the original U.S. Air Force decal. These features were eventually removed from the flight jacket as it was adopted by other branches of the U.S. Armed Forces and equipment for pilots changed.", "The ma-1 or bomber jacket was first developed in the mid-1950s. The ma-1 and its predecessor, the b-15 flight jacket, were needed at that time because the emergence of the jet age created new requirements for pilot performance, safety and comfort. The jacket was warm enough when flying in cold temperatures. An ma-1 mid-weight nylon jacket is water/weather resistant. The ma-1 navy fighter pilot jacket was the first military flight jacket to cross over into civilian fashion. Our nylon flight jacket includes a knit collar, cuffs and waistband, as well as a heavy gauge brass zipper with storm flap for warmth. Our ma-1 jackets are reversible to bright orange, making them ideal for rescue missions and other times when visibility is imperative. This current version has been kept as close as possible to the classic specifications, which debuted in 1950. In 1963 the jacket received substantial revisions by changing the lining to bright orange and making the jacket reversible. The flight jacket design conveys positive images of strength, power and quality **please note that the original color 'navy' ordered by the u.s. Military is more of a teal shade to it...rather than the darker 'navy blue' traditional jackets are known for.", "The Alpha MA-1 Flight Jacket, often copied but never duplicated. This is the classic jacket made by Alpha Industries for the military for over 40 years; issued to both the U.S. Air Force and Navy pilots.", "Customer Reviews, including Product Star Ratings help customers to learn more about the product and decide whether it is the right product for them.", "To calculate the overall star rating and percentage breakdown by star, we don’t use a simple average. Instead, our system considers things like how recent a review is and if the reviewer bought the item on Amazon. It also analyzed reviews to verify trustworthiness.", "Customers find the flight jacket's quality excellent, with one noting it's a great 3-season option, and they appreciate its well-insulated design that keeps them warm in winter. The jacket receives positive feedback for its style, comfort, and value for money, with customers describing it as cozy and well-designed. Regarding size and length, while some find it true to size and perfect in length, others report it runs large and is too short.", "AI Generated from the text of customer reviews", "Customers praise the quality of the flight jacket, describing it as a bomber that's perfect for its intended use.", "\"Great jacket. Classic look. Much warmer than the information would lead you to believe. Thicker than expected. Made using the best materials....\"Read more", "\"...However, that aside, it's agreat jacket, I only paid $80 for the Navy (which isn't quite Navy, more of a blue-green) not a whole lot to complain...\"Read more", "\"Nice jacket, my son loved it. Runs a bit small but I guess that's how it is designed to fit\"Read more", "\"I love this jacket.Great quality, warm and versatile. I'm 5'9\" 176lbs, 41\" chest, 32\" waist, 16\" arms, muscular athletic build....\"Read more", "Customers like how the jacket fits, with one mentioning the baggy sleeves.", "\"...It is alpha. No doubt! I am 5.08\" and 32inch... Medium isperfect fit. Good for spring and autumn. Early winter also no problm.\"Read more", "\"...Purchased for my 50 yr. old son in XLTall. [6'1'' 200+Lbs].Perfect fit, very well made! One of the best buys I've made from Amazon!...\"Read more", "\"JUST AS ADVERTISED.Great fitand quality. came quickly in mail/ups. The MA1 was the primo wwii jacket with a fur collar AF in Alaska....\"Read more", "\"...In the regular cut medium, thesleeves were too longand the length of the jacket was also too long. The chest was also very big....\"Read more", "Customers find the jacket well insulated and super warm in winter, particularly noting its effectiveness in cold Nebraska winters and during fall and early winter seasons.", "\"I love this jacket. Great quality,warmand versatile. I'm 5'9\" 176lbs, 41\" chest, 32\" waist, 16\" arms, muscular athletic build....\"Read more", "\"...its nice and thick, and you can tell its well made. Itsvery warm, and fits a tad bit strangely, but maybe im not used to the bomber style jacket....\"Read more", "\"Great Jacket.Very warm. Good jacket but not recommended for a lot of activity. The jacket gets really hot if you move around too much....\"Read more", "\"This is my second MA-1. Love these coats.Warm, lightweight, excellent quality! Highly recommend!\"Read more", "Customers appreciate the jacket's style, describing it as well-designed and good-looking, with one customer noting its modernist vibe.", "\"looks greatand feels well made. I sized up based on other reviews, but probably would have been fine ordering my regular size....\"Read more", "\"...Quality is very good, looks very classy andstylishand the price is much lover than for the same quality jackets (Carhart etc.)....\"Read more", "\"Love the jacket. Well made. Fits perfect.Looks great. My only complaint in that it's made in China. These jackets used to be made in Tennessee....\"Read more", "\"Great looking jacket.\"Read more", "Customers find the flight jacket to be a great value for the money.", "\"...Great quaility at agreat price...a must! Not to mention very stylish\"Read more", "\"I love this jacket!!!Great price, looks and feels great. Just like the one I had in the Marine Corps.\"Read more", "\"Excellent Quality forgood price,$63, jacket was over $100 at other vendors. Ordered sat and delivered Monday morning\"Read more", "\"...The jacket fits perfectly. Coat was pricey but it wasworth the moneyto see the happy smile on my husband's face....\"Read more", "Customers find the flight jacket comfortable and cozy.", "\"This is a great jacket that iscomfortable, keeps you warm and dry, and I only wish it had a hood. Otherwise, It fit exactly like I expected.\"Read more", "\"...This one isvery comfortableand warm. Zippers are heavy duty, pockets snaps robust, and the seam work appears to be good quality.\"Read more", "\"Really well made jacket. Very warm.Very comfortable. I'd be hard-pressed to pay retail, but at less than half, it's a great jacket.\"Read more", "\"Perfect Jacket. It provides a high level of warmth andcomfortwithout sacrificing in style at all. A jacket like this is a rare find....\"Read more", "Customers have mixed opinions about the jacket's size, with some finding it true to size while others report that it runs large, particularly noting that the arms are disproportionately wide.", "\"The jacket is very good and I liked the color. Unfortunated it wastoo small. I am 6”, 195 lbs. My measurements put me in a large....\"Read more", "\"...Well made, warm, andtrue to size, unlike many \"replica\" flight jackets on the market. If you purchase one, you'll not regret it.\"Read more", "\"Wayto smalland short for my size. I ordered an XL (6'2\" and 225lbs) and it rides above my belly button ....\"Read more", "\"...The classic fit (this one) definitelyruns a little large(a medium fits like a large) but I believe that is how it was intended to fit....\"Read more", "Customers have mixed opinions about the length of the jacket, with some finding it perfect while others report it being too short.", "\"...I could fit a sweatshirt underneath. Thesleeve length is perfect(normally a 32/33 sleeve length)....\"Read more", "\"...The large jacket was tight in the shoulders and chest, plus thesleeves were short. I reordered an XL which fits perfectly....\"Read more", "\"...It fit perfect in body length, chest and hip width andsleeve length. I would definitely say it is worth the money!\"Read more", "\"...Thesleeves run long, but I expected that....\"Read more"], "word_count": 1502, "content_type": "general", "normalized_url": "https://www.amazon.com/dp/b002vwk5qy?tag=themodestman-20", "site_name": "The Modest Man", "site_domain": "themodestman.com"}
{"url": "https://www.themodestman.com/buck-mason-bruiser-leather-bomber-jacket", "title": "Black Leather Bruiser Bomber", "author": null, "publish_date": null, "text": "Vintage fit hand-cut bomber jacket in semi-vegetable tanned sheepskin. Two-stage dye process: first, the leather crust is dyed, then a second top dye is applied for a more natural patina. Details include angled zip pockets at the hips and cotton/wool ribbed cuffs and waistband with racking stitch detail. Features Bemberg™ lining. Garment washed, waxed, and hand-burnished for a lived-in feel. Vintage fit bomber jacket with angled zip welt pockets at hips, ribbing at the cuffs and waistband, and quilted Bemberg® lining. Model info Model is 6'3\", weighs 180lbs and wears a Large Semi-vegetable tanned sheepskin with a supple texture. Washed, waxed, and hand-burnished for a lived-in feel. Care Professional dry clean by leather and suede experts Origin Import.Learn more We accept returns and exchanges within 365 days of purchase as long as the products are still as good \n              as new with original tags intact. Come by the store for a free on-the-spot return or exchange. If you’d rather return by mail, please \n              note the $8 deduction to cover handling costs. Due to our commitment to delivering the best experience to our customers, we are unable to accept \n              returns of shoes that show signs of wear or damage. We appreciate your understanding in this matter. Vintage fit hand-cut bomber jacket in semi-vegetable tanned sheepskin. Two-stage dye process: first, the leather crust is dyed, then a second top dye is applied for a more natural patina. Details include angled zip pockets at the hips and cotton/wool ribbed cuffs and waistband with racking stitch detail. Features Bemberg™ lining. Garment washed, waxed, and hand-burnished for a lived-in feel. Vintage fit bomber jacket with angled zip welt pockets at hips, ribbing at the cuffs and waistband, and quilted Bemberg® lining. Model info Model is 6'3\", weighs 180lbs and wears a Large Semi-vegetable tanned sheepskin with a supple texture. Washed, waxed, and hand-burnished for a lived-in feel. Care Professional dry clean by leather and suede experts Origin Import.Learn more We accept returns and exchanges within 365 days of purchase as long as the products are still as good \n              as new with original tags intact. Come by the store for a free on-the-spot return or exchange. If you’d rather return by mail, please \n              note the $8 deduction to cover handling costs. Due to our commitment to delivering the best experience to our customers, we are unable to accept \n              returns of shoes that show signs of wear or damage. We appreciate your understanding in this matter.", "paragraphs": ["Vintage fit hand-cut bomber jacket in semi-vegetable tanned sheepskin. Two-stage dye process: first, the leather crust is dyed, then a second top dye is applied for a more natural patina. Details include angled zip pockets at the hips and cotton/wool ribbed cuffs and waistband with racking stitch detail. Features Bemberg™ lining. Garment washed, waxed, and hand-burnished for a lived-in feel.", "Vintage fit bomber jacket with angled zip welt pockets at hips, ribbing at the cuffs and waistband, and quilted Bemberg® lining.", "Model info", "Model is 6'3\", weighs 180lbs and wears a Large", "Semi-vegetable tanned sheepskin with a supple texture. Washed, waxed, and hand-burnished for a lived-in feel.", "Care", "Professional dry clean by leather and suede experts", "Origin", "Import.Learn more", "We accept returns and exchanges within 365 days of purchase as long as the products are still as good \n              as new with original tags intact.", "Come by the store for a free on-the-spot return or exchange. If you’d rather return by mail, please \n              note the $8 deduction to cover handling costs.", "Due to our commitment to delivering the best experience to our customers, we are unable to accept \n              returns of shoes that show signs of wear or damage. We appreciate your understanding in this matter.", "Vintage fit hand-cut bomber jacket in semi-vegetable tanned sheepskin. Two-stage dye process: first, the leather crust is dyed, then a second top dye is applied for a more natural patina. Details include angled zip pockets at the hips and cotton/wool ribbed cuffs and waistband with racking stitch detail. Features Bemberg™ lining. Garment washed, waxed, and hand-burnished for a lived-in feel.", "Vintage fit bomber jacket with angled zip welt pockets at hips, ribbing at the cuffs and waistband, and quilted Bemberg® lining.", "Model info", "Model is 6'3\", weighs 180lbs and wears a Large", "Semi-vegetable tanned sheepskin with a supple texture. Washed, waxed, and hand-burnished for a lived-in feel.", "Care", "Professional dry clean by leather and suede experts", "Origin", "Import.Learn more", "We accept returns and exchanges within 365 days of purchase as long as the products are still as good \n              as new with original tags intact.", "Come by the store for a free on-the-spot return or exchange. If you’d rather return by mail, please \n              note the $8 deduction to cover handling costs.", "Due to our commitment to delivering the best experience to our customers, we are unable to accept \n              returns of shoes that show signs of wear or damage. We appreciate your understanding in this matter."], "word_count": 408, "content_type": "general", "normalized_url": "https://www.themodestman.com/buck-mason-bruiser-leather-bomber-jacket", "site_name": "The Modest Man", "site_domain": "themodestman.com"}
{"url": "https://www.themodestman.com/taylor-stitch-the-bomber-jacket-sierra-suede", "title": "The Bomber Jacketin Sierra Suede", "author": null, "publish_date": null, "text": "No longer available for purchase.Don't want to miss out on future launches?Sign up for marketing emails to hear about new products, collaborations & more.   Sleeve length is measured from center back. Length is measured from center back neck. Button or zip up your jacket and lay it flat on a hard surface. Measure across the chest area of the jacket\n            about an inch down from the underarm seam, and double that for the full chest measurement. Measure straight across the back of the jacket, from one shoulder seam to the other. Measure from the top of the shoulder seam to the end of the cuff. Next, measure from the center back of the\n            neck seam to the shoulder seam. Add these two values to get your sleeve measurements. Measure straight down the back of the jacket, from the center of the neck seam to the bottom of the hem. Measure around the fullest part of your chest, keeping the tape parallel to the floor. The tape should be\n            snug, but not too tight. With your arm bent slightly, measure from the base of the center back of your neck, along your shoulder,\n            then over your elbow to your wrist bone. The bomber jacket is a bonafide American classic, so when it came time for us to design one of our own, we pulled out all the stops. The Bomber in Sierra Suede stays true to its storied lineage with a flattering shorter cut, YKK zip front (reminiscent of the A-2 flight jackets of the 1930s), and burly ribbing at every opening. But where this jacket truly breaks from the pack is in the materials department. With a 3-oz calf suede outer that was made to take a beating, The Bomber in Sierra Suede will up the altitude on any outfit, even decades down the line. Think all suede needs to be brushed and babied? Think again. This top-tier 3-oz calf suede has a buttery smooth handfeel and enough heft to stand up to years of high flying adventure. So go ahead, wear it often and wear it hard, The Bomber in Sierra Suede will thank you with a complex patina that’ll really wow the grandkids when it comes time to pass it on. Warmth late into fall or through the winter if you run hot. This product is part of a small batch manufacturing run that may use exclusive materials like dead stock fabrics. The product is limited in quantity and may never be in stock again. Limited products are available for immediate shipping. Don't have an account?Sign up Please check your email for password reset instructions. Forgot Your Password?Reset it now In order to change your password, we need to verify your identity. Please enter\n    your email address. Already have an account?Log In By registering, you agree to ourTerms of Use&Privacy Policy.", "paragraphs": ["No longer available for purchase.Don't want to miss out on future launches?Sign up for marketing emails to hear about new products, collaborations & more.", "", "", "Sleeve length is measured from center back.", "Length is measured from center back neck.", "Button or zip up your jacket and lay it flat on a hard surface. Measure across the chest area of the jacket\n            about an inch down from the underarm seam, and double that for the full chest measurement.", "Measure straight across the back of the jacket, from one shoulder seam to the other.", "Measure from the top of the shoulder seam to the end of the cuff. Next, measure from the center back of the\n            neck seam to the shoulder seam. Add these two values to get your sleeve measurements.", "Measure straight down the back of the jacket, from the center of the neck seam to the bottom of the hem.", "Measure around the fullest part of your chest, keeping the tape parallel to the floor. The tape should be\n            snug, but not too tight.", "With your arm bent slightly, measure from the base of the center back of your neck, along your shoulder,\n            then over your elbow to your wrist bone.", "The bomber jacket is a bonafide American classic, so when it came time for us to design one of our own, we pulled out all the stops. The Bomber in Sierra Suede stays true to its storied lineage with a flattering shorter cut, YKK zip front (reminiscent of the A-2 flight jackets of the 1930s), and burly ribbing at every opening. But where this jacket truly breaks from the pack is in the materials department. With a 3-oz calf suede outer that was made to take a beating, The Bomber in Sierra Suede will up the altitude on any outfit, even decades down the line.", "Think all suede needs to be brushed and babied? Think again. This top-tier 3-oz calf suede has a buttery smooth handfeel and enough heft to stand up to years of high flying adventure. So go ahead, wear it often and wear it hard, The Bomber in Sierra Suede will thank you with a complex patina that’ll really wow the grandkids when it comes time to pass it on.", "Warmth late into fall or through the winter if you run hot.", "This product is part of a small batch manufacturing run that may use exclusive materials like dead stock fabrics. The product is limited in quantity and may never be in stock again. Limited products are available for immediate shipping.", "Don't have an account?Sign up", "Please check your email for password reset instructions.", "Forgot Your Password?Reset it now", "In order to change your password, we need to verify your identity. Please enter\n    your email address.", "Already have an account?Log In", "By registering, you agree to ourTerms of Use&Privacy Policy."], "word_count": 473, "content_type": "general", "normalized_url": "https://www.themodestman.com/taylor-stitch-the-bomber-jacket-sierra-suede", "site_name": "The Modest Man", "site_domain": "themodestman.com"}
