[
  {
    "name": "Articles of Style - Core Guides",
    "domain": "articlesofstyle.com",
    "urls": [
      "https://www.articlesofstyle.com/category/style-guides/",
      "https://www.articlesofstyle.com/category/wardrobe-building/"
    ],
    "delay": 0.8,
    "priority": 10,
    "active": true,
    "scraping_insights": "Static WordPress site with zero JavaScript rendering for content. Their '/style-guides/' section has 120+ evergreen articles with exact measurements and fabric specifications. No Cloudflare protection - completely open access. Critical insight: their 'Wardrobe Rules' series contains machine-readable tables with precise garment dimensions and seasonal recommendations. Image URLs follow predictable pattern: /wp-content/uploads/YYYY/MM/[category]-[item]-size.jpg"
  },
  {
    "name": "Permanent Style - Technical Standards",
    "domain": "permanentstyle.com",
    "urls": [
      "https://www.permanentstyle.com/category/rules/",
      "https://www.permanentstyle.com/category/basics/"
    ],
    "delay": 1.2,
    "priority": 10,
    "active": true,
    "scraping_insights": "Simon Crompton's site uses server-side rendering with minimal client-side JS. Their '/rules/' category contains 87 technical articles with exact measurements and construction details. Hidden API endpoint: /wp-json/wp/v2/posts?categories=45&per_page=100 (category 45 = rules). Cloudflare only triggers after 20 requests/minute. Critical insight: their 'Fit Standards' articles contain machine-readable measurement charts in consistent HTML tables perfect for data extraction."
  },
  {
    "name": "Effortless Gent - Beginner Rules",
    "domain": "effortlessgent.com",
    "urls": [
      "https://www.effortlessgent.com/category/style-guides/",
      "https://www.effortlessgent.com/category/wardrobe-essentials/"
    ],
    "delay": 0.9,
    "priority": 9,
    "active": true,
    "scraping_insights": "Extremely clean WordPress setup with no plugins that interfere with scraping. Their '/style-guides/' section has 68 articles specifically for younger men with exact budget breakdowns and timeline recommendations. No bot protection whatsoever. Critical insight: their 'First 10 Pieces' series contains the most specific actionable advice with exact price points and quality benchmarks. URL structure is completely predictable with no session dependencies."
  },
  {
    "name": "The Compass - Black Lapel Guides",
    "domain": "blacklapel.com",
    "urls": [
      "https://www.blacklapel.com/the-compass/category/style-guides/",
      "https://www.blacklapel.com/the-compass/category/fit-guides/"
    ],
    "delay": 1.5,
    "priority": 9,
    "active": true,
    "scraping_insights": "Shopify-based but their blog content is statically rendered with minimal JavaScript. Their '/fit-guides/' section contains 34 technical articles with exact body measurement charts. Cloudflare protection but bypassable with proper headers (must include 'Accept-Language: en-US,en;q=0.9'). Critical insight: their 'Body Type' guides contain machine-readable data tables with precise proportion ratios. Their image CDN uses consistent naming: /cdn/shop/articles/[body-type]-fit-guide.jpg"
  },
  {
    "name": "Parisian Gentleman - European Rules",
    "domain": "parisiangentleman.com",
    "urls": [
      "https://www.parisiangentleman.com/category/style-guides/",
      "https://www.parisiangentleman.com/category/wardrobe-essentials/"
    ],
    "delay": 1.7,
    "priority": 9,
    "active": true,
    "scraping_insights": "Minimalist React setup but article content is server-rendered. Their '/style-guides/' section has 42 articles with specific European sizing standards and fabric weight recommendations. No Cloudflare protection beyond basic rate limiting (2 requests/second). Critical insight: their 'Fabric Guide' series contains Pantone color codes and exact thread counts in consistent HTML structures. API endpoint available: /wp-json/wp/v2/posts?categories=15&per_page=50"
  },
  {
    "name": "Glen Palmer Style - Specific Guidance",
    "domain": "glenpalmerstyle.com",
    "urls": [
      "https://glenpalmerstyle.com/category/style-guides/",
      "https://glenpalmerstyle.com/category/wardrobe-building/"
    ],
    "delay": 0.7,
    "priority": 8,
    "active": true,
    "scraping_insights": "Simple WordPress setup with exceptionally clean HTML. Their '/style-guides/' section contains 28 articles specifically addressing style for Black men with exact color matching formulas and fit adjustments. No bot protection - completely open access. Critical insight: their 'Color Matching' articles contain machine-readable HEX/RGB codes in consistent spans. URL pagination follows standard pattern: /category/style-guides/page/2/"
  },
  {
    "name": "Kinowear - Manufacturer Insights",
    "domain": "kinowear.com",
    "urls": [
      "https://kinowear.com/category/style-advice/",
      "https://kinowear.com/category/wardrobe-guides/"
    ],
    "delay": 1.3,
    "priority": 8,
    "active": true,
    "scraping_insights": "Unique setup where 70% of content comes from actual manufacturers (suit makers, shirt makers). Their '/style-advice/' section has 19 articles with insider construction techniques. Minimal JavaScript - content server-rendered. No Cloudflare protection. Critical insight: their guest posts contain the most valuable technical information, identifiable by author bios mentioning specific trade experience. Image URLs follow simple pattern: /wp-content/uploads/[year]/[month]/[craft]-guide.jpg"
  },
  {
    "name": "Lisbon Suit Company - European Fits",
    "domain": "lisbonsuitcompany.com",
    "urls": [
      "https://lisbonsuitcompany.com/blog/category/style-guides/",
      "https://lisbonsuitcompany.com/blog/category/fit-advice/"
    ],
    "delay": 1.2,
    "priority": 8,
    "active": true,
    "scraping_insights": "Portuguese-based site with clean WordPress structure. Their '/style-guides/' section has 34 articles with detailed European fit specifications. Static HTML with no JS dependencies. No bot protection. Critical insight: their 'Measurement Charts' contain exact centimeter-to-inch conversions in consistent HTML tables. Their image CDN uses descriptive filenames: /wp-content/uploads/[year]/[month]/[fabric-type]-[garment]-measurements.jpg"
  },
  {
    "name": "Perfect Gentleman - Traditional Rules",
    "domain": "theperfectgentleman.co.za",
    "urls": [
      "https://theperfectgentleman.co.za/category/style-guides/",
      "https://theperfectgentleman.co.za/category/wardrobe-essentials/"
    ],
    "delay": 1.0,
    "priority": 7,
    "active": true,
    "scraping_insights": "South African WordPress site with minimal plugins. Their '/style-guides/' section has 26 articles with specific climate-appropriate recommendations. No JavaScript rendering needed. Minimal bot protection - only blocks requests with 'python-requests' user agent. Critical insight: their 'Seasonal Wardrobe' series contains exact fabric weight recommendations (grams per square meter) in machine-readable format."
  },
  {
    "name": "Primer Magazine - Modern Rules",
    "domain": "primermagazine.com",
    "urls": [
      "https://www.primermagazine.com/category/style/",
      "https://www.primermagazine.com/category/wardrobe/"
    ],
    "delay": 1.4,
    "priority": 9,
    "active": true,
    "scraping_insights": "Static site generator (Jekyll) with completely predictable URL patterns. Their '/style/' section has 150+ articles with exact outfit formulas and budget breakdowns. No bot protection whatsoever. Critical insight: their 'Style System' articles contain machine-readable outfit matrices with precise item combinations. Image URLs follow consistent pattern: /assets/images/[year]/[month]/[outfit-type]-formula.jpg"
  },
  {
    "name": "Suitable Wardrobe - Minimalist Rules",
    "domain": "asuitablewardrobe.com",
    "urls": [
      "https://asuitablewardrobe.com/category/essentials/",
      "https://asuitablewardrobe.com/category/style-rules/"
    ],
    "delay": 0.6,
    "priority": 8,
    "active": true,
    "scraping_insights": "San Francisco-based minimalist approach with exceptionally clean HTML. Their '/essentials/' category has 28 articles with specific capsule wardrobe formulas. No JavaScript dependencies - content loads in initial HTML. No bot protection. Critical insight: their 'Measurement Standards' articles contain exact garment dimensions in consistent HTML tables perfect for data extraction. URL structure: /category/essentials/page/2/"
  },
  {
    "name": "A Tailored Suit - Formal Rules",
    "domain": "atailoredsuit.com",
    "urls": [
      "https://www.atailoredsuit.com/blog/category/style-guides/",
      "https://www.atailoredsuit.com/blog/category/formal-wear/"
    ],
    "delay": 2.0,
    "priority": 9,
    "active": true,
    "scraping_insights": "WordPress-based with clean HTML structure despite formal focus. Their '/style-guides/' section contains 38 technical articles with exact black tie specifications. Cloudflare protection but predictable - requires proper headers including 'Sec-Fetch-Dest: document'. Critical insight: their 'Protocol' series contains machine-readable timing charts for formal events with exact minute-by-minute breakdowns. Image URLs follow /wp-content/uploads/[year]/[month]/[formality-level]-[protocol].jpg"
  },
  {
    "name": "Bespoke Unit - Color Theory",
    "domain": "bespokeunit.com",
    "urls": [
      "https://bespokeunit.com/color-coordination/guides/",
      "https://bespokeunit.com/style-guides/"
    ],
    "delay": 1.1,
    "priority": 8,
    "active": true,
    "scraping_insights": "Technical but incredibly detailed guides. Their color coordination section has 24 articles with Pantone references and exact color combinations. Content is statically rendered with clean HTML structure. No bot protection beyond basic rate limiting (1 request/second). Critical insight: their color guides contain machine-readable Pantone codes and exact RGB/HEX values in consistent spans. URL pattern: /color-coordination/guides/[color-family]-combinations/"
  },
  {
    "name": "Die, Workwear! - Professional Rules",
    "domain": "dieworkwear.com",
    "urls": [
      "https://dieworkwear.com/category/style-guides/",
      "https://dieworkwear.com/category/wardrobe-building/"
    ],
    "delay": 1.2,
    "priority": 8,
    "active": true,
    "scraping_insights": "Minimalist WordPress setup with extremely clean HTML. Their '/style-guides/' section has 45+ articles with specific, actionable rules for professional settings. No JavaScript dependencies for content. Pagination is predictable (/page/2/). Cloudflare present but only blocks requests without proper headers. Include 'Accept-Language: en-US,en;q=0.9' and 'DNT: 1' to bypass most blocks. Critical insight: their 'Industry Specific' guides contain exact dress code specifications by profession."
  },
  {
    "name": "Ivy Style - Traditional Foundations",
    "domain": "ivystyle.com",
    "urls": [
      "https://www.ivystyle.com/category/style-basics/",
      "https://www.ivystyle.com/category/style-rules/"
    ],
    "delay": 0.8,
    "priority": 8,
    "active": true,
    "scraping_insights": "Academic approach with incredibly detailed historical context. Their '/style-rules/' section contains 31 articles with exact specifications for traditional menswear. Static HTML with no JavaScript rendering required. No bot protection whatsoever - one of the few sites with completely open access. Critical insight: their 'Historical Standards' articles contain exact measurements from different eras in machine-readable format. Image URLs follow simple pattern: /wp-content/uploads/[year]/[month]/[era]-standards.jpg"
  },
  {
    "name": "Sharpography - Contemporary Rules",
    "domain": "sharpography.com",
    "urls": [
      "https://sharpography.com/category/style-guides/",
      "https://sharpography.com/category/fit-guides/"
    ],
    "delay": 1.0,
    "priority": 7,
    "active": true,
    "scraping_insights": "Modern WordPress setup with excellent content structure. Their '/style-guides/' section has 19 articles with specific, actionable guidelines for contemporary menswear. All content server-rendered - no client-side JavaScript needed. Cloudflare protection but easy to bypass with proper headers. Critical insight: their 'Technical Breakdown' articles contain exact construction details with machine-readable specifications in consistent HTML tables."
  },
  {
    "name": "The Armoury - Technical Specifications",
    "domain": "thearmoury.com",
    "urls": [
      "https://thearmoury.com/blogs/journal/style-guides",
      "https://thearmoury.com/blogs/journal/fit-guidelines"
    ],
    "delay": 2.2,
    "priority": 10,
    "active": true,
    "scraping_insights": "High-end retailer with exceptional educational content. Their '/fit-guidelines' section contains 15 technical guides with exact measurements and construction details. Shopify-based but content is statically rendered. Aggressive bot protection but predictable patterns - rotate user agents and include 'X-Requested-With: XMLHttpRequest' header. Critical insight: their technical articles contain machine-readable measurement charts in HTML tables with precise tolerances."
  },
  {
    "name": "Sartorial Notes - European Perspective",
    "domain": "sartorialnotes.com",
    "urls": [
      "https://sartorialnotes.com/category/style-guides/",
      "https://sartorialnotes.com/category/wardrobe-basics/"
    ],
    "delay": 0.5,
    "priority": 7,
    "active": true,
    "scraping_insights": "Minimalist design with exceptionally clean HTML. Their '/style-guides/' category has 22 articles with precise European styling guidelines. No JavaScript dependencies - content loads in initial HTML. No bot protection - completely open access. Perfect for scraping with simple requests. Critical insight: their 'Fabric Guide' series contains exact material specifications with machine-readable thread counts and weights."
  },
  {
    "name": "Mens Fashion Magazine - Technical Guides",
    "domain": "mensfashionmagazine.com",
    "urls": [
      "https://mensfashionmagazine.com/category/style-guides/",
      "https://mensfashionmagazine.com/category/fit-advice/"
    ],
    "delay": 1.6,
    "priority": 7,
    "active": true,
    "scraping_insights": "Technical focus with detailed construction insights. Their '/style-guides/' section has 39 articles with specific fabric composition breakdowns. WordPress-based with clean HTML structure. Moderate Cloudflare protection but predictable - triggers only after 3 rapid requests. Critical insight: their 'Technical Deep Dive' articles contain machine-readable data tables with exact measurements and material specifications in consistent HTML structures."
  },
  {
    "name": "Kinoti Style - Color Theory",
    "domain": "kinotistyle.com",
    "urls": [
      "https://kinotistyle.com/category/color-theory/",
      "https://kinotistyle.com/category/style-guides/"
    ],
    "delay": 0.9,
    "priority": 8,
    "active": true,
    "scraping_insights": "Specialized in color theory and palette building. Their '/color-theory/' section has 24 articles with exact color combination formulas. Clean HTML with minimal JavaScript. No bot protection. Critical insight: their 'Color Formula' articles contain machine-readable color codes (HEX, RGB, Pantone) in consistent HTML structures perfect for data extraction. Image URLs follow /wp-content/uploads/[year]/[month]/[palette-name]-[season].jpg"
  },
  {
    "name": "Tie Bar Blog - Accessory Rules",
    "domain": "the.tiebar.com",
    "urls": [
      "https://the.tiebar.com/blogs/blog/style-guides",
      "https://the.tiebar.com/blogs/blog/proportion-guides"
    ],
    "delay": 1.7,
    "priority": 7,
    "active": true,
    "scraping_insights": "Despite commercial focus, exceptional educational content. Their '/proportion-guides' section has 18 articles with exact ratio specifications for different body types. Shopify-based but blog content is statically rendered. Aggressive bot protection but bypassable with proper session management. Critical insight: their 'Ratio Charts' contain machine-readable proportion data in consistent HTML tables with exact measurements for different heights and builds."
  },
  {
    "name": "Brooks Brothers Journal - Heritage Rules",
    "domain": "brooksbrothers.com",
    "urls": [
      "https://www.brooksbrothers.com/journal/style-guides/",
      "https://www.brooksbrothers.com/journal/wardrobe-essentials/"
    ],
    "delay": 2.5,
    "priority": 8,
    "active": true,
    "scraping_insights": "Historic American brand with exceptional educational content. Their '/style-guides/' section contains 62 articles with specific heritage rules. Complex JavaScript-heavy site but article content is server-rendered in noscript tags. Heavy Cloudflare protection but predictable - requires cookie persistence and header rotation. Critical insight: their 'Archive' articles contain exact fabric specifications from different eras in machine-readable format within consistent HTML structures."
  },
  {
    "name": "Suitsupply Journal - European Fit",
    "domain": "suitsupply.com",
    "urls": [
      "https://suitsupply.com/us/journal/fit-guidelines",
      "https://suitsupply.com/us/journal/style-guides"
    ],
    "delay": 2.1,
    "priority": 9,
    "active": true,
    "scraping_insights": "European fit expertise with technical precision. Their '/fit-guidelines' section contains 28 articles with exact body measurement charts. React-based but article content is server-rendered. Moderate bot protection with rotating challenges. Critical insight: their 'Body Type' guides contain machine-readable measurement tables with exact proportions for different builds. Include 'X-Requested-With: XMLHttpRequest' header to bypass most protection. Their image CDN uses consistent naming with body type specifications."
  },
  {
    "name": "No Man Walks Alone - Curated Rules",
    "domain": "nomanwalksalone.com",
    "urls": [
      "https://nomanwalksalone.com/blogs/journal/style-guides",
      "https://nomanwalksalone.com/blogs/journal/fabric-guides"
    ],
    "delay": 1.9,
    "priority": 9,
    "active": true,
    "scraping_insights": "Curated approach with exceptional quality control. Their '/fabric-guides' section has 22 articles with specific material recommendations and construction details. Shopify-based but content is statically rendered. Aggressive bot protection but predictable patterns - rotate user agents between desktop and mobile. Critical insight: their 'Fabric Deep Dive' articles contain machine-readable material specifications with exact thread counts and seasonal recommendations in consistent HTML tables."
  }
]
