{
  "articles": [
    {
      "id": "331be013a578e4e120522e71822295ca",
      "url": "https://putthison.com/finding-the-perfect-loafer/",
      "domain": "putthison.com",
      "title": "Finding The Perfect Loafer",
      "body": "If I could only have three pairs of shoes, I’d go with a pair of loafers, some Norwegian split-toes, and some kind of boot (either work boots or side-zips). Like most men, I rarely wear a “serious suit” nowadays. “Serious suits” are limited to weddings, funerals, and other “serious occasions,” which means I don’t have much use for formal shoes such as oxfords (which, to my eye, only look right with suits). Derbies, on the other hand, can be worn with suits or sport coats, which gives them some versatility.Loafers are more casual still. For most people, they can be worn three seasons out of the year. They go just as well with summer sport coats as they do with autumnal tweeds. Depending on their design, they can also be worn with casual outfits. Loafers are easy to slip off and easier to slip on. And if you’re the type of person to wear shoes without socks, bare ankles look more natural with slip-ons than lace-ups.Choosing the right pair, however, requires some sensitivity to different design elements. Some loafers look better with sharply tailored trousers, while others look more at home with faded jeans. Some lean traditional, while others are fashion-forward. There’s no such thing as an “ultimate loafer,” but there are some that are better suited to your needs, lifestyle, and wardrobe. Here are some choices, along with suggestions on how to think through these various design elements.The Casual Penny LoaferWhen you close your eyes and imagine a penny loafer, you’re probably thinking of something like Bass Weejuns. These are your most casual pennies. Depending on their design, you can wear them with tailored chinos and a safari jacket or something as simple as jeans and a Harrington. You can even wear them with shorts and a madras shirt (a very New England look).When trying to discern a loafer’s formality, look first at the shape.Casual loafers will be rounder than their sleeker, more formal counterparts. They will often have minimal shaping near the waist (that part of the shoe that comes in near the arch of your foot).There may be other casualizing elements. Some penny loafers are made from a more casual leather, such asHorween’s Chromexcel. Others may be unlined, which means the uppers feel more comfortable, but they’ll reveal the shape of your foot more readily when worn (sort of like espadrilles). Many will have rougher stitching — a lower stitch count per inch, contrast colored threads, thicker threads, and saddle stitching around the apron (that part of the shoe that sits at the edge of the toe box). An apron with a raised lipped will look more casual than one that’s flatter and more discrete. Beefrolls on both sides of the penny strap, a stitched ridge at the heel cup, and flat rubber sole can also make a loafer look casual.You can find these from brands such asRancourt,Oak Street Bootmakers, andJay Butler. Slightly more refined versions, such asAurland(supposedly the original penny loafer), will have a similar casual vibe, but look less trad. These are the type of loafers you’ll want to wear with jeans, chinos, or shorts when hanging out at a BBQ, relaxing in the neighborhood, or doing other casual activities. Keep them with casualwear, rather than tailoring.Options:Sid Mashburn,Ralph Lauren,Oak Street Bootmakers,Rancourt,Aurland,Shipton & Heneage Milan, andJay Butler CromwellThe Dressy Penny LoaferIf you want something you can wear with suits and sport coats, choose a sleeker, more shapely penny loafer made from fine calfskin or suede. Loafers with finer, tonal stitching look dressier than ones with rougher stitching. A flatter apron will often look dressier than one with a raised lip, but it’s all about execution. In the photo above, you can see a pair ofCrockett & Jones Roseberywith a subtly raised lip that still looks relatively formal. It’s just not as raised or rough as what you see on theseRalph Laurens.The design of the vamp here is often overlooked as a design element.The term vamp refers to that part of the shoe that sits on top of your foot. High-vamp loafers come up higher on your foot, while low-vamp loafers terminate closer to your toes. As Mark Cho of The Armoury demonstrates in the video above, even when loafers are built on the same last, a higher vamp can help elongate the shape of your foot. This makes the shoes look sleeker and thus dressier.For me,Edward Green’s Piccadillyis the Platonic form of a dressy loafer. It’s sleek and shapely without being aggressively sharp. When made with the company’s dark oak leather, it’s something you can wear with nearly any tailored outfit. The only problem is the price. At about $1,300 retail, it’s painfully expensive. Even on eBay, you’ll find gently used versions going for about $750. Solid alternatives includeFoster & Son Burford,The Armoury’s Duane,Carmina 80191,Sons of Henrey, andMeermin 114284.Options:Edward Green Piccadilly,The Armoury Duane,George Cleverley Bradley,Crockett & Jones Rosebery,Löf & Tung Francisco,Löf & Tung Abreau,Morjas,Carmina 80708,Carmina 80191,Alden,TLB Mallorca Martin,TLB Mallorca Artista,Sons of Henrey,Shipton & Heneage Wilton,Meermin 114284, andMeermin 101484The In-Betweener Penny LoaferDressy loafers look most at home with tailored clothing, while casual loafers look better when kept to casualwear. But what if you want a versatile loafer that can do both? Straddling these two worlds can be like threading a needle, but it can be done.First, a lot depends on your wardrobe. If your tailoring leans trad (more straight-waisted American, rather sleek Italian or structured British) and your casualwear leans classic, it’s easier to find loafers that can do double duty. The key is to get loafers with a mix of the different design elements mentioned above: a rounder last, rather than sleek, and something with a combination of formal and informal elements. You want something made from a “dress shoe” leather, such as fine calfskin, scotch grain leather, or shell cordovan, rather than uber-casual material such as Horween’s Chromexcel. Raised lipped aprons and split-toe seams can make a dressy loafer look causal, but beefrolls would be a step too far.There are two excellent options here.Alden’s Leisure Handsewn(colloquially known as the LHS) is ideal if your style leans trad. It’s perfect for wearing with things such as Shetland sweaters, oxford button-downs, and five-pocket cords. At the same time, you can dress it up with a sport coat and pair of flannel trousers. This is the post-war Ivy look — a style that perfectly expresses the dressed-down, tailored style that the United States made famous.Get the LHS in Horween’s #8 shell cordovanif you can afford it. Otherwise, it also looks great inbrown suede.Alternatively, you can also tryJM Weston’s 180, a high-walled penny loafer that’s closely associated with theBCBG social group in France. In the United States, this JM Weston loafer doesn’t carry the same class connotations, so it’s easier to wear these with a mix of things. The 180 goes well with tailored trousers and a sport coat, sometimes even casual suits. At the same time, the chunky silhouette looks natural with jeans and casualwear from labels such asCamoshita,Private White VC, andDe Bonne Facture.Options:Alden Leisure Handsewn,JM Weston 180,Crockett & Jones Boston,Crockett & Jones Harvard,Löf & Tung Xavier,John Lobb Lopez,Sid Mashburn,Carmina 80579,Carmina 10082,Allen Edmonds Randolph,Allen Edmonds Cavanaugh,Grant Stone Traveler,Barbanera,Shipton & Heneage Arran, andVass NorwegerThe Flashy Horsebit LoaferIn the world of slip-on shoes, no style is more controversial than the horsebit. The style is associated with flashy dressers, aggressive powerbrokers, and arrivistes. In the 2013 filmThe Wolf of Wall Street, New York stockbroker Jordan Belfort (played by Leonard DiCaprio) wears jet-black Gucci horsebit loafers with strong-shouldered pinstripe suits, starched white collars, and power ties. The silhouette perfectly conveys the sort of greed-is-good ethos that we associate with bankers in the 1980s, when this film was set.Reasonably, many people shy away from snaffle bit loafers for these reasons. They can feel too aggressive and flashy, like wearing the footwear version of a gold Rolex. At the same time, the style has some important design elements that make it surprisingly versatile. The ridged apron and rounded toe allow it to look at home with jeans, while the dressy leather and shiny horsebit make dressy enough for suits. In his bookElegance, Bruce Boyer writes: “In short, it was the first shoe that bridged the gap between casual and business wear. This dressy slip-on was refined with fine, lightweight calfskin, a pared-down shape, and a metal snaffle bit, and as such, it became avenue-elegant and gained acceptance in corporate board rooms and country clubs alike.”If you’re anything like me, you’ll probably never step foot in a country club or corporate board room. But there’s still something appealing about this loafer. It looks great with drapey suits or sport coats — ones cut with a broader shoulder line, longer coat, and pleated trousers — or even casualwear from brands such as Aime Leon Dore (this is a very Gucci horsebit outfit).Since it’s the original,the Gucci 1953is naturally the most iconic. It’s the shoe that has been in the costume collection of New York’s Metropolitan Museum, Lisa Birnbach’s 1980 tongue-in-cheek guideThe Official Preppy Handbook, and countless films and TV shows. But there are also many worthwhile alternatives, includingCarmina’s 580746andAlden’s Cape Cod.Jay Butler’s Milbankis perhaps the most affordable of all. If you’re buying something because you want a cheaper version of the Gucci, then you will end up being disappointed because it’ll live in the shadow of the thing you want. But I think many of these other shoes are good on their own merits. Carmina’s are lined in calfskin, rather than Gucci’s use of canvas, while Alden’s have a made-in-USA cred that will be important in trad circles. Buy the one that appeals most to you.Options:Gucci 1953,Carmina 580746,Carmina 80570,Jay Butler Milbank,Allen Edmonds Verona II,Beckett Simonon Beaumont,Oak Street Bootmakers, andAlden Cape CodThe Conservative Tassel LoaferA few years ago, I was hanging out with my friend Agyesh Madan, the owner and designer behind the Italian-inspired casualwear lineStoffa. That day, Agyesh wore a grey suede flight jacket, taupe cotton trousers, and a pair of blue suede Belgian loafers. Belgians aren’t an easy style to pull off. They’re a little dainty and ostentatious, with a ridiculous, miniature bow sitting on the vamp. You usually see them onwhite, upper-class preps hanging around the Hamptons(or, more likely, guys who like to affect the same pretenses). Agyesh can pull them off because he’s anything but. As an Indian man with a scruffy beard, who wears leather jackets as part of his daily uniform, Agyesh says Belgians help soften his look.Which is how I feel about the question that gets asked every summer: “Are tassel loafers only for old guys?” The answer is yes, which is why anyone can wear them. Whether you’re 30 or 60 years old, into traditional American style or something more contemporary, tassel loafers can work so long as you know how to incorporate them into your wardrobe. It’s all about playing into or against the social stereotype.I fell in love with tassel loafers in much the same way that I fell in love with a lot of classic clothing: I got inspired by how other cultures adopted these items.I love how older Japanese guys in the tailoring industry wear tassel loafers, particularly those inspired by Italian men who copy British and American dressers.In this remixing of culture, you often see jaunty tassel loafers worn with soft-shouldered suits and sport coats, trad-y outfits involving Shetland sweaters, andeven a bit of workwear.For me,nothing beats Alden. Along with being the originator of this style, their tassel loafers have that perfect low-vamp shape and rounded toe box. This is the sort of shoe you see shuffling around dusty trad shops such asO’Connell’s. But there are also some other good contenders, such as the tassel loafers fromSid Mashburn,The Armoury, andRalph Lauren. Brown will always be your most versatile color, butblack tassel loafers are surprising chic and useful. You can wear them in any outfit where you can imagine wearing a black knit tie. They go with navy sport coats and grey trousers, brown tweeds paired with taupe whipcords, and any kind of suit.Options:Alden,Ralph Lauren Booth,Ralph Lauren Quillis,Allen Edmonds Grayson,Sid Mashburn,Carmina 80481,Edward Green Belgravia,The Armoury Hudson,Foster & Son Arlington,Morjas,Oak Street Bootmakers,TLB Mallorca Lancaster,Grant Stone,Barbanera,Shipton & Heneage Finchley,Meermin 101412, andMeermin 101381The “Post Sneaker” LoaferFor a small community of men online, there has been a lot of chatter lately about whether we’re entering a “post sneaker world.” This prophetic phrase, fueled by Lawrence Schlossman and James’ Harris podcastThrowing Fits, suggests that some men are tired of entering and losing raffles for rare Nikes and subsequently paying inflated prices on the secondary market. They may also be looking to dress more appropriately for their age. As many move from shopping at Supreme to Aime Leon Dore, they’re searching for shoes to match.Earlier this month,Jacob Gallagher of theWall Street Journalwrote about this section of “very tapped-in twenty- or thirtysomething consumers.” “[T]he Throwing Fits listeners and their cohort are not interested in tasteful yet generic Allen Edmonds, or the sort of safely somber Salvatore Ferragamo dress loafers you might have worn for decades. They’re more intrigued by designs from upstart, mostly online-only brands that tweak loafers with aplomb.”It’s difficult to describe the “post sneaker loafer,” but as Gallagher notes, these are not your traditional styles. These companies mix elements from various designs, such as the chunky, 360-degree welt you might find on a country brogue with anunusually designed tassel loafer. Or acamp moc with a snaffle bit on the strap. Fundamentally, these are designed to be worn with slightly more fashion-forward outfits, such as the workwear style you might find atMonitalyorEngineered Garments.You can see how these outfits are put together inBlackstock & Weber’s lookbook. The taupe, windowpane trousers, tan sweater, and long olive trenchcoat in the photo above is a reasonably classic outfit, but in a more modern color combination. It also looks great with the subtly updatedBlackstock & Weber spectator loafers, which have a chunkier silhouette than traditional varieties.Crockett & Jones’ Crewe loaferlookstoorefined in comparison. I like Blackstock & Weber’s Mason horsebit loafer the most.Available pebble grainorembossed croc, it’s something you can wear with slim jeans andfuzzy mohair cardigans,camp collar shirts, oropen lace tops. “They’re great if you like chunky shoes,” saysNo Man Walks Alone’sGreg Lellouche,who owns a pair in brown suede and with lug soles. “I think of them more as aTimberland 3-eye lugthan a menswear loafer.”Options:Blackstock & Weber,Aime Leon Dore,Horatio,Vinny’s, andYuketenFiled Under:Guides,Loafers,Shoes",
      "author": "Derek Guy",
      "date": "2021-06-28T19:43:34+00:00",
      "word_count": 2385,
      "scraped_at": "2025-11-07T18:43:52.426460"
    },
    {
      "id": "f06d597e720d3c929cc4e38a8edbee17",
      "url": "https://dappered.com/2025/01/25-irrefutable-mens-style-rules/",
      "domain": "dappered.com",
      "title": "25 Irrefutable Men’s Style Rules",
      "body": "1. Makeyour first suit purchaseacharcoal two button with notch lapels.2. Afour-in-handis the right tie knot 98.6% of the time.3. Wool socks > cotton socks. Andthey’re worth the price.4.Laundromatsare a fact of life. The machines will also lie about the temperature settings and cook your clothes.5. Dark wash denim will never go out of style…6. …unless they’ve been cut into jean shorts.7. Being overdressed may get you snide comments. It’ll also get you the job (or the date).8. That said, no one likes a show off.Know the difference between effort and peacocking.9. Learn toiron.10. And sew on a button.11. And while you’re at it,how to shine(read: polish) some dress shoes.12. Find a good tailor you trust.They can make affordable clothing look amazing on you.13. But you tailor also can’t do a thing about shoes that don’t fit right. Be particular about shoes and prioritize your feet.14. Wearing cologne is a team sport. It’s up to the wearer to anticipate who does and who does not want to be on their team on any given day, in any given situation.15. Blues, grays, browns, black.That’s the foundation.16.A crisp white dress shirtwith a nice looking semi spread collar is rarely the wrong call.17. Dry-clean your suits and sportcoats only when absolutely necessary (sweat, smoke, or other stink = necessary).18. 80% of the time you can steam it instead of fully dry cleaning it. It’ll look and feel refreshed. Soinvest in a steamer.19. Build a habit oftrying a little more than you have to. Like when you’re getting on a flight, when grocery shopping, or when home alone. Practice builds confidence, and it’ll be therethe day you really need it.20. Body hair (pits, chest, groin) is part ofbeing a mammal. You’re allowed totrim it. But shaving it is asking for trouble.21. There areinternational standardsfor distance (meters,) time (seconds,) and mass (kilos). But a 32″ waist or medium shirt size will never,everfit the same from brand to brand.22. If your barber says “want me to hit those eyebrows?” it’s probably not a question, and the answer is almost certainly “yes, thanks.”23. “Accessories = Last things on, first things noticed.” So keep it under control. More than two eye-catching accessories and you’ll start to look likea one man band.24. Floss. Listen. Say thank you. Don’t be pedantic. Get the door. Smile. Tip well. Drink plenty of water. Sleep on it. Treat others with respect and dignity. Having style is about more than just what you wear.25. There are no rules. Only guidelines.",
      "author": "Joe",
      "date": "2025-01-04T10:00:17-07:00",
      "word_count": 415,
      "scraped_at": "2025-11-07T18:43:54.213655"
    },
    {
      "id": "03ac05500bc216cc2d5f37c708a34c26",
      "url": "https://ivy-style.com/the-oxford-cloth-button-down-is-back.html",
      "domain": "ivy-style.com",
      "title": "The Oxford Cloth Button-Down is Back. Did it ever leave?",
      "body": "By Matthew LongcorePhoto: Brooks Brothers American Made Heritage OCBD Dress ShirtIn an article forThe Wall Street Journal, Hamish Anderson writes:“Oxfords are beloved as a super-safe wardrobe staple. Their silhouettes tend to be unfussy. And at their most classic, the shirts are finished with a button-down collar (a style known as the Oxford Cloth Button Down, or OCBD). So preppy are these garments, they conjure images of 1950s Ivy League students sipping Cape Codders and ignoring their exams.”Yes indeed, and that’s why we love the Oxford Cloth Button-Down. It is a classic, timeless clothing item that never goes out of style. The article goes on to describe current “trends” such as the contrast collar, the camp collar, and – gasp – no collar at all. Yikes, we surely don’t need that.The Official Preppy Handbook rightfully describes the importance of the OCBD and the collar:“The classic shirt is the Brooks Brothers button-down all cotton oxford cloth shirt. Pink is the most famous color, and it is widely supposed that no one except Brooks has ever been able to achieve that perfect pink or that perfect roll to the collar.”As stated in the Preppy Handbook, one should have the OCBD in blue, white, pink, and yellow. An illustration in the Preppy Handbook features the classic OCBD from Brooks Brothers and also shows the J. Press pocket with flap, which is a variation preferred by some preppies.Brooks Brothers,J. Press,The Andover Shop,Mercer & Sons, andO’Connell’sall offer classic Oxford Cloth Button-Down shirts andPolo Ralph Laurenhas a nice version too.Stick to the classics!Related Posts:Brooks Brothers Celebrates 125 Years of the…Brooks Brothers + Preppy Handbook Fan Club GiveawayAnd Now A Word From Ivy Frontman Mr. Kevin Danyi on…English Tweed Suit by Abraham Moon & SonsGatsby at 100: Stylish Old SportThe Duffle Coat - An Ivy ClassicFrom The EditorAmerican rep ties vs. British regimental ties",
      "author": "Matthew Longcore",
      "date": "2024-07-17T20:13:36+00:00",
      "word_count": 306,
      "scraped_at": "2025-11-07T18:43:57.001978"
    }
  ],
  "metadata": {
    "total": 3,
    "last_updated": "2025-11-07T18:43:58.004322"
  }
}